struct dirent {
	__ino_t                    d_ino;                /*     0     8 */
	__off_t                    d_off;                /*     8     8 */
	short unsigned int         d_reclen;             /*    16     2 */
	unsigned char              d_type;               /*    18     1 */
	char                       d_name[256];          /*    19   256 */
	/* --- cacheline 4 boundary (256 bytes) was 19 bytes ago --- */

	/* size: 280, cachelines: 5, members: 5 */
	/* padding: 5 */
	/* last cacheline: 24 bytes */
};
struct _IO_FILE {
	int                        _flags;               /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	char *                     _IO_read_ptr;         /*     8     8 */
	char *                     _IO_read_end;         /*    16     8 */
	char *                     _IO_read_base;        /*    24     8 */
	char *                     _IO_write_base;       /*    32     8 */
	char *                     _IO_write_ptr;        /*    40     8 */
	char *                     _IO_write_end;        /*    48     8 */
	char *                     _IO_buf_base;         /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	char *                     _IO_buf_end;          /*    64     8 */
	char *                     _IO_save_base;        /*    72     8 */
	char *                     _IO_backup_base;      /*    80     8 */
	char *                     _IO_save_end;         /*    88     8 */
	struct _IO_marker *        _markers;             /*    96     8 */
	struct _IO_FILE *          _chain;               /*   104     8 */
	int                        _fileno;              /*   112     4 */
	int                        _flags2;              /*   116     4 */
	__off_t                    _old_offset;          /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	short unsigned int         _cur_column;          /*   128     2 */
	signed char                _vtable_offset;       /*   130     1 */
	char                       _shortbuf[1];         /*   131     1 */

	/* XXX 4 bytes hole, try to pack */

	_IO_lock_t *               _lock;                /*   136     8 */
	__off64_t                  _offset;              /*   144     8 */
	void *                     __pad1;               /*   152     8 */
	void *                     __pad2;               /*   160     8 */
	void *                     __pad3;               /*   168     8 */
	void *                     __pad4;               /*   176     8 */
	size_t                     __pad5;               /*   184     8 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	int                        _mode;                /*   192     4 */
	char                       _unused2[20];         /*   196    20 */

	/* size: 216, cachelines: 4, members: 29 */
	/* sum members: 208, holes: 2, sum holes: 8 */
	/* last cacheline: 24 bytes */
};
struct mntent {
	char *                     mnt_fsname;           /*     0     8 */
	char *                     mnt_dir;              /*     8     8 */
	char *                     mnt_type;             /*    16     8 */
	char *                     mnt_opts;             /*    24     8 */
	int                        mnt_freq;             /*    32     4 */
	int                        mnt_passno;           /*    36     4 */

	/* size: 40, cachelines: 1, members: 6 */
	/* last cacheline: 40 bytes */
};
struct _IO_marker {
	struct _IO_marker *        _next;                /*     0     8 */
	struct _IO_FILE *          _sbuf;                /*     8     8 */
	int                        _pos;                 /*    16     4 */

	/* size: 24, cachelines: 1, members: 3 */
	/* padding: 4 */
	/* last cacheline: 24 bytes */
};
struct __pthread_internal_list {
	struct __pthread_internal_list * __prev;         /*     0     8 */
	struct __pthread_internal_list * __next;         /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct __pthread_mutex_s {
	int                        __lock;               /*     0     4 */
	unsigned int               __count;              /*     4     4 */
	int                        __owner;              /*     8     4 */
	unsigned int               __nusers;             /*    12     4 */
	int                        __kind;               /*    16     4 */
	short int                  __spins;              /*    20     2 */
	short int                  __elision;            /*    22     2 */
	__pthread_list_t           __list;               /*    24    16 */

	/* size: 40, cachelines: 1, members: 8 */
	/* last cacheline: 40 bytes */
};
struct statvfs {
	long unsigned int          f_bsize;              /*     0     8 */
	long unsigned int          f_frsize;             /*     8     8 */
	__fsblkcnt_t               f_blocks;             /*    16     8 */
	__fsblkcnt_t               f_bfree;              /*    24     8 */
	__fsblkcnt_t               f_bavail;             /*    32     8 */
	__fsfilcnt_t               f_files;              /*    40     8 */
	__fsfilcnt_t               f_ffree;              /*    48     8 */
	__fsfilcnt_t               f_favail;             /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	long unsigned int          f_fsid;               /*    64     8 */
	long unsigned int          f_flag;               /*    72     8 */
	long unsigned int          f_namemax;            /*    80     8 */
	int                        __f_spare[6];         /*    88    24 */

	/* size: 112, cachelines: 2, members: 12 */
	/* last cacheline: 48 bytes */
};
struct ds {
	char *                     string;               /*     0     8 */
	size_t                     length;               /*     8     8 */
	size_t                     allocated;            /*    16     8 */

	/* size: 24, cachelines: 1, members: 3 */
	/* last cacheline: 24 bytes */
};
struct hmap_node {
	size_t                     hash;                 /*     0     8 */
	struct hmap_node *         next;                 /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct hmap {
	struct hmap_node * *       buckets;              /*     0     8 */
	struct hmap_node *         one;                  /*     8     8 */
	size_t                     mask;                 /*    16     8 */
	size_t                     n;                    /*    24     8 */

	/* size: 32, cachelines: 1, members: 4 */
	/* last cacheline: 32 bytes */
};
struct shash {
	struct hmap                map;                  /*     0    32 */

	/* size: 32, cachelines: 1, members: 1 */
	/* last cacheline: 32 bytes */
};
struct latch {
	int                        fds[2];               /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct ovs_list {
	struct ovs_list *          prev;                 /*     0     8 */
	struct ovs_list *          next;                 /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct ovs_mutex {
	pthread_mutex_t            lock;                 /*     0    40 */
	const char  *              where;                /*    40     8 */

	/* size: 48, cachelines: 1, members: 2 */
	/* last cacheline: 48 bytes */
};
struct ovsthread_once {
	_Bool                      done;                 /*     0     1 */

	/* XXX 7 bytes hole, try to pack */

	struct ovs_mutex           mutex;                /*     8    48 */

	/* size: 56, cachelines: 1, members: 2 */
	/* sum members: 49, holes: 1, sum holes: 7 */
	/* last cacheline: 56 bytes */
};
struct process_info {
	long unsigned int          vsz;                  /*     0     8 */
	long unsigned int          rss;                  /*     8     8 */
	long long int              booted;               /*    16     8 */
	int                        crashes;              /*    24     4 */

	/* XXX 4 bytes hole, try to pack */

	long long int              uptime;               /*    32     8 */
	long long int              cputime;              /*    40     8 */
	int                        core_id;              /*    48     4 */
	char                       name[18];             /*    52    18 */
	/* --- cacheline 1 boundary (64 bytes) was 6 bytes ago --- */

	/* size: 72, cachelines: 2, members: 8 */
	/* sum members: 66, holes: 1, sum holes: 4 */
	/* padding: 2 */
	/* last cacheline: 8 bytes */
};
struct smap {
	struct hmap                map;                  /*     0    32 */

	/* size: 32, cachelines: 1, members: 1 */
	/* last cacheline: 32 bytes */
};
struct vlog_module {
	struct ovs_list            list;                 /*     0    16 */
	const char  *              name;                 /*    16     8 */
	int                        levels[3];            /*    24    12 */
	int                        min_level;            /*    36     4 */
	_Bool                      honor_rate_limits;    /*    40     1 */

	/* size: 48, cachelines: 1, members: 5 */
	/* padding: 7 */
	/* last cacheline: 48 bytes */
};
struct eth_addr {
	union {
		uint8_t            ea[6];                /*           6 */
		ovs_be16           be16[3];              /*           6 */
	};                                               /*     0     6 */

	/* size: 6, cachelines: 1, members: 1 */
	/* last cacheline: 6 bytes */
};
struct eth_addr64 {
	union {
		uint8_t            ea64[8];              /*           8 */
		ovs_be16           be16[4];              /*           8 */
	};                                               /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct geneve_opt {
	ovs_be16                   opt_class;            /*     0     2 */
	uint8_t                    type;                 /*     2     1 */
	uint8_t                    length:5;             /*     3: 3  1 */
	uint8_t                    r3:1;                 /*     3: 2  1 */
	uint8_t                    r2:1;                 /*     3: 1  1 */
	uint8_t                    r1:1;                 /*     3: 0  1 */

	/* size: 4, cachelines: 1, members: 6 */
	/* last cacheline: 4 bytes */
};
struct sockaddr_storage {
	sa_family_t                ss_family;            /*     0     2 */
	char                       __ss_padding[118];    /*     2   118 */
	/* --- cacheline 1 boundary (64 bytes) was 56 bytes ago --- */
	long unsigned int          __ss_align;           /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */

	/* size: 128, cachelines: 2, members: 3 */
};
struct sockaddr_in {
	sa_family_t                sin_family;           /*     0     2 */
	in_port_t                  sin_port;             /*     2     2 */
	struct in_addr             sin_addr;             /*     4     4 */
	unsigned char              sin_zero[8];          /*     8     8 */

	/* size: 16, cachelines: 1, members: 4 */
	/* last cacheline: 16 bytes */
};
struct in_addr {
	in_addr_t                  s_addr;               /*     0     4 */

	/* size: 4, cachelines: 1, members: 1 */
	/* last cacheline: 4 bytes */
};
struct in6_addr {
	union {
		uint8_t            __u6_addr8[16];       /*          16 */
		uint16_t           __u6_addr16[8];       /*          16 */
		uint32_t           __u6_addr32[4];       /*          16 */
	} __in6_u;                                       /*     0    16 */

	/* size: 16, cachelines: 1, members: 1 */
	/* last cacheline: 16 bytes */
};
struct tun_metadata {
	union {
		uint64_t           map;                  /*           8 */
		uint8_t            len;                  /*           1 */
	} present;                                       /*     0     8 */
	const struct tun_table  *  tab;                  /*     8     8 */
	union {
		uint8_t            u8[256];              /*         256 */
		struct geneve_opt  gnv[63];              /*         252 */
	} opts;                                          /*    16   256 */
	/* --- cacheline 4 boundary (256 bytes) was 16 bytes ago --- */

	/* size: 272, cachelines: 5, members: 3 */
	/* last cacheline: 16 bytes */
};
struct tun_metadata_loc_chain {
	struct tun_metadata_loc_chain * next;            /*     0     8 */
	int                        offset;               /*     8     4 */
	int                        len;                  /*    12     4 */

	/* size: 16, cachelines: 1, members: 3 */
	/* last cacheline: 16 bytes */
};
struct tun_metadata_loc {
	int                        len;                  /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	struct tun_metadata_loc_chain c;                 /*     8    16 */

	/* size: 24, cachelines: 1, members: 2 */
	/* sum members: 20, holes: 1, sum holes: 4 */
	/* last cacheline: 24 bytes */
};
struct tun_metadata_match_entry {
	struct tun_metadata_loc    loc;                  /*     0    24 */
	_Bool                      masked;               /*    24     1 */

	/* size: 32, cachelines: 1, members: 2 */
	/* padding: 7 */
	/* last cacheline: 32 bytes */
};
struct tun_metadata_allocation {
	struct tun_metadata_match_entry entry[64];       /*     0  2048 */
	/* --- cacheline 32 boundary (2048 bytes) --- */
	int                        alloc_offset;         /*  2048     4 */
	_Bool                      valid;                /*  2052     1 */

	/* size: 2056, cachelines: 33, members: 3 */
	/* padding: 3 */
	/* last cacheline: 8 bytes */
};
struct flow_tnl {
	ovs_be32                   ip_dst;               /*     0     4 */
	struct in6_addr            ipv6_dst;             /*     4    16 */
	ovs_be32                   ip_src;               /*    20     4 */
	struct in6_addr            ipv6_src;             /*    24    16 */
	ovs_be64                   tun_id;               /*    40     8 */
	uint16_t                   flags;                /*    48     2 */
	uint8_t                    ip_tos;               /*    50     1 */
	uint8_t                    ip_ttl;               /*    51     1 */
	ovs_be16                   tp_src;               /*    52     2 */
	ovs_be16                   tp_dst;               /*    54     2 */
	ovs_be16                   gbp_id;               /*    56     2 */
	uint8_t                    gbp_flags;            /*    58     1 */

	/* XXX 1 byte hole, try to pack */

	ovs_be32                   erspan_idx;           /*    60     4 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	uint8_t                    erspan_ver:2;         /*    64: 6  1 */
	uint8_t                    erspan_dir:1;         /*    64: 5  1 */
	uint8_t                    erspan_hwid:5;        /*    64: 0  1 */

	/* XXX 7 bytes hole, try to pack */

	struct tun_metadata        metadata;             /*    72   272 */
	/* --- cacheline 5 boundary (320 bytes) was 24 bytes ago --- */

	/* size: 344, cachelines: 6, members: 17 */
	/* sum members: 336, holes: 2, sum holes: 8 */
	/* last cacheline: 24 bytes */
};
struct flow_nsh {
	uint8_t                    flags;                /*     0     1 */
	uint8_t                    mdtype;               /*     1     1 */
	uint8_t                    np;                   /*     2     1 */
	uint8_t                    si;                   /*     3     1 */
	ovs_be32                   spi;                  /*     4     4 */
	ovs_be32                   c[4];                 /*     8    16 */

	/* size: 24, cachelines: 1, members: 6 */
	/* last cacheline: 24 bytes */
};
struct ovs_key_ct_tuple_ipv4 {
	ovs_be32                   ipv4_src;             /*     0     4 */
	ovs_be32                   ipv4_dst;             /*     4     4 */
	ovs_be16                   src_port;             /*     8     2 */
	ovs_be16                   dst_port;             /*    10     2 */
	uint8_t                    ipv4_proto;           /*    12     1 */

	/* size: 16, cachelines: 1, members: 5 */
	/* padding: 3 */
	/* last cacheline: 16 bytes */
};
struct ovs_key_ct_tuple_ipv6 {
	struct in6_addr            ipv6_src;             /*     0    16 */
	struct in6_addr            ipv6_dst;             /*    16    16 */
	ovs_be16                   src_port;             /*    32     2 */
	ovs_be16                   dst_port;             /*    34     2 */
	uint8_t                    ipv6_proto;           /*    36     1 */

	/* size: 40, cachelines: 1, members: 5 */
	/* padding: 3 */
	/* last cacheline: 40 bytes */
};
struct ofpbuf {
	void *                     base;                 /*     0     8 */
	void *                     data;                 /*     8     8 */
	uint32_t                   size;                 /*    16     4 */
	uint32_t                   allocated;            /*    20     4 */
	void *                     header;               /*    24     8 */
	void *                     msg;                  /*    32     8 */
	struct ovs_list            list_node;            /*    40    16 */
	enum ofpbuf_source         source;               /*    56     1 */

	/* size: 64, cachelines: 1, members: 8 */
	/* padding: 7 */
};
struct pkt_metadata {
	union {
		OVS_CACHE_LINE_MARKER cacheline0;        /*           1 */
		struct {
			uint32_t   recirc_id;            /*     0     4 */
			uint32_t   dp_hash;              /*     4     4 */
			uint32_t   skb_priority;         /*     8     4 */
			uint32_t   pkt_mark;             /*    12     4 */
			uint8_t    ct_state;             /*    16     1 */
			_Bool      ct_orig_tuple_ipv6;   /*    17     1 */
			uint16_t   ct_zone;              /*    18     2 */
			uint32_t   ct_mark;              /*    20     4 */
			ovs_u128   ct_label;             /*    24    16 */
			union flow_in_port in_port;      /*    40     4 */
		};                                       /*          48 */
		uint8_t            pad0[64];             /*          64 */
	};                                               /*     0    64 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	union {
		OVS_CACHE_LINE_MARKER cacheline1;        /*           1 */
		struct {
			union {
				struct ovs_key_ct_tuple_ipv4 ipv4; /*          16 */
				struct ovs_key_ct_tuple_ipv6 ipv6; /*          40 */
			} ct_orig_tuple;                 /*    64    40 */
		};                                       /*          40 */
		uint8_t            pad1[64];             /*          64 */
	};                                               /*    64    64 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	union {
		OVS_CACHE_LINE_MARKER cacheline2;        /*           1 */
		struct {
			struct flow_tnl tunnel;          /*   128   344 */
			/* --- cacheline 5 boundary (320 bytes) was 24 bytes ago --- */
		};                                       /*         344 */
		uint8_t            pad2[384];            /*         384 */
	};                                               /*   128   384 */
	/* --- cacheline 8 boundary (512 bytes) --- */

	/* size: 512, cachelines: 8, members: 3 */
};
struct cfm_settings {
	uint64_t                   mpid;                 /*     0     8 */
	int                        interval;             /*     8     4 */
	_Bool                      extended;             /*    12     1 */
	_Bool                      demand;               /*    13     1 */
	_Bool                      opup;                 /*    14     1 */

	/* XXX 1 byte hole, try to pack */

	uint16_t                   ccm_vlan;             /*    16     2 */
	uint8_t                    ccm_pcp;              /*    18     1 */
	_Bool                      check_tnl_key;        /*    19     1 */

	/* size: 24, cachelines: 1, members: 8 */
	/* sum members: 19, holes: 1, sum holes: 1 */
	/* padding: 4 */
	/* last cacheline: 24 bytes */
};
struct cfm_status {
	enum cfm_fault_reason      faults;               /*     0     4 */
	int                        remote_opstate;       /*     4     4 */
	uint64_t                   flap_count;           /*     8     8 */
	int                        health;               /*    16     4 */

	/* XXX 4 bytes hole, try to pack */

	uint64_t *                 rmps;                 /*    24     8 */
	size_t                     n_rmps;               /*    32     8 */

	/* size: 40, cachelines: 1, members: 6 */
	/* sum members: 36, holes: 1, sum holes: 4 */
	/* last cacheline: 40 bytes */
};
struct ovs_refcount {
	unsigned int               count;                /*     0     4 */

	/* size: 4, cachelines: 1, members: 1 */
	/* last cacheline: 4 bytes */
};
struct coverage_counter {
	const char  *const         name;                 /*     0     8 */
	unsigned int ()(void) *const count;              /*     8     8 */
	long long unsigned int     total;                /*    16     8 */
	long long unsigned int     last_total;           /*    24     8 */
	unsigned int               min[12];              /*    32    48 */
	/* --- cacheline 1 boundary (64 bytes) was 16 bytes ago --- */
	unsigned int               hr[60];               /*    80   240 */
	/* --- cacheline 5 boundary (320 bytes) --- */

	/* size: 320, cachelines: 5, members: 6 */
};
struct flow {
	struct flow_tnl            tunnel;               /*     0   344 */
	/* --- cacheline 5 boundary (320 bytes) was 24 bytes ago --- */
	ovs_be64                   metadata;             /*   344     8 */
	uint32_t                   regs[16];             /*   352    64 */
	/* --- cacheline 6 boundary (384 bytes) was 32 bytes ago --- */
	uint32_t                   skb_priority;         /*   416     4 */
	uint32_t                   pkt_mark;             /*   420     4 */
	uint32_t                   dp_hash;              /*   424     4 */
	union flow_in_port         in_port;              /*   428     4 */
	uint32_t                   recirc_id;            /*   432     4 */
	uint8_t                    ct_state;             /*   436     1 */
	uint8_t                    ct_nw_proto;          /*   437     1 */
	uint16_t                   ct_zone;              /*   438     2 */
	uint32_t                   ct_mark;              /*   440     4 */
	ovs_be32                   packet_type;          /*   444     4 */
	/* --- cacheline 7 boundary (448 bytes) --- */
	ovs_u128                   ct_label;             /*   448    16 */
	uint32_t                   conj_id;              /*   464     4 */
	ofp_port_t                 actset_output;        /*   468     4 */
	struct eth_addr            dl_dst;               /*   472     6 */
	struct eth_addr            dl_src;               /*   478     6 */
	ovs_be16                   dl_type;              /*   484     2 */
	uint8_t                    pad1[2];              /*   486     2 */
	union flow_vlan_hdr        vlans[2];             /*   488     8 */
	ovs_be32                   mpls_lse[4];          /*   496    16 */
	/* --- cacheline 8 boundary (512 bytes) --- */
	ovs_be32                   nw_src;               /*   512     4 */
	ovs_be32                   nw_dst;               /*   516     4 */
	ovs_be32                   ct_nw_src;            /*   520     4 */
	ovs_be32                   ct_nw_dst;            /*   524     4 */
	struct in6_addr            ipv6_src;             /*   528    16 */
	struct in6_addr            ipv6_dst;             /*   544    16 */
	struct in6_addr            ct_ipv6_src;          /*   560    16 */
	/* --- cacheline 9 boundary (576 bytes) --- */
	struct in6_addr            ct_ipv6_dst;          /*   576    16 */
	ovs_be32                   ipv6_label;           /*   592     4 */
	uint8_t                    nw_frag;              /*   596     1 */
	uint8_t                    nw_tos;               /*   597     1 */
	uint8_t                    nw_ttl;               /*   598     1 */
	uint8_t                    nw_proto;             /*   599     1 */
	struct in6_addr            nd_target;            /*   600    16 */
	struct eth_addr            arp_sha;              /*   616     6 */
	struct eth_addr            arp_tha;              /*   622     6 */
	ovs_be16                   tcp_flags;            /*   628     2 */
	ovs_be16                   pad2;                 /*   630     2 */
	struct flow_nsh            nsh;                  /*   632    24 */
	/* --- cacheline 10 boundary (640 bytes) was 16 bytes ago --- */
	ovs_be16                   tp_src;               /*   656     2 */
	ovs_be16                   tp_dst;               /*   658     2 */
	ovs_be16                   ct_tp_src;            /*   660     2 */
	ovs_be16                   ct_tp_dst;            /*   662     2 */
	ovs_be32                   igmp_group_ip4;       /*   664     4 */
	ovs_be32                   pad3;                 /*   668     4 */

	/* size: 672, cachelines: 11, members: 47 */
	/* last cacheline: 32 bytes */
};
struct flow_wildcards {
	struct flow                masks;                /*     0   672 */
	/* --- cacheline 10 boundary (640 bytes) was 32 bytes ago --- */

	/* size: 672, cachelines: 11, members: 1 */
	/* last cacheline: 32 bytes */
};
struct flowmap {
	map_t                      bits[2];              /*     0    16 */

	/* size: 16, cachelines: 1, members: 1 */
	/* last cacheline: 16 bytes */
};
struct miniflow {
	struct flowmap             map;                  /*     0    16 */

	/* size: 16, cachelines: 1, members: 1 */
	/* last cacheline: 16 bytes */
};
struct minimask {
	struct miniflow            masks;                /*     0    16 */

	/* size: 16, cachelines: 1, members: 1 */
	/* last cacheline: 16 bytes */
};
struct dp_packet {
	void *                     base_;                /*     0     8 */
	uint16_t                   allocated_;           /*     8     2 */
	uint16_t                   data_ofs;             /*    10     2 */
	uint32_t                   size_;                /*    12     4 */
	uint32_t                   rss_hash;             /*    16     4 */
	_Bool                      rss_hash_valid;       /*    20     1 */
	enum dp_packet_source      source;               /*    21     1 */
	uint8_t                    l2_pad_size;          /*    22     1 */

	/* XXX 1 byte hole, try to pack */

	uint16_t                   l2_5_ofs;             /*    24     2 */
	uint16_t                   l3_ofs;               /*    26     2 */
	uint16_t                   l4_ofs;               /*    28     2 */

	/* XXX 2 bytes hole, try to pack */

	uint32_t                   cutlen;               /*    32     4 */
	ovs_be32                   packet_type;          /*    36     4 */
	union {
		struct pkt_metadata md;                  /*         512 */
		uint64_t           data[8];              /*          64 */
	};                                               /*    40   512 */
	/* --- cacheline 8 boundary (512 bytes) was 40 bytes ago --- */

	/* size: 552, cachelines: 9, members: 14 */
	/* sum members: 549, holes: 2, sum holes: 3 */
	/* last cacheline: 40 bytes */
};
struct netdev_stats {
	uint64_t                   rx_packets;           /*     0     8 */
	uint64_t                   tx_packets;           /*     8     8 */
	uint64_t                   rx_bytes;             /*    16     8 */
	uint64_t                   tx_bytes;             /*    24     8 */
	uint64_t                   rx_errors;            /*    32     8 */
	uint64_t                   tx_errors;            /*    40     8 */
	uint64_t                   rx_dropped;           /*    48     8 */
	uint64_t                   tx_dropped;           /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	uint64_t                   multicast;            /*    64     8 */
	uint64_t                   collisions;           /*    72     8 */
	uint64_t                   rx_length_errors;     /*    80     8 */
	uint64_t                   rx_over_errors;       /*    88     8 */
	uint64_t                   rx_crc_errors;        /*    96     8 */
	uint64_t                   rx_frame_errors;      /*   104     8 */
	uint64_t                   rx_fifo_errors;       /*   112     8 */
	uint64_t                   rx_missed_errors;     /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	uint64_t                   tx_aborted_errors;    /*   128     8 */
	uint64_t                   tx_carrier_errors;    /*   136     8 */
	uint64_t                   tx_fifo_errors;       /*   144     8 */
	uint64_t                   tx_heartbeat_errors;  /*   152     8 */
	uint64_t                   tx_window_errors;     /*   160     8 */
	uint64_t                   rx_1_to_64_packets;   /*   168     8 */
	uint64_t                   rx_65_to_127_packets; /*   176     8 */
	uint64_t                   rx_128_to_255_packets; /*   184     8 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	uint64_t                   rx_256_to_511_packets; /*   192     8 */
	uint64_t                   rx_512_to_1023_packets; /*   200     8 */
	uint64_t                   rx_1024_to_1522_packets; /*   208     8 */
	uint64_t                   rx_1523_to_max_packets; /*   216     8 */
	uint64_t                   tx_1_to_64_packets;   /*   224     8 */
	uint64_t                   tx_65_to_127_packets; /*   232     8 */
	uint64_t                   tx_128_to_255_packets; /*   240     8 */
	uint64_t                   tx_256_to_511_packets; /*   248     8 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	uint64_t                   tx_512_to_1023_packets; /*   256     8 */
	uint64_t                   tx_1024_to_1522_packets; /*   264     8 */
	uint64_t                   tx_1523_to_max_packets; /*   272     8 */
	uint64_t                   tx_multicast_packets; /*   280     8 */
	uint64_t                   rx_broadcast_packets; /*   288     8 */
	uint64_t                   tx_broadcast_packets; /*   296     8 */
	uint64_t                   rx_undersized_errors; /*   304     8 */
	uint64_t                   rx_oversize_errors;   /*   312     8 */
	/* --- cacheline 5 boundary (320 bytes) --- */
	uint64_t                   rx_fragmented_errors; /*   320     8 */
	uint64_t                   rx_jabber_errors;     /*   328     8 */

	/* size: 336, cachelines: 6, members: 42 */
	/* last cacheline: 16 bytes */
};
struct netdev_queue_stats {
	uint64_t                   tx_bytes;             /*     0     8 */
	uint64_t                   tx_packets;           /*     8     8 */
	uint64_t                   tx_errors;            /*    16     8 */
	long long int              created;              /*    24     8 */

	/* size: 32, cachelines: 1, members: 4 */
	/* last cacheline: 32 bytes */
};
struct netdev_queue_dump {
	struct netdev *            netdev;               /*     0     8 */
	int                        error;                /*     8     4 */

	/* XXX 4 bytes hole, try to pack */

	void *                     state;                /*    16     8 */

	/* size: 24, cachelines: 1, members: 3 */
	/* sum members: 20, holes: 1, sum holes: 4 */
	/* last cacheline: 24 bytes */
};
struct match {
	struct flow                flow;                 /*     0   672 */
	/* --- cacheline 10 boundary (640 bytes) was 32 bytes ago --- */
	struct flow_wildcards      wc;                   /*   672   672 */
	/* --- cacheline 21 boundary (1344 bytes) --- */
	struct tun_metadata_allocation tun_md;           /*  1344  2056 */

	/* XXX last struct has 3 bytes of padding */

	/* --- cacheline 53 boundary (3392 bytes) was 8 bytes ago --- */

	/* size: 3400, cachelines: 54, members: 3 */
	/* paddings: 1, sum paddings: 3 */
	/* last cacheline: 8 bytes */
};
struct minimatch {
	union {
		struct {
			struct miniflow * flow;          /*     0     8 */
			struct minimask * mask;          /*     8     8 */
		};                                       /*          16 */
		struct miniflow *  flows[2];             /*          16 */
	};                                               /*     0    16 */

	/* size: 16, cachelines: 1, members: 1 */
	/* last cacheline: 16 bytes */
};
struct mf_bitmap {
	long unsigned int          bm[3];                /*     0    24 */

	/* size: 24, cachelines: 1, members: 1 */
	/* last cacheline: 24 bytes */
};
struct mf_field {
	enum mf_field_id           id;                   /*     0     1 */

	/* XXX 7 bytes hole, try to pack */

	const char  *              name;                 /*     8     8 */
	const char  *              extra_name;           /*    16     8 */
	unsigned int               n_bytes;              /*    24     4 */
	unsigned int               n_bits;               /*    28     4 */
	_Bool                      variable_len;         /*    32     1 */
	enum mf_maskable           maskable;             /*    33     1 */
	enum mf_string             string;               /*    34     1 */
	enum mf_prereqs            prereqs;              /*    35     1 */
	_Bool                      writable;             /*    36     1 */
	_Bool                      mapped;               /*    37     1 */

	/* XXX 2 bytes hole, try to pack */

	uint32_t                   usable_protocols_exact; /*    40     4 */
	uint32_t                   usable_protocols_cidr; /*    44     4 */
	uint32_t                   usable_protocols_bitwise; /*    48     4 */
	int                        flow_be32ofs;         /*    52     4 */

	/* size: 56, cachelines: 1, members: 15 */
	/* sum members: 47, holes: 2, sum holes: 9 */
	/* last cacheline: 56 bytes */
};
struct mf_subfield {
	const struct mf_field  *   field;                /*     0     8 */
	unsigned int               ofs;                  /*     8     4 */
	unsigned int               n_bits;               /*    12     4 */

	/* size: 16, cachelines: 1, members: 3 */
	/* last cacheline: 16 bytes */
};
struct field_array {
	struct mf_bitmap           used;                 /*     0    24 */
	size_t                     values_size;          /*    24     8 */
	uint8_t *                  values;               /*    32     8 */

	/* size: 40, cachelines: 1, members: 3 */
	/* last cacheline: 40 bytes */
};
struct uuid {
	uint32_t                   parts[4];             /*     0    16 */

	/* size: 16, cachelines: 1, members: 1 */
	/* last cacheline: 16 bytes */
};
struct ofpact {
	enum ofpact_type           type;                 /*     0     1 */
	uint8_t                    raw;                  /*     1     1 */
	uint16_t                   len;                  /*     2     2 */

	/* size: 4, cachelines: 1, members: 3 */
	/* last cacheline: 4 bytes */
};
struct ofputil_packet_in {
	void *                     packet;               /*     0     8 */
	size_t                     packet_len;           /*     8     8 */
	struct match               flow_metadata;        /*    16  3400 */
	/* --- cacheline 53 boundary (3392 bytes) was 24 bytes ago --- */
	enum ofp_packet_in_reason  reason;               /*  3416     4 */
	uint8_t                    table_id;             /*  3420     1 */

	/* XXX 3 bytes hole, try to pack */

	ovs_be64                   cookie;               /*  3424     8 */
	uint8_t *                  userdata;             /*  3432     8 */
	size_t                     userdata_len;         /*  3440     8 */

	/* size: 3448, cachelines: 54, members: 8 */
	/* sum members: 3445, holes: 1, sum holes: 3 */
	/* last cacheline: 56 bytes */
};
struct ofputil_packet_in_private {
	struct ofputil_packet_in   base;                 /*     0  3448 */
	/* --- cacheline 53 boundary (3392 bytes) was 56 bytes ago --- */
	struct uuid                bridge;               /*  3448    16 */
	/* --- cacheline 54 boundary (3456 bytes) was 8 bytes ago --- */
	uint8_t *                  stack;                /*  3464     8 */
	size_t                     stack_size;           /*  3472     8 */
	uint32_t                   mirrors;              /*  3480     4 */
	_Bool                      conntracked;          /*  3484     1 */

	/* XXX 3 bytes hole, try to pack */

	struct ofpact *            actions;              /*  3488     8 */
	size_t                     actions_len;          /*  3496     8 */
	struct ofpact *            action_set;           /*  3504     8 */
	size_t                     action_set_len;       /*  3512     8 */
	/* --- cacheline 55 boundary (3520 bytes) --- */

	/* size: 3520, cachelines: 55, members: 10 */
	/* sum members: 3517, holes: 1, sum holes: 3 */
};
struct ofputil_phy_port {
	ofp_port_t                 port_no;              /*     0     4 */
	struct eth_addr            hw_addr;              /*     4     6 */
	struct eth_addr64          hw_addr64;            /*    10     8 */
	char                       name[64];             /*    18    64 */

	/* XXX 2 bytes hole, try to pack */

	/* --- cacheline 1 boundary (64 bytes) was 20 bytes ago --- */
	enum ofputil_port_config   config;               /*    84     4 */
	enum ofputil_port_state    state;                /*    88     4 */
	enum netdev_features       curr;                 /*    92     4 */
	enum netdev_features       advertised;           /*    96     4 */
	enum netdev_features       supported;            /*   100     4 */
	enum netdev_features       peer;                 /*   104     4 */
	uint32_t                   curr_speed;           /*   108     4 */
	uint32_t                   max_speed;            /*   112     4 */

	/* size: 116, cachelines: 2, members: 12 */
	/* sum members: 114, holes: 1, sum holes: 2 */
	/* last cacheline: 52 bytes */
};
struct ofputil_table_action_features {
	uint64_t                   ofpacts;              /*     0     8 */
	struct mf_bitmap           set_fields;           /*     8    24 */

	/* size: 32, cachelines: 1, members: 2 */
	/* last cacheline: 32 bytes */
};
struct ofputil_table_instruction_features {
	long unsigned int          next[4];              /*     0    32 */
	uint32_t                   instructions;         /*    32     4 */

	/* XXX 4 bytes hole, try to pack */

	struct ofputil_table_action_features write;      /*    40    32 */
	/* --- cacheline 1 boundary (64 bytes) was 8 bytes ago --- */
	struct ofputil_table_action_features apply;      /*    72    32 */

	/* size: 104, cachelines: 2, members: 4 */
	/* sum members: 100, holes: 1, sum holes: 4 */
	/* last cacheline: 40 bytes */
};
struct ofputil_table_features {
	uint8_t                    table_id;             /*     0     1 */
	char                       name[32];             /*     1    32 */

	/* XXX 7 bytes hole, try to pack */

	ovs_be64                   metadata_match;       /*    40     8 */
	ovs_be64                   metadata_write;       /*    48     8 */
	uint32_t                   max_entries;          /*    56     4 */
	enum ofputil_table_miss    miss_config;          /*    60     4 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	int                        supports_eviction;    /*    64     4 */
	int                        supports_vacancy_events; /*    68     4 */
	struct ofputil_table_instruction_features nonmiss; /*    72   104 */
	/* --- cacheline 2 boundary (128 bytes) was 48 bytes ago --- */
	struct ofputil_table_instruction_features miss;  /*   176   104 */
	/* --- cacheline 4 boundary (256 bytes) was 24 bytes ago --- */
	struct mf_bitmap           match;                /*   280    24 */
	struct mf_bitmap           mask;                 /*   304    24 */
	/* --- cacheline 5 boundary (320 bytes) was 8 bytes ago --- */
	struct mf_bitmap           wildcard;             /*   328    24 */

	/* size: 352, cachelines: 6, members: 13 */
	/* sum members: 345, holes: 1, sum holes: 7 */
	/* last cacheline: 32 bytes */
};
struct ofputil_meter_band {
	uint16_t                   type;                 /*     0     2 */
	uint8_t                    prec_level;           /*     2     1 */

	/* XXX 1 byte hole, try to pack */

	uint32_t                   rate;                 /*     4     4 */
	uint32_t                   burst_size;           /*     8     4 */

	/* size: 12, cachelines: 1, members: 4 */
	/* sum members: 11, holes: 1, sum holes: 1 */
	/* last cacheline: 12 bytes */
};
struct ofputil_meter_band_stats {
	uint64_t                   packet_count;         /*     0     8 */
	uint64_t                   byte_count;           /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct ofputil_meter_config {
	uint32_t                   meter_id;             /*     0     4 */
	uint16_t                   flags;                /*     4     2 */
	uint16_t                   n_bands;              /*     6     2 */
	struct ofputil_meter_band * bands;               /*     8     8 */

	/* size: 16, cachelines: 1, members: 4 */
	/* last cacheline: 16 bytes */
};
struct ofputil_meter_stats {
	uint32_t                   meter_id;             /*     0     4 */
	uint32_t                   flow_count;           /*     4     4 */
	uint64_t                   packet_in_count;      /*     8     8 */
	uint64_t                   byte_in_count;        /*    16     8 */
	uint32_t                   duration_sec;         /*    24     4 */
	uint32_t                   duration_nsec;        /*    28     4 */
	uint16_t                   n_bands;              /*    32     2 */

	/* XXX 6 bytes hole, try to pack */

	struct ofputil_meter_band_stats * bands;         /*    40     8 */

	/* size: 48, cachelines: 1, members: 8 */
	/* sum members: 42, holes: 1, sum holes: 6 */
	/* last cacheline: 48 bytes */
};
struct ofputil_meter_features {
	uint32_t                   max_meters;           /*     0     4 */
	uint32_t                   band_types;           /*     4     4 */
	uint32_t                   capabilities;         /*     8     4 */
	uint8_t                    max_bands;            /*    12     1 */
	uint8_t                    max_color;            /*    13     1 */

	/* size: 16, cachelines: 1, members: 5 */
	/* padding: 2 */
	/* last cacheline: 16 bytes */
};
struct ofputil_table_stats {
	uint8_t                    table_id;             /*     0     1 */

	/* XXX 3 bytes hole, try to pack */

	uint32_t                   active_count;         /*     4     4 */
	uint64_t                   lookup_count;         /*     8     8 */
	uint64_t                   matched_count;        /*    16     8 */

	/* size: 24, cachelines: 1, members: 4 */
	/* sum members: 21, holes: 1, sum holes: 3 */
	/* last cacheline: 24 bytes */
};
struct bucket_counter {
	uint64_t                   packet_count;         /*     0     8 */
	uint64_t                   byte_count;           /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct ofputil_group_props {
	char                       selection_method[16]; /*     0    16 */
	uint64_t                   selection_method_param; /*    16     8 */
	struct field_array         fields;               /*    24    40 */
	/* --- cacheline 1 boundary (64 bytes) --- */

	/* size: 64, cachelines: 1, members: 3 */
};
struct ofputil_group_stats {
	uint32_t                   group_id;             /*     0     4 */
	uint32_t                   ref_count;            /*     4     4 */
	uint64_t                   packet_count;         /*     8     8 */
	uint64_t                   byte_count;           /*    16     8 */
	uint32_t                   duration_sec;         /*    24     4 */
	uint32_t                   duration_nsec;        /*    28     4 */
	uint32_t                   n_buckets;            /*    32     4 */

	/* XXX 4 bytes hole, try to pack */

	struct bucket_counter *    bucket_stats;         /*    40     8 */

	/* size: 48, cachelines: 1, members: 8 */
	/* sum members: 44, holes: 1, sum holes: 4 */
	/* last cacheline: 48 bytes */
};
struct ofputil_group_features {
	uint32_t                   types;                /*     0     4 */
	uint32_t                   capabilities;         /*     4     4 */
	uint32_t                   max_groups[4];        /*     8    16 */
	uint64_t                   ofpacts[4];           /*    24    32 */

	/* size: 56, cachelines: 1, members: 4 */
	/* last cacheline: 56 bytes */
};
struct hmapx {
	struct hmap                map;                  /*     0    32 */

	/* size: 32, cachelines: 1, members: 1 */
	/* last cacheline: 32 bytes */
};
struct lacp_settings {
	char *                     name;                 /*     0     8 */
	struct eth_addr            id;                   /*     8     6 */
	uint16_t                   priority;             /*    14     2 */
	_Bool                      active;               /*    16     1 */
	_Bool                      fast;                 /*    17     1 */
	_Bool                      fallback_ab_cfg;      /*    18     1 */

	/* size: 24, cachelines: 1, members: 6 */
	/* padding: 5 */
	/* last cacheline: 24 bytes */
};
struct lacp_slave_settings {
	char *                     name;                 /*     0     8 */
	uint16_t                   id;                   /*     8     2 */
	uint16_t                   priority;             /*    10     2 */
	uint16_t                   key;                  /*    12     2 */

	/* size: 16, cachelines: 1, members: 4 */
	/* padding: 2 */
	/* last cacheline: 16 bytes */
};
struct lacp_slave_stats {
	struct eth_addr            dot3adAggPortActorSystemID; /*     0     6 */
	struct eth_addr            dot3adAggPortPartnerOperSystemID; /*     6     6 */
	uint32_t                   dot3adAggPortAttachedAggID; /*    12     4 */
	uint8_t                    dot3adAggPortActorAdminState; /*    16     1 */
	uint8_t                    dot3adAggPortActorOperState; /*    17     1 */
	uint8_t                    dot3adAggPortPartnerAdminState; /*    18     1 */
	uint8_t                    dot3adAggPortPartnerOperState; /*    19     1 */
	uint32_t                   dot3adAggPortStatsLACPDUsRx; /*    20     4 */
	uint32_t                   dot3adAggPortStatsIllegalRx; /*    24     4 */
	uint32_t                   dot3adAggPortStatsLACPDUsTx; /*    28     4 */

	/* size: 32, cachelines: 1, members: 10 */
	/* last cacheline: 32 bytes */
};
struct heap_node {
	size_t                     idx;                  /*     0     8 */
	uint64_t                   priority;             /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct heap {
	struct heap_node * *       array;                /*     0     8 */
	size_t                     n;                    /*     8     8 */
	size_t                     allocated;            /*    16     8 */

	/* size: 24, cachelines: 1, members: 3 */
	/* last cacheline: 24 bytes */
};
struct cmap_node {
	struct {
		struct cmap_node * p;                    /*     0     8 */
	} next;                                          /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct cmap {
	struct {
		struct cmap_impl * p;                    /*     0     8 */
	} impl;                                          /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct pvector_entry {
	int                        priority;             /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	void *                     ptr;                  /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* sum members: 12, holes: 1, sum holes: 4 */
	/* last cacheline: 16 bytes */
};
struct pvector_impl {
	size_t                     size;                 /*     0     8 */
	size_t                     allocated;            /*     8     8 */
	struct pvector_entry       vector[0];            /*    16     0 */

	/* size: 16, cachelines: 1, members: 3 */
	/* last cacheline: 16 bytes */
};
struct pvector {
	struct {
		struct pvector_impl * p;                 /*     0     8 */
	} impl;                                          /*     0     8 */
	struct pvector_impl *      temp;                 /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct rculist {
	struct rculist *           prev;                 /*     0     8 */
	struct {
		struct rculist *   p;                    /*     8     8 */
	} next;                                          /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct versions {
	ovs_version_t              add_version;          /*     0     8 */
	ovs_version_t              remove_version;       /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct cls_trie {
	const struct mf_field  *   field;                /*     0     8 */
	rcu_trie_ptr               root;                 /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct classifier {
	int                        n_rules;              /*     0     4 */
	uint8_t                    n_flow_segments;      /*     4     1 */
	uint8_t                    flow_segments[3];     /*     5     3 */
	struct cmap                subtables_map;        /*     8     8 */
	struct pvector             subtables;            /*    16    16 */
	struct cmap                partitions;           /*    32     8 */
	struct cls_trie            tries[3];             /*    40    48 */
	/* --- cacheline 1 boundary (64 bytes) was 24 bytes ago --- */
	unsigned int               n_tries;              /*    88     4 */
	_Bool                      publish;              /*    92     1 */

	/* size: 96, cachelines: 2, members: 9 */
	/* padding: 3 */
	/* last cacheline: 32 bytes */
};
struct cls_rule {
	struct rculist             node;                 /*     0    16 */
	intconst                   priority;             /*    16     4 */

	/* XXX 4 bytes hole, try to pack */

	struct {
		struct cls_match * p;                    /*    24     8 */
	} cls_match;                                     /*    24     8 */
	struct minimatchconst      match;                /*    32    16 */

	/* size: 48, cachelines: 1, members: 4 */
	/* sum members: 44, holes: 1, sum holes: 4 */
	/* last cacheline: 48 bytes */
};
struct hindex_node {
	size_t                     hash;                 /*     0     8 */
	struct hindex_node *       d;                    /*     8     8 */
	struct hindex_node *       s;                    /*    16     8 */

	/* size: 24, cachelines: 1, members: 3 */
	/* last cacheline: 24 bytes */
};
struct hindex {
	struct hindex_node * *     buckets;              /*     0     8 */
	struct hindex_node *       one;                  /*     8     8 */
	size_t                     mask;                 /*    16     8 */
	size_t                     n_unique;             /*    24     8 */

	/* size: 32, cachelines: 1, members: 4 */
	/* last cacheline: 32 bytes */
};
struct object_collection {
	void * *                   objs;                 /*     0     8 */
	size_t                     n;                    /*     8     8 */
	size_t                     capacity;             /*    16     8 */
	void *                     stub[5];              /*    24    40 */
	/* --- cacheline 1 boundary (64 bytes) --- */

	/* size: 64, cachelines: 1, members: 4 */
};
struct sset_node {
	struct hmap_node           hmap_node;            /*     0    16 */
	char                       name[1];              /*    16     1 */

	/* size: 24, cachelines: 1, members: 2 */
	/* padding: 7 */
	/* last cacheline: 24 bytes */
};
struct sset {
	struct hmap                map;                  /*     0    32 */

	/* size: 32, cachelines: 1, members: 1 */
	/* last cacheline: 32 bytes */
};
struct netflow_options {
	struct sset                collectors;           /*     0    32 */
	uint8_t                    engine_type;          /*    32     1 */
	uint8_t                    engine_id;            /*    33     1 */

	/* XXX 2 bytes hole, try to pack */

	int                        active_timeout;       /*    36     4 */
	_Bool                      add_id_to_iface;      /*    40     1 */

	/* size: 48, cachelines: 1, members: 5 */
	/* sum members: 39, holes: 1, sum holes: 2 */
	/* padding: 7 */
	/* last cacheline: 48 bytes */
};
struct smap_node {
	struct hmap_node           node;                 /*     0    16 */
	char *                     key;                  /*    16     8 */
	char *                     value;                /*    24     8 */

	/* size: 32, cachelines: 1, members: 3 */
	/* last cacheline: 32 bytes */
};
struct ofproto_controller_info {
	_Bool                      is_connected;         /*     0     1 */

	/* XXX 3 bytes hole, try to pack */

	enum ofp12_controller_role role;                 /*     4     4 */
	struct smap                pairs;                /*     8    32 */

	/* size: 40, cachelines: 1, members: 3 */
	/* sum members: 37, holes: 1, sum holes: 3 */
	/* last cacheline: 40 bytes */
};
struct ofproto_sflow_options {
	struct sset                targets;              /*     0    32 */
	uint32_t                   sampling_rate;        /*    32     4 */
	uint32_t                   polling_interval;     /*    36     4 */
	uint32_t                   header_len;           /*    40     4 */
	uint32_t                   sub_id;               /*    44     4 */
	char *                     agent_device;         /*    48     8 */
	char *                     control_ip;           /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */

	/* size: 64, cachelines: 1, members: 7 */
};
struct ofproto_ipfix_bridge_exporter_options {
	struct sset                targets;              /*     0    32 */
	uint32_t                   sampling_rate;        /*    32     4 */
	uint32_t                   obs_domain_id;        /*    36     4 */
	uint32_t                   obs_point_id;         /*    40     4 */
	uint32_t                   cache_active_timeout; /*    44     4 */
	uint32_t                   cache_max_flows;      /*    48     4 */
	_Bool                      enable_tunnel_sampling; /*    52     1 */
	_Bool                      enable_input_sampling; /*    53     1 */
	_Bool                      enable_output_sampling; /*    54     1 */

	/* XXX 1 byte hole, try to pack */

	char *                     virtual_obs_id;       /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */

	/* size: 64, cachelines: 1, members: 10 */
	/* sum members: 63, holes: 1, sum holes: 1 */
};
struct ofproto_ipfix_flow_exporter_options {
	uint32_t                   collector_set_id;     /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	struct sset                targets;              /*     8    32 */
	uint32_t                   cache_active_timeout; /*    40     4 */
	uint32_t                   cache_max_flows;      /*    44     4 */
	_Bool                      enable_tunnel_sampling; /*    48     1 */

	/* XXX 7 bytes hole, try to pack */

	char *                     virtual_obs_id;       /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */

	/* size: 64, cachelines: 1, members: 6 */
	/* sum members: 53, holes: 2, sum holes: 11 */
};
struct ofproto_rstp_status {
	_Bool                      enabled;              /*     0     1 */

	/* XXX 7 bytes hole, try to pack */

	rstp_identifier            root_id;              /*     8     8 */
	rstp_identifier            bridge_id;            /*    16     8 */
	rstp_identifier            designated_id;        /*    24     8 */
	uint32_t                   root_path_cost;       /*    32     4 */
	uint16_t                   designated_port_id;   /*    36     2 */
	uint16_t                   bridge_port_id;       /*    38     2 */

	/* size: 40, cachelines: 1, members: 7 */
	/* sum members: 33, holes: 1, sum holes: 7 */
	/* last cacheline: 40 bytes */
};
struct ofproto_rstp_settings {
	rstp_identifier            address;              /*     0     8 */
	uint16_t                   priority;             /*     8     2 */

	/* XXX 2 bytes hole, try to pack */

	uint32_t                   ageing_time;          /*    12     4 */
	enum rstp_force_protocol_version force_protocol_version; /*    16     4 */
	uint16_t                   bridge_forward_delay; /*    20     2 */
	uint16_t                   bridge_max_age;       /*    22     2 */
	uint16_t                   transmit_hold_count;  /*    24     2 */

	/* size: 32, cachelines: 1, members: 7 */
	/* sum members: 24, holes: 1, sum holes: 2 */
	/* padding: 6 */
	/* last cacheline: 32 bytes */
};
struct ofproto_port_rstp_status {
	_Bool                      enabled;              /*     0     1 */

	/* XXX 1 byte hole, try to pack */

	uint16_t                   port_id;              /*     2     2 */
	enum rstp_port_role        role;                 /*     4     4 */
	enum rstp_state            state;                /*     8     4 */

	/* XXX 4 bytes hole, try to pack */

	rstp_identifier            designated_bridge_id; /*    16     8 */
	uint16_t                   designated_port_id;   /*    24     2 */

	/* XXX 2 bytes hole, try to pack */

	uint32_t                   designated_path_cost; /*    28     4 */
	int                        tx_count;             /*    32     4 */
	int                        rx_count;             /*    36     4 */
	int                        error_count;          /*    40     4 */
	int                        uptime;               /*    44     4 */

	/* size: 48, cachelines: 1, members: 11 */
	/* sum members: 41, holes: 3, sum holes: 7 */
	/* last cacheline: 48 bytes */
};
struct ofproto_port_rstp_settings {
	_Bool                      enable;               /*     0     1 */

	/* XXX 1 byte hole, try to pack */

	uint16_t                   port_num;             /*     2     2 */
	uint8_t                    priority;             /*     4     1 */

	/* XXX 3 bytes hole, try to pack */

	uint32_t                   path_cost;            /*     8     4 */
	_Bool                      admin_edge_port;      /*    12     1 */
	_Bool                      auto_edge;            /*    13     1 */
	_Bool                      mcheck;               /*    14     1 */
	uint8_t                    admin_p2p_mac_state;  /*    15     1 */
	_Bool                      admin_port_state;     /*    16     1 */

	/* size: 20, cachelines: 1, members: 9 */
	/* sum members: 13, holes: 2, sum holes: 4 */
	/* padding: 3 */
	/* last cacheline: 20 bytes */
};
struct ofproto_stp_settings {
	stp_identifier             system_id;            /*     0     8 */
	uint16_t                   priority;             /*     8     2 */
	uint16_t                   hello_time;           /*    10     2 */
	uint16_t                   max_age;              /*    12     2 */
	uint16_t                   fwd_delay;            /*    14     2 */

	/* size: 16, cachelines: 1, members: 5 */
	/* last cacheline: 16 bytes */
};
struct ofproto_stp_status {
	_Bool                      enabled;              /*     0     1 */

	/* XXX 7 bytes hole, try to pack */

	stp_identifier             bridge_id;            /*     8     8 */
	stp_identifier             designated_root;      /*    16     8 */
	int                        root_path_cost;       /*    24     4 */

	/* size: 32, cachelines: 1, members: 4 */
	/* sum members: 21, holes: 1, sum holes: 7 */
	/* padding: 4 */
	/* last cacheline: 32 bytes */
};
struct ofproto_port_stp_settings {
	_Bool                      enable;               /*     0     1 */
	uint8_t                    port_num;             /*     1     1 */
	uint8_t                    priority;             /*     2     1 */

	/* XXX 1 byte hole, try to pack */

	uint16_t                   path_cost;            /*     4     2 */

	/* size: 6, cachelines: 1, members: 4 */
	/* sum members: 5, holes: 1, sum holes: 1 */
	/* last cacheline: 6 bytes */
};
struct ofproto_port_stp_status {
	_Bool                      enabled;              /*     0     1 */

	/* XXX 3 bytes hole, try to pack */

	int                        port_id;              /*     4     4 */
	enum stp_state             state;                /*     8     4 */
	unsigned int               sec_in_state;         /*    12     4 */
	enum stp_role              role;                 /*    16     4 */

	/* size: 20, cachelines: 1, members: 5 */
	/* sum members: 17, holes: 1, sum holes: 3 */
	/* last cacheline: 20 bytes */
};
struct ofproto_port_stp_stats {
	_Bool                      enabled;              /*     0     1 */

	/* XXX 3 bytes hole, try to pack */

	int                        tx_count;             /*     4     4 */
	int                        rx_count;             /*     8     4 */
	int                        error_count;          /*    12     4 */

	/* size: 16, cachelines: 1, members: 4 */
	/* sum members: 13, holes: 1, sum holes: 3 */
	/* last cacheline: 16 bytes */
};
struct ofproto_port_queue {
	uint32_t                   queue;                /*     0     4 */
	uint8_t                    dscp;                 /*     4     1 */

	/* size: 8, cachelines: 1, members: 2 */
	/* padding: 3 */
	/* last cacheline: 8 bytes */
};
struct ofproto_mcast_snooping_settings {
	_Bool                      flood_unreg;          /*     0     1 */

	/* XXX 3 bytes hole, try to pack */

	unsigned int               idle_time;            /*     4     4 */
	unsigned int               max_entries;          /*     8     4 */

	/* size: 12, cachelines: 1, members: 3 */
	/* sum members: 9, holes: 1, sum holes: 3 */
	/* last cacheline: 12 bytes */
};
struct ofproto_mcast_snooping_port_settings {
	_Bool                      flood;                /*     0     1 */
	_Bool                      flood_reports;        /*     1     1 */

	/* size: 2, cachelines: 1, members: 2 */
	/* last cacheline: 2 bytes */
};
struct ofproto_controller {
	char *                     target;               /*     0     8 */
	int                        max_backoff;          /*     8     4 */
	int                        probe_interval;       /*    12     4 */
	enum ofproto_band          band;                 /*    16     4 */
	_Bool                      enable_async_msgs;    /*    20     1 */

	/* XXX 3 bytes hole, try to pack */

	int                        rate_limit;           /*    24     4 */
	int                        burst_limit;          /*    28     4 */
	uint8_t                    dscp;                 /*    32     1 */

	/* size: 40, cachelines: 1, members: 8 */
	/* sum members: 30, holes: 1, sum holes: 3 */
	/* padding: 7 */
	/* last cacheline: 40 bytes */
};
struct iface_hint {
	char *                     br_name;              /*     0     8 */
	char *                     br_type;              /*     8     8 */
	ofp_port_t                 ofp_port;             /*    16     4 */

	/* size: 24, cachelines: 1, members: 3 */
	/* padding: 4 */
	/* last cacheline: 24 bytes */
};
struct ofproto_port {
	char *                     name;                 /*     0     8 */
	char *                     type;                 /*     8     8 */
	ofp_port_t                 ofp_port;             /*    16     4 */

	/* size: 24, cachelines: 1, members: 3 */
	/* padding: 4 */
	/* last cacheline: 24 bytes */
};
struct ofproto_port_dump {
	const struct ofproto  *    ofproto;              /*     0     8 */
	int                        error;                /*     8     4 */

	/* XXX 4 bytes hole, try to pack */

	void *                     state;                /*    16     8 */

	/* size: 24, cachelines: 1, members: 3 */
	/* sum members: 20, holes: 1, sum holes: 4 */
	/* last cacheline: 24 bytes */
};
struct ofproto {
	struct hmap_node           hmap_node;            /*     0    16 */
	const struct ofproto_class  * ofproto_class;     /*    16     8 */
	char *                     type;                 /*    24     8 */
	char *                     name;                 /*    32     8 */
	uint64_t                   fallback_dpid;        /*    40     8 */
	uint64_t                   datapath_id;          /*    48     8 */
	_Bool                      forward_bpdu;         /*    56     1 */

	/* XXX 7 bytes hole, try to pack */

	/* --- cacheline 1 boundary (64 bytes) --- */
	char *                     mfr_desc;             /*    64     8 */
	char *                     hw_desc;              /*    72     8 */
	char *                     sw_desc;              /*    80     8 */
	char *                     serial_desc;          /*    88     8 */
	char *                     dp_desc;              /*    96     8 */
	enum ofputil_frag_handling frag_handling;        /*   104     4 */

	/* XXX 4 bytes hole, try to pack */

	struct hmap                ports;                /*   112    32 */
	/* --- cacheline 2 boundary (128 bytes) was 16 bytes ago --- */
	struct shash               port_by_name;         /*   144    32 */
	struct simap               ofp_requests;         /*   176    32 */
	/* --- cacheline 3 boundary (192 bytes) was 16 bytes ago --- */
	uint16_t                   alloc_port_no;        /*   208     2 */
	uint16_t                   max_ports;            /*   210     2 */

	/* XXX 4 bytes hole, try to pack */

	struct hmap                ofport_usage;         /*   216    32 */
	uint64_t                   change_seq;           /*   248     8 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	long long int              eviction_group_timer; /*   256     8 */
	struct oftable *           tables;               /*   264     8 */
	int                        n_tables;             /*   272     4 */

	/* XXX 4 bytes hole, try to pack */

	ovs_version_t              tables_version;       /*   280     8 */
	struct hindex              cookies;              /*   288    32 */
	/* --- cacheline 5 boundary (320 bytes) --- */
	struct hmap                learned_cookies;      /*   320    32 */
	struct ovs_list            expirable;            /*   352    16 */
	struct ofputil_meter_features meter_features;    /*   368    16 */

	/* XXX last struct has 2 bytes of padding */

	/* --- cacheline 6 boundary (384 bytes) --- */
	struct hmap                meters;               /*   384    32 */
	uint32_t                   slowpath_meter_id;    /*   416     4 */
	uint32_t                   controller_meter_id;  /*   420     4 */
	struct connmgr *           connmgr;              /*   424     8 */
	int                        min_mtu;              /*   432     4 */

	/* XXX 4 bytes hole, try to pack */

	struct cmap                groups;               /*   440     8 */
	/* --- cacheline 7 boundary (448 bytes) --- */
	uint32_t                   n_groups[4];          /*   448    16 */
	struct ofputil_group_features ogf;               /*   464    56 */
	/* --- cacheline 8 boundary (512 bytes) was 8 bytes ago --- */
	struct {
		struct tun_table * p;                    /*   520     8 */
	} metadata_tab;                                  /*   520     8 */
	struct vl_mff_map          vl_mff_map;           /*   528    56 */
	/* --- cacheline 9 boundary (576 bytes) was 8 bytes ago --- */

	/* size: 584, cachelines: 10, members: 38 */
	/* sum members: 561, holes: 5, sum holes: 23 */
	/* paddings: 1, sum paddings: 2 */
	/* last cacheline: 8 bytes */
};
struct ofproto_bundle_settings {
	char *                     name;                 /*     0     8 */
	ofp_port_t *               slaves;               /*     8     8 */
	size_t                     n_slaves;             /*    16     8 */
	enum port_vlan_mode        vlan_mode;            /*    24     4 */
	uint16_t                   qinq_ethtype;         /*    28     2 */

	/* XXX 2 bytes hole, try to pack */

	int                        vlan;                 /*    32     4 */

	/* XXX 4 bytes hole, try to pack */

	long unsigned int *        trunks;               /*    40     8 */
	long unsigned int *        cvlans;               /*    48     8 */
	_Bool                      use_priority_tags;    /*    56     1 */

	/* XXX 7 bytes hole, try to pack */

	/* --- cacheline 1 boundary (64 bytes) --- */
	struct bond_settings *     bond;                 /*    64     8 */
	struct lacp_settings *     lacp;                 /*    72     8 */
	struct lacp_slave_settings * lacp_slaves;        /*    80     8 */
	_Bool                      protected;            /*    88     1 */

	/* size: 96, cachelines: 2, members: 13 */
	/* sum members: 76, holes: 3, sum holes: 13 */
	/* padding: 7 */
	/* last cacheline: 32 bytes */
};
struct bond_settings {
	char *                     name;                 /*     0     8 */
	uint32_t                   basis;                /*     8     4 */
	enum bond_mode             balance;              /*    12     4 */
	int                        rebalance_interval;   /*    16     4 */
	int                        up_delay;             /*    20     4 */
	int                        down_delay;           /*    24     4 */
	_Bool                      lacp_fallback_ab_cfg; /*    28     1 */

	/* XXX 1 byte hole, try to pack */

	struct eth_addr            active_slave_mac;     /*    30     6 */

	/* size: 40, cachelines: 1, members: 8 */
	/* sum members: 35, holes: 1, sum holes: 1 */
	/* padding: 4 */
	/* last cacheline: 40 bytes */
};
struct ofproto_mirror_settings {
	char *                     name;                 /*     0     8 */
	void * *                   srcs;                 /*     8     8 */
	size_t                     n_srcs;               /*    16     8 */
	void * *                   dsts;                 /*    24     8 */
	size_t                     n_dsts;               /*    32     8 */
	long unsigned int *        src_vlans;            /*    40     8 */
	void *                     out_bundle;           /*    48     8 */
	uint16_t                   out_vlan;             /*    56     2 */
	uint16_t                   snaplen;              /*    58     2 */

	/* size: 64, cachelines: 1, members: 9 */
	/* padding: 4 */
};
struct ofproto_table_settings {
	char *                     name;                 /*     0     8 */
	unsigned int               max_flows;            /*     8     4 */
	_Bool                      enable_eviction;      /*    12     1 */

	/* XXX 3 bytes hole, try to pack */

	struct mf_subfield *       groups;               /*    16     8 */
	size_t                     n_groups;             /*    24     8 */
	unsigned int               n_prefix_fields;      /*    32     4 */
	enum mf_field_id           prefix_fields[3];     /*    36     3 */

	/* size: 40, cachelines: 1, members: 7 */
	/* sum members: 36, holes: 1, sum holes: 3 */
	/* padding: 1 */
	/* last cacheline: 40 bytes */
};
struct shash_node {
	struct hmap_node           node;                 /*     0    16 */
	char *                     name;                 /*    16     8 */
	void *                     data;                 /*    24     8 */

	/* size: 32, cachelines: 1, members: 3 */
	/* last cacheline: 32 bytes */
};
struct simap {
	struct hmap                map;                  /*     0    32 */

	/* size: 32, cachelines: 1, members: 1 */
	/* last cacheline: 32 bytes */
};
struct vl_mff_map {
	struct cmap                cmap;                 /*     0     8 */
	struct ovs_mutex           mutex;                /*     8    48 */

	/* size: 56, cachelines: 1, members: 2 */
	/* last cacheline: 56 bytes */
};
struct ofproto_class {
	void                       (*init)(const struct shash  *); /*     0     8 */
	void                       (*enumerate_types)(struct sset *); /*     8     8 */
	int                        (*enumerate_names)(const char  *, struct sset *); /*    16     8 */
	int                        (*del)(const char  *, const char  *); /*    24     8 */
	const char  *              (*port_open_type)(const char  *, const char  *); /*    32     8 */
	int                        (*type_run)(const char  *); /*    40     8 */
	void                       (*type_wait)(const char  *); /*    48     8 */
	struct ofproto *           (*alloc)(void);       /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	int                        (*construct)(struct ofproto *); /*    64     8 */
	void                       (*destruct)(struct ofproto *, _Bool); /*    72     8 */
	void                       (*dealloc)(struct ofproto *); /*    80     8 */
	int                        (*run)(struct ofproto *); /*    88     8 */
	void                       (*wait)(struct ofproto *); /*    96     8 */
	void                       (*get_memory_usage)(const struct ofproto  *, struct simap *); /*   104     8 */
	void                       (*type_get_memory_usage)(const char  *, struct simap *); /*   112     8 */
	void                       (*flush)(struct ofproto *); /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	void                       (*query_tables)(struct ofproto *, struct ofputil_table_features *, struct ofputil_table_stats *); /*   128     8 */
	void                       (*set_tables_version)(struct ofproto *, ovs_version_t); /*   136     8 */
	struct ofport *            (*port_alloc)(void);  /*   144     8 */
	int                        (*port_construct)(struct ofport *); /*   152     8 */
	void                       (*port_destruct)(struct ofport *, _Bool); /*   160     8 */
	void                       (*port_dealloc)(struct ofport *); /*   168     8 */
	void                       (*port_modified)(struct ofport *); /*   176     8 */
	void                       (*port_reconfigured)(struct ofport *, enum ofputil_port_config); /*   184     8 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	int                        (*port_query_by_name)(const struct ofproto  *, const char  *, struct ofproto_port *); /*   192     8 */
	int                        (*port_add)(struct ofproto *, struct netdev *); /*   200     8 */
	int                        (*port_del)(struct ofproto *, ofp_port_t); /*   208     8 */
	int                        (*port_set_config)(const struct ofport  *, const struct smap  *); /*   216     8 */
	int                        (*port_get_stats)(const struct ofport  *, struct netdev_stats *); /*   224     8 */
	int                        (*port_dump_start)(const struct ofproto  *, void * *); /*   232     8 */
	int                        (*port_dump_next)(const struct ofproto  *, void *, struct ofproto_port *); /*   240     8 */
	int                        (*port_dump_done)(const struct ofproto  *, void *); /*   248     8 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	int                        (*port_poll)(const struct ofproto  *, char * *); /*   256     8 */
	void                       (*port_poll_wait)(const struct ofproto  *); /*   264     8 */
	int                        (*port_is_lacp_current)(const struct ofport  *); /*   272     8 */
	int                        (*port_get_lacp_stats)(const struct ofport  *, struct lacp_slave_stats *); /*   280     8 */
	enum ofperr                (*rule_choose_table)(const struct ofproto  *, const struct match  *, uint8_t *); /*   288     8 */
	struct rule *              (*rule_alloc)(void);  /*   296     8 */
	enum ofperr                (*rule_construct)(struct rule *); /*   304     8 */
	void                       (*rule_insert)(struct rule *, struct rule *, _Bool); /*   312     8 */
	/* --- cacheline 5 boundary (320 bytes) --- */
	void                       (*rule_delete)(struct rule *); /*   320     8 */
	void                       (*rule_destruct)(struct rule *); /*   328     8 */
	void                       (*rule_dealloc)(struct rule *); /*   336     8 */
	void                       (*rule_get_stats)(struct rule *, uint64_t *, uint64_t *, long long int *); /*   344     8 */
	enum ofperr                (*packet_xlate)(struct ofproto *, struct ofproto_packet_out *); /*   352     8 */
	void                       (*packet_xlate_revert)(struct ofproto *, struct ofproto_packet_out *); /*   360     8 */
	void                       (*packet_execute)(struct ofproto *, struct ofproto_packet_out *); /*   368     8 */
	_Bool                      (*set_frag_handling)(struct ofproto *, enum ofputil_frag_handling); /*   376     8 */
	/* --- cacheline 6 boundary (384 bytes) --- */
	enum ofperr                (*nxt_resume)(struct ofproto *, const struct ofputil_packet_in_private  *); /*   384     8 */
	int                        (*set_netflow)(struct ofproto *, const struct netflow_options  *); /*   392     8 */
	void                       (*get_netflow_ids)(const struct ofproto  *, uint8_t *, uint8_t *); /*   400     8 */
	int                        (*set_sflow)(struct ofproto *, const struct ofproto_sflow_options  *); /*   408     8 */
	int                        (*set_ipfix)(struct ofproto *, const struct ofproto_ipfix_bridge_exporter_options  *, const struct ofproto_ipfix_flow_exporter_options  *, size_t); /*   416     8 */
	int                        (*get_ipfix_stats)(const struct ofproto  *, _Bool, struct ovs_list *); /*   424     8 */
	int                        (*set_cfm)(struct ofport *, const struct cfm_settings  *); /*   432     8 */
	_Bool                      (*cfm_status_changed)(struct ofport *); /*   440     8 */
	/* --- cacheline 7 boundary (448 bytes) --- */
	int                        (*get_cfm_status)(const struct ofport  *, struct cfm_status *); /*   448     8 */
	int                        (*set_lldp)(struct ofport *, const struct smap  *); /*   456     8 */
	_Bool                      (*get_lldp_status)(const struct ofport  *, struct lldp_status *); /*   464     8 */
	int                        (*set_aa)(struct ofproto *, const struct aa_settings  *); /*   472     8 */
	int                        (*aa_mapping_set)(struct ofproto *, void *, const struct aa_mapping_settings  *); /*   480     8 */
	int                        (*aa_mapping_unset)(struct ofproto *, void *); /*   488     8 */
	int                        (*aa_vlan_get_queued)(struct ofproto *, struct ovs_list *); /*   496     8 */
	unsigned int               (*aa_vlan_get_queue_size)(struct ofproto *); /*   504     8 */
	/* --- cacheline 8 boundary (512 bytes) --- */
	int                        (*set_bfd)(struct ofport *, const struct smap  *); /*   512     8 */
	_Bool                      (*bfd_status_changed)(struct ofport *); /*   520     8 */
	int                        (*get_bfd_status)(struct ofport *, struct smap *); /*   528     8 */
	int                        (*set_stp)(struct ofproto *, const struct ofproto_stp_settings  *); /*   536     8 */
	int                        (*get_stp_status)(struct ofproto *, struct ofproto_stp_status *); /*   544     8 */
	int                        (*set_stp_port)(struct ofport *, const struct ofproto_port_stp_settings  *); /*   552     8 */
	int                        (*get_stp_port_status)(struct ofport *, struct ofproto_port_stp_status *); /*   560     8 */
	int                        (*get_stp_port_stats)(struct ofport *, struct ofproto_port_stp_stats *); /*   568     8 */
	/* --- cacheline 9 boundary (576 bytes) --- */
	void                       (*set_rstp)(struct ofproto *, const struct ofproto_rstp_settings  *); /*   576     8 */
	void                       (*get_rstp_status)(struct ofproto *, struct ofproto_rstp_status *); /*   584     8 */
	void                       (*set_rstp_port)(struct ofport *, const struct ofproto_port_rstp_settings  *); /*   592     8 */
	void                       (*get_rstp_port_status)(struct ofport *, struct ofproto_port_rstp_status *); /*   600     8 */
	int                        (*set_queues)(struct ofport *, const struct ofproto_port_queue  *, size_t); /*   608     8 */
	int                        (*bundle_set)(struct ofproto *, void *, const struct ofproto_bundle_settings  *); /*   616     8 */
	void                       (*bundle_remove)(struct ofport *); /*   624     8 */
	int                        (*mirror_set)(struct ofproto *, void *, const struct ofproto_mirror_settings  *); /*   632     8 */
	/* --- cacheline 10 boundary (640 bytes) --- */
	int                        (*mirror_get_stats)(struct ofproto *, void *, uint64_t *, uint64_t *); /*   640     8 */
	int                        (*set_flood_vlans)(struct ofproto *, long unsigned int *); /*   648     8 */
	_Bool                      (*is_mirror_output_bundle)(const struct ofproto  *, void *); /*   656     8 */
	void                       (*forward_bpdu_changed)(struct ofproto *); /*   664     8 */
	void                       (*set_mac_table_config)(struct ofproto *, unsigned int, size_t); /*   672     8 */
	int                        (*set_mcast_snooping)(struct ofproto *, const struct ofproto_mcast_snooping_settings  *); /*   680     8 */
	int                        (*set_mcast_snooping_port)(struct ofproto *, void *, const struct ofproto_mcast_snooping_port_settings  *); /*   688     8 */
	void                       (*meter_get_features)(const struct ofproto  *, struct ofputil_meter_features *); /*   696     8 */
	/* --- cacheline 11 boundary (704 bytes) --- */
	enum ofperr                (*meter_set)(struct ofproto *, ofproto_meter_id *, struct ofputil_meter_config *); /*   704     8 */
	enum ofperr                (*meter_get)(const struct ofproto  *, ofproto_meter_id, struct ofputil_meter_stats *, uint16_t); /*   712     8 */
	void                       (*meter_del)(struct ofproto *, ofproto_meter_id); /*   720     8 */
	struct ofgroup *           (*group_alloc)(void); /*   728     8 */
	enum ofperr                (*group_construct)(struct ofgroup *); /*   736     8 */
	void                       (*group_destruct)(struct ofgroup *); /*   744     8 */
	void                       (*group_dealloc)(struct ofgroup *); /*   752     8 */
	void                       (*group_modify)(struct ofgroup *); /*   760     8 */
	/* --- cacheline 12 boundary (768 bytes) --- */
	enum ofperr                (*group_get_stats)(const struct ofgroup  *, struct ofputil_group_stats *); /*   768     8 */
	const char  *              (*get_datapath_version)(const struct ofproto  *); /*   776     8 */
	void                       (*type_set_config)(const char  *, const struct smap  *); /*   784     8 */
	void                       (*ct_flush)(const struct ofproto  *, const uint16_t  *); /*   792     8 */

	/* size: 800, cachelines: 13, members: 100 */
	/* last cacheline: 32 bytes */
};
struct oftable {
	enum oftable_flags         flags;                /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	struct classifier          cls;                  /*     8    96 */

	/* XXX last struct has 3 bytes of padding */

	/* --- cacheline 1 boundary (64 bytes) was 40 bytes ago --- */
	char *                     name;                 /*   104     8 */
	unsigned int               max_flows;            /*   112     4 */
	unsigned int               n_flows;              /*   116     4 */
	struct mf_subfield *       eviction_fields;      /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	size_t                     n_eviction_fields;    /*   128     8 */
	uint32_t                   eviction_group_id_basis; /*   136     4 */

	/* XXX 4 bytes hole, try to pack */

	struct hmap                eviction_groups_by_id; /*   144    32 */
	struct heap                eviction_groups_by_size; /*   176    24 */
	/* --- cacheline 3 boundary (192 bytes) was 8 bytes ago --- */
	enum ofputil_table_miss    miss_config;          /*   200     4 */
	unsigned int               eviction;             /*   204     4 */
	enum ofp14_table_reason    vacancy_event;        /*   208     4 */
	uint8_t                    vacancy_down;         /*   212     1 */
	uint8_t                    vacancy_up;           /*   213     1 */

	/* XXX 2 bytes hole, try to pack */

	atomic_ulong               n_matched;            /*   216     8 */
	atomic_ulong               n_missed;             /*   224     8 */

	/* size: 232, cachelines: 4, members: 17 */
	/* sum members: 222, holes: 3, sum holes: 10 */
	/* paddings: 1, sum paddings: 3 */
	/* last cacheline: 40 bytes */
};
struct ofport {
	struct hmap_node           hmap_node;            /*     0    16 */
	struct ofproto *           ofproto;              /*    16     8 */
	struct netdev *            netdev;               /*    24     8 */
	struct ofputil_phy_port    pp;                   /*    32   116 */
	/* --- cacheline 2 boundary (128 bytes) was 20 bytes ago --- */
	ofp_port_t                 ofp_port;             /*   148     4 */
	uint64_t                   change_seq;           /*   152     8 */
	long long int              created;              /*   160     8 */
	int                        mtu;                  /*   168     4 */

	/* size: 176, cachelines: 3, members: 8 */
	/* padding: 4 */
	/* last cacheline: 48 bytes */
};
struct rule {
	struct ofproto *const      ofproto;              /*     0     8 */
	struct cls_ruleconst       cr;                   /*     8    48 */
	uint8_tconst               table_id;             /*    56     1 */
	enum rule_state            state;                /*    57     1 */

	/* XXX 6 bytes hole, try to pack */

	/* --- cacheline 1 boundary (64 bytes) --- */
	struct ovs_mutex           mutex;                /*    64    48 */
	struct ovs_refcount        ref_count;            /*   112     4 */

	/* XXX 4 bytes hole, try to pack */

	ovs_be64const              flow_cookie;          /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	struct hindex_node         cookie_node;          /*   128    24 */
	enum ofputil_flow_mod_flags flags;               /*   152     4 */
	uint16_t                   hard_timeout;         /*   156     2 */
	uint16_t                   idle_timeout;         /*   158     2 */
	uint16_tconst              importance;           /*   160     2 */
	uint8_t                    removed_reason;       /*   162     1 */

	/* XXX 5 bytes hole, try to pack */

	struct eviction_group *    eviction_group;       /*   168     8 */
	struct heap_node           evg_node;             /*   176    16 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	const struct rule_actions  *const actions;       /*   192     8 */
	struct ovs_list            meter_list_node;      /*   200    16 */
	enum nx_flow_monitor_flags monitor_flags;        /*   216     4 */

	/* XXX 4 bytes hole, try to pack */

	uint64_t                   add_seqno;            /*   224     8 */
	uint64_t                   modify_seqno;         /*   232     8 */
	struct ovs_list            expirable;            /*   240    16 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	long long int              created;              /*   256     8 */
	long long int              modified;             /*   264     8 */
	uint64_t                   match_tlv_bitmap;     /*   272     8 */
	uint64_t                   ofpacts_tlv_bitmap;   /*   280     8 */

	/* size: 288, cachelines: 5, members: 25 */
	/* sum members: 269, holes: 4, sum holes: 19 */
	/* last cacheline: 32 bytes */
};
struct rule_actions {
	_Bool                      has_meter;            /*     0     1 */
	_Bool                      has_learn_with_delete; /*     1     1 */
	_Bool                      has_groups;           /*     2     1 */

	/* XXX 1 byte hole, try to pack */

	uint32_t                   ofpacts_len;          /*     4     4 */
	struct ofpact              ofpacts[0];           /*     8     0 */

	/* size: 8, cachelines: 1, members: 5 */
	/* sum members: 7, holes: 1, sum holes: 1 */
	/* last cacheline: 8 bytes */
};
struct rule_collection {
	struct object_collection   collection;           /*     0    64 */
	/* --- cacheline 1 boundary (64 bytes) --- */

	/* size: 64, cachelines: 1, members: 1 */
};
struct ofgroup {
	struct cmap_node           cmap_node;            /*     0     8 */
	struct versions            versions;             /*     8    16 */
	struct ovs_refcount        ref_count;            /*    24     4 */

	/* XXX 4 bytes hole, try to pack */

	struct ofproto *const      ofproto;              /*    32     8 */
	uint32_tconst              group_id;             /*    40     4 */
	enum ofp11_group_typeconst type;                 /*    44     4 */
	_Bool                      being_deleted;        /*    48     1 */

	/* XXX 7 bytes hole, try to pack */

	long long intconst         created;              /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	long long intconst         modified;             /*    64     8 */
	struct ovs_listconst       buckets;              /*    72    16 */
	uint32_tconst              n_buckets;            /*    88     4 */

	/* XXX 4 bytes hole, try to pack */

	struct ofputil_group_propsconst props;           /*    96    64 */
	/* --- cacheline 2 boundary (128 bytes) was 32 bytes ago --- */
	struct rule_collection     rules;                /*   160    64 */
	/* --- cacheline 3 boundary (192 bytes) was 32 bytes ago --- */

	/* size: 224, cachelines: 4, members: 13 */
	/* sum members: 209, holes: 3, sum holes: 15 */
	/* last cacheline: 32 bytes */
};
struct ofproto_packet_out {
	ovs_version_t              version;              /*     0     8 */
	struct dp_packet *         packet;               /*     8     8 */
	struct flow *              flow;                 /*    16     8 */
	struct ofpact *            ofpacts;              /*    24     8 */
	size_t                     ofpacts_len;          /*    32     8 */
	void *                     aux;                  /*    40     8 */

	/* size: 48, cachelines: 1, members: 6 */
	/* last cacheline: 48 bytes */
};
struct aa_settings {
	char *                     system_description;   /*     0     8 */
	char *                     system_name;          /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct aa_mapping_settings {
	uint32_t                   isid;                 /*     0     4 */
	uint16_t                   vlan;                 /*     4     2 */

	/* size: 8, cachelines: 1, members: 2 */
	/* padding: 2 */
	/* last cacheline: 8 bytes */
};
struct token_bucket {
	unsigned int               rate;                 /*     0     4 */
	unsigned int               burst;                /*     4     4 */
	unsigned int               tokens;               /*     8     4 */

	/* XXX 4 bytes hole, try to pack */

	long long int              last_fill;            /*    16     8 */

	/* size: 24, cachelines: 1, members: 4 */
	/* sum members: 20, holes: 1, sum holes: 4 */
	/* last cacheline: 24 bytes */
};
struct vlog_rate_limit {
	struct token_bucket        token_bucket;         /*     0    24 */
	time_t                     first_dropped;        /*    24     8 */
	time_t                     last_dropped;         /*    32     8 */
	unsigned int               n_dropped;            /*    40     4 */

	/* XXX 4 bytes hole, try to pack */

	struct ovs_mutex           mutex;                /*    48    48 */
	/* --- cacheline 1 boundary (64 bytes) was 32 bytes ago --- */

	/* size: 96, cachelines: 2, members: 5 */
	/* sum members: 92, holes: 1, sum holes: 4 */
	/* last cacheline: 32 bytes */
};
struct iface {
	struct ovs_list            port_elem;            /*     0    16 */
	struct hmap_node           name_node;            /*    16    16 */
	struct hmap_node           ofp_port_node;        /*    32    16 */
	struct port *              port;                 /*    48     8 */
	char *                     name;                 /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	struct netdev *            netdev;               /*    64     8 */
	ofp_port_t                 ofp_port;             /*    72     4 */

	/* XXX 4 bytes hole, try to pack */

	uint64_t                   change_seq;           /*    80     8 */
	const char  *              type;                 /*    88     8 */
	const char  *              netdev_type;          /*    96     8 */
	const struct ovsrec_interface  * cfg;            /*   104     8 */

	/* size: 112, cachelines: 2, members: 11 */
	/* sum members: 108, holes: 1, sum holes: 4 */
	/* last cacheline: 48 bytes */
};
struct bridge_aa_vlan {
	struct ovs_list            list_node;            /*     0    16 */
	char *                     port_name;            /*    16     8 */
	uint16_t                   vlan;                 /*    24     2 */

	/* XXX 2 bytes hole, try to pack */

	enum bridge_aa_vlan_oper   oper;                 /*    28     4 */

	/* size: 32, cachelines: 1, members: 4 */
	/* sum members: 30, holes: 1, sum holes: 2 */
	/* last cacheline: 32 bytes */
};
struct ovsdb_integer_constraints {
	int64_t                    min;                  /*     0     8 */
	int64_t                    max;                  /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct ovsdb_real_constraints {
	double                     min;                  /*     0     8 */
	double                     max;                  /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct ovsdb_string_constraints {
	unsigned int               minLen;               /*     0     4 */
	unsigned int               maxLen;               /*     4     4 */

	/* size: 8, cachelines: 1, members: 2 */
	/* last cacheline: 8 bytes */
};
struct ovsdb_uuid_constraints {
	char *                     refTableName;         /*     0     8 */
	struct ovsdb_table *       refTable;             /*     8     8 */
	enum ovsdb_ref_type        refType;              /*    16     4 */

	/* size: 24, cachelines: 1, members: 3 */
	/* padding: 4 */
	/* last cacheline: 24 bytes */
};
struct ovsdb_base_type {
	enum ovsdb_atomic_type     type;                 /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	struct ovsdb_datum *       enum_;                /*     8     8 */
	union {
		struct ovsdb_integer_constraints integer; /*          16 */
		struct ovsdb_real_constraints real;      /*          16 */
		struct ovsdb_string_constraints string;  /*           8 */
		struct ovsdb_uuid_constraints uuid;      /*          24 */
	} u;                                             /*    16    24 */

	/* size: 40, cachelines: 1, members: 3 */
	/* sum members: 36, holes: 1, sum holes: 4 */
	/* last cacheline: 40 bytes */
};
struct ovsdb_datum {
	unsigned int               n;                    /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	union ovsdb_atom *         keys;                 /*     8     8 */
	union ovsdb_atom *         values;               /*    16     8 */

	/* size: 24, cachelines: 1, members: 3 */
	/* sum members: 20, holes: 1, sum holes: 4 */
	/* last cacheline: 24 bytes */
};
struct ovsdb_type {
	struct ovsdb_base_type     key;                  /*     0    40 */
	struct ovsdb_base_type     value;                /*    40    40 */
	/* --- cacheline 1 boundary (64 bytes) was 16 bytes ago --- */
	unsigned int               n_min;                /*    80     4 */
	unsigned int               n_max;                /*    84     4 */

	/* size: 88, cachelines: 2, members: 4 */
	/* last cacheline: 24 bytes */
};
struct ovsdb_idl_condition {
	struct hmap                clauses;              /*     0    32 */
	_Bool                      is_true;              /*    32     1 */

	/* size: 40, cachelines: 1, members: 2 */
	/* padding: 7 */
	/* last cacheline: 40 bytes */
};
struct ovsdb_idl_row {
	struct hmap_node           hmap_node;            /*     0    16 */
	struct uuid                uuid;                 /*    16    16 */
	struct ovs_list            src_arcs;             /*    32    16 */
	struct ovs_list            dst_arcs;             /*    48    16 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	struct ovsdb_idl_table *   table;                /*    64     8 */
	struct ovsdb_datum *       old_datum;            /*    72     8 */
	struct ovsdb_datum *       new_datum;            /*    80     8 */
	long unsigned int *        prereqs;              /*    88     8 */
	long unsigned int *        written;              /*    96     8 */
	struct hmap_node           txn_node;             /*   104    16 */
	long unsigned int *        map_op_written;       /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	struct map_op_list * *     map_op_lists;         /*   128     8 */
	long unsigned int *        set_op_written;       /*   136     8 */
	struct set_op_list * *     set_op_lists;         /*   144     8 */
	unsigned int               change_seqno[3];      /*   152    12 */

	/* XXX 4 bytes hole, try to pack */

	struct ovs_list            track_node;           /*   168    16 */
	long unsigned int *        updated;              /*   184     8 */
	/* --- cacheline 3 boundary (192 bytes) --- */

	/* size: 192, cachelines: 3, members: 17 */
	/* sum members: 188, holes: 1, sum holes: 4 */
};
struct ovsdb_idl_table {
	const struct ovsdb_idl_table_class  * class_;    /*     0     8 */
	unsigned char *            modes;                /*     8     8 */
	_Bool                      need_table;           /*    16     1 */

	/* XXX 7 bytes hole, try to pack */

	struct shash               columns;              /*    24    32 */
	struct hmap                rows;                 /*    56    32 */
	/* --- cacheline 1 boundary (64 bytes) was 24 bytes ago --- */
	struct ovsdb_idl *         idl;                  /*    88     8 */
	unsigned int               change_seqno[3];      /*    96    12 */

	/* XXX 4 bytes hole, try to pack */

	struct shash               indexes;              /*   112    32 */
	/* --- cacheline 2 boundary (128 bytes) was 16 bytes ago --- */
	struct ovs_list            track_list;           /*   144    16 */
	struct ovsdb_idl_condition condition;            /*   160    40 */

	/* XXX last struct has 7 bytes of padding */

	/* --- cacheline 3 boundary (192 bytes) was 8 bytes ago --- */
	_Bool                      cond_changed;         /*   200     1 */

	/* size: 208, cachelines: 4, members: 11 */
	/* sum members: 190, holes: 2, sum holes: 11 */
	/* padding: 7 */
	/* paddings: 1, sum paddings: 7 */
	/* last cacheline: 16 bytes */
};
struct ovsdb_idl_column {
	char *                     name;                 /*     0     8 */
	struct ovsdb_type          type;                 /*     8    88 */
	/* --- cacheline 1 boundary (64 bytes) was 32 bytes ago --- */
	_Bool                      is_mutable;           /*    96     1 */

	/* XXX 7 bytes hole, try to pack */

	void                       (*parse)(struct ovsdb_idl_row *, const struct ovsdb_datum  *); /*   104     8 */
	void                       (*unparse)(struct ovsdb_idl_row *); /*   112     8 */

	/* size: 120, cachelines: 2, members: 5 */
	/* sum members: 113, holes: 1, sum holes: 7 */
	/* last cacheline: 56 bytes */
};
struct ovsdb_idl_table_class {
	char *                     name;                 /*     0     8 */
	_Bool                      is_root;              /*     8     1 */
	_Bool                      is_singleton;         /*     9     1 */

	/* XXX 6 bytes hole, try to pack */

	const struct ovsdb_idl_column  * columns;        /*    16     8 */
	size_t                     n_columns;            /*    24     8 */
	size_t                     allocation_size;      /*    32     8 */
	void                       (*row_init)(struct ovsdb_idl_row *); /*    40     8 */

	/* size: 48, cachelines: 1, members: 7 */
	/* sum members: 42, holes: 1, sum holes: 6 */
	/* last cacheline: 48 bytes */
};
struct ovsdb_idl_class {
	const char  *              database;             /*     0     8 */
	const struct ovsdb_idl_table_class  * tables;    /*     8     8 */
	size_t                     n_tables;             /*    16     8 */

	/* size: 24, cachelines: 1, members: 3 */
	/* last cacheline: 24 bytes */
};
struct ovsrec_autoattach {
	struct ovsdb_idl_row       header_;              /*     0   192 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	int64_t *                  key_mappings;         /*   192     8 */
	int64_t *                  value_mappings;       /*   200     8 */
	size_t                     n_mappings;           /*   208     8 */
	char *                     system_description;   /*   216     8 */
	char *                     system_name;          /*   224     8 */

	/* size: 232, cachelines: 4, members: 6 */
	/* last cacheline: 40 bytes */
};
struct ovsrec_bridge {
	struct ovsdb_idl_row       header_;              /*     0   192 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	struct ovsrec_autoattach * auto_attach;          /*   192     8 */
	struct ovsrec_controller * * controller;         /*   200     8 */
	size_t                     n_controller;         /*   208     8 */
	char *                     datapath_id;          /*   216     8 */
	char *                     datapath_type;        /*   224     8 */
	char *                     datapath_version;     /*   232     8 */
	struct smap                external_ids;         /*   240    32 */
	/* --- cacheline 4 boundary (256 bytes) was 16 bytes ago --- */
	char *                     fail_mode;            /*   272     8 */
	int64_t *                  flood_vlans;          /*   280     8 */
	size_t                     n_flood_vlans;        /*   288     8 */
	int64_t *                  key_flow_tables;      /*   296     8 */
	struct ovsrec_flow_table * * value_flow_tables;  /*   304     8 */
	size_t                     n_flow_tables;        /*   312     8 */
	/* --- cacheline 5 boundary (320 bytes) --- */
	struct ovsrec_ipfix *      ipfix;                /*   320     8 */
	_Bool                      mcast_snooping_enable; /*   328     1 */

	/* XXX 7 bytes hole, try to pack */

	struct ovsrec_mirror * *   mirrors;              /*   336     8 */
	size_t                     n_mirrors;            /*   344     8 */
	char *                     name;                 /*   352     8 */
	struct ovsrec_netflow *    netflow;              /*   360     8 */
	struct smap                other_config;         /*   368    32 */
	/* --- cacheline 6 boundary (384 bytes) was 16 bytes ago --- */
	struct ovsrec_port * *     ports;                /*   400     8 */
	size_t                     n_ports;              /*   408     8 */
	char * *                   protocols;            /*   416     8 */
	size_t                     n_protocols;          /*   424     8 */
	_Bool                      rstp_enable;          /*   432     1 */

	/* XXX 7 bytes hole, try to pack */

	struct smap                rstp_status;          /*   440    32 */
	/* --- cacheline 7 boundary (448 bytes) was 24 bytes ago --- */
	struct ovsrec_sflow *      sflow;                /*   472     8 */
	struct smap                status;               /*   480    32 */
	/* --- cacheline 8 boundary (512 bytes) --- */
	_Bool                      stp_enable;           /*   512     1 */

	/* size: 520, cachelines: 9, members: 30 */
	/* sum members: 499, holes: 2, sum holes: 14 */
	/* padding: 7 */
	/* last cacheline: 8 bytes */
};
struct ovsrec_controller {
	struct ovsdb_idl_row       header_;              /*     0   192 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	char *                     connection_mode;      /*   192     8 */
	int64_t *                  controller_burst_limit; /*   200     8 */
	size_t                     n_controller_burst_limit; /*   208     8 */
	int64_t *                  controller_rate_limit; /*   216     8 */
	size_t                     n_controller_rate_limit; /*   224     8 */
	_Bool *                    enable_async_messages; /*   232     8 */
	size_t                     n_enable_async_messages; /*   240     8 */
	struct smap                external_ids;         /*   248    32 */
	/* --- cacheline 4 boundary (256 bytes) was 24 bytes ago --- */
	int64_t *                  inactivity_probe;     /*   280     8 */
	size_t                     n_inactivity_probe;   /*   288     8 */
	_Bool                      is_connected;         /*   296     1 */

	/* XXX 7 bytes hole, try to pack */

	char *                     local_gateway;        /*   304     8 */
	char *                     local_ip;             /*   312     8 */
	/* --- cacheline 5 boundary (320 bytes) --- */
	char *                     local_netmask;        /*   320     8 */
	int64_t *                  max_backoff;          /*   328     8 */
	size_t                     n_max_backoff;        /*   336     8 */
	struct smap                other_config;         /*   344    32 */
	char *                     role;                 /*   376     8 */
	/* --- cacheline 6 boundary (384 bytes) --- */
	struct smap                status;               /*   384    32 */
	char *                     target;               /*   416     8 */

	/* size: 424, cachelines: 7, members: 21 */
	/* sum members: 417, holes: 1, sum holes: 7 */
	/* last cacheline: 40 bytes */
};
struct ovsrec_flow_table {
	struct ovsdb_idl_row       header_;              /*     0   192 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	struct smap                external_ids;         /*   192    32 */
	int64_t *                  flow_limit;           /*   224     8 */
	size_t                     n_flow_limit;         /*   232     8 */
	char * *                   groups;               /*   240     8 */
	size_t                     n_groups;             /*   248     8 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	char *                     name;                 /*   256     8 */
	char *                     overflow_policy;      /*   264     8 */
	char * *                   prefixes;             /*   272     8 */
	size_t                     n_prefixes;           /*   280     8 */

	/* size: 288, cachelines: 5, members: 10 */
	/* last cacheline: 32 bytes */
};
struct ovsrec_ipfix {
	struct ovsdb_idl_row       header_;              /*     0   192 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	int64_t *                  cache_active_timeout; /*   192     8 */
	size_t                     n_cache_active_timeout; /*   200     8 */
	int64_t *                  cache_max_flows;      /*   208     8 */
	size_t                     n_cache_max_flows;    /*   216     8 */
	struct smap                external_ids;         /*   224    32 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	int64_t *                  obs_domain_id;        /*   256     8 */
	size_t                     n_obs_domain_id;      /*   264     8 */
	int64_t *                  obs_point_id;         /*   272     8 */
	size_t                     n_obs_point_id;       /*   280     8 */
	struct smap                other_config;         /*   288    32 */
	/* --- cacheline 5 boundary (320 bytes) --- */
	int64_t *                  sampling;             /*   320     8 */
	size_t                     n_sampling;           /*   328     8 */
	char * *                   targets;              /*   336     8 */
	size_t                     n_targets;            /*   344     8 */

	/* size: 352, cachelines: 6, members: 15 */
	/* last cacheline: 32 bytes */
};
struct ovsrec_mirror {
	struct ovsdb_idl_row       header_;              /*     0   192 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	struct smap                external_ids;         /*   192    32 */
	char *                     name;                 /*   224     8 */
	struct ovsrec_port *       output_port;          /*   232     8 */
	int64_t *                  output_vlan;          /*   240     8 */
	size_t                     n_output_vlan;        /*   248     8 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	_Bool                      select_all;           /*   256     1 */

	/* XXX 7 bytes hole, try to pack */

	struct ovsrec_port * *     select_dst_port;      /*   264     8 */
	size_t                     n_select_dst_port;    /*   272     8 */
	struct ovsrec_port * *     select_src_port;      /*   280     8 */
	size_t                     n_select_src_port;    /*   288     8 */
	int64_t *                  select_vlan;          /*   296     8 */
	size_t                     n_select_vlan;        /*   304     8 */
	int64_t *                  snaplen;              /*   312     8 */
	/* --- cacheline 5 boundary (320 bytes) --- */
	size_t                     n_snaplen;            /*   320     8 */
	char * *                   key_statistics;       /*   328     8 */
	int64_t *                  value_statistics;     /*   336     8 */
	size_t                     n_statistics;         /*   344     8 */

	/* size: 352, cachelines: 6, members: 18 */
	/* sum members: 345, holes: 1, sum holes: 7 */
	/* last cacheline: 32 bytes */
};
struct ovsrec_netflow {
	struct ovsdb_idl_row       header_;              /*     0   192 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	int64_t                    active_timeout;       /*   192     8 */
	_Bool                      add_id_to_interface;  /*   200     1 */

	/* XXX 7 bytes hole, try to pack */

	int64_t *                  engine_id;            /*   208     8 */
	size_t                     n_engine_id;          /*   216     8 */
	int64_t *                  engine_type;          /*   224     8 */
	size_t                     n_engine_type;        /*   232     8 */
	struct smap                external_ids;         /*   240    32 */
	/* --- cacheline 4 boundary (256 bytes) was 16 bytes ago --- */
	char * *                   targets;              /*   272     8 */
	size_t                     n_targets;            /*   280     8 */

	/* size: 288, cachelines: 5, members: 10 */
	/* sum members: 281, holes: 1, sum holes: 7 */
	/* last cacheline: 32 bytes */
};
struct ovsrec_port {
	struct ovsdb_idl_row       header_;              /*     0   192 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	char *                     bond_active_slave;    /*   192     8 */
	int64_t                    bond_downdelay;       /*   200     8 */
	_Bool                      bond_fake_iface;      /*   208     1 */

	/* XXX 7 bytes hole, try to pack */

	char *                     bond_mode;            /*   216     8 */
	int64_t                    bond_updelay;         /*   224     8 */
	int64_t *                  cvlans;               /*   232     8 */
	size_t                     n_cvlans;             /*   240     8 */
	struct smap                external_ids;         /*   248    32 */
	/* --- cacheline 4 boundary (256 bytes) was 24 bytes ago --- */
	_Bool                      fake_bridge;          /*   280     1 */

	/* XXX 7 bytes hole, try to pack */

	struct ovsrec_interface * * interfaces;          /*   288     8 */
	size_t                     n_interfaces;         /*   296     8 */
	char *                     lacp;                 /*   304     8 */
	char *                     mac;                  /*   312     8 */
	/* --- cacheline 5 boundary (320 bytes) --- */
	char *                     name;                 /*   320     8 */
	struct smap                other_config;         /*   328    32 */
	_Bool                      protected_;           /*   360     1 */

	/* XXX 7 bytes hole, try to pack */

	struct ovsrec_qos *        qos;                  /*   368     8 */
	char * *                   key_rstp_statistics;  /*   376     8 */
	/* --- cacheline 6 boundary (384 bytes) --- */
	int64_t *                  value_rstp_statistics; /*   384     8 */
	size_t                     n_rstp_statistics;    /*   392     8 */
	struct smap                rstp_status;          /*   400    32 */
	char * *                   key_statistics;       /*   432     8 */
	int64_t *                  value_statistics;     /*   440     8 */
	/* --- cacheline 7 boundary (448 bytes) --- */
	size_t                     n_statistics;         /*   448     8 */
	struct smap                status;               /*   456    32 */
	int64_t *                  tag;                  /*   488     8 */
	size_t                     n_tag;                /*   496     8 */
	int64_t *                  trunks;               /*   504     8 */
	/* --- cacheline 8 boundary (512 bytes) --- */
	size_t                     n_trunks;             /*   512     8 */
	char *                     vlan_mode;            /*   520     8 */

	/* size: 528, cachelines: 9, members: 31 */
	/* sum members: 507, holes: 3, sum holes: 21 */
	/* last cacheline: 16 bytes */
};
struct ovsrec_sflow {
	struct ovsdb_idl_row       header_;              /*     0   192 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	char *                     agent;                /*   192     8 */
	struct smap                external_ids;         /*   200    32 */
	int64_t *                  header;               /*   232     8 */
	size_t                     n_header;             /*   240     8 */
	int64_t *                  polling;              /*   248     8 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	size_t                     n_polling;            /*   256     8 */
	int64_t *                  sampling;             /*   264     8 */
	size_t                     n_sampling;           /*   272     8 */
	char * *                   targets;              /*   280     8 */
	size_t                     n_targets;            /*   288     8 */

	/* size: 296, cachelines: 5, members: 11 */
	/* last cacheline: 40 bytes */
};
struct ovsrec_flow_sample_collector_set {
	struct ovsdb_idl_row       header_;              /*     0   192 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	struct ovsrec_bridge *     bridge;               /*   192     8 */
	struct smap                external_ids;         /*   200    32 */
	int64_t                    id;                   /*   232     8 */
	struct ovsrec_ipfix *      ipfix;                /*   240     8 */

	/* size: 248, cachelines: 4, members: 5 */
	/* last cacheline: 56 bytes */
};
struct ovsrec_interface {
	struct ovsdb_idl_row       header_;              /*     0   192 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	char *                     admin_state;          /*   192     8 */
	struct smap                bfd;                  /*   200    32 */
	struct smap                bfd_status;           /*   232    32 */
	/* --- cacheline 4 boundary (256 bytes) was 8 bytes ago --- */
	_Bool *                    cfm_fault;            /*   264     8 */
	size_t                     n_cfm_fault;          /*   272     8 */
	char * *                   cfm_fault_status;     /*   280     8 */
	size_t                     n_cfm_fault_status;   /*   288     8 */
	int64_t *                  cfm_flap_count;       /*   296     8 */
	size_t                     n_cfm_flap_count;     /*   304     8 */
	int64_t *                  cfm_health;           /*   312     8 */
	/* --- cacheline 5 boundary (320 bytes) --- */
	size_t                     n_cfm_health;         /*   320     8 */
	int64_t *                  cfm_mpid;             /*   328     8 */
	size_t                     n_cfm_mpid;           /*   336     8 */
	int64_t *                  cfm_remote_mpids;     /*   344     8 */
	size_t                     n_cfm_remote_mpids;   /*   352     8 */
	char *                     cfm_remote_opstate;   /*   360     8 */
	char *                     duplex;               /*   368     8 */
	char *                     error;                /*   376     8 */
	/* --- cacheline 6 boundary (384 bytes) --- */
	struct smap                external_ids;         /*   384    32 */
	int64_t *                  ifindex;              /*   416     8 */
	size_t                     n_ifindex;            /*   424     8 */
	int64_t                    ingress_policing_burst; /*   432     8 */
	int64_t                    ingress_policing_rate; /*   440     8 */
	/* --- cacheline 7 boundary (448 bytes) --- */
	_Bool *                    lacp_current;         /*   448     8 */
	size_t                     n_lacp_current;       /*   456     8 */
	int64_t *                  link_resets;          /*   464     8 */
	size_t                     n_link_resets;        /*   472     8 */
	int64_t *                  link_speed;           /*   480     8 */
	size_t                     n_link_speed;         /*   488     8 */
	char *                     link_state;           /*   496     8 */
	struct smap                lldp;                 /*   504    32 */
	/* --- cacheline 8 boundary (512 bytes) was 24 bytes ago --- */
	char *                     mac;                  /*   536     8 */
	char *                     mac_in_use;           /*   544     8 */
	int64_t *                  mtu;                  /*   552     8 */
	size_t                     n_mtu;                /*   560     8 */
	int64_t *                  mtu_request;          /*   568     8 */
	/* --- cacheline 9 boundary (576 bytes) --- */
	size_t                     n_mtu_request;        /*   576     8 */
	char *                     name;                 /*   584     8 */
	int64_t *                  ofport;               /*   592     8 */
	size_t                     n_ofport;             /*   600     8 */
	int64_t *                  ofport_request;       /*   608     8 */
	size_t                     n_ofport_request;     /*   616     8 */
	struct smap                options;              /*   624    32 */
	/* --- cacheline 10 boundary (640 bytes) was 16 bytes ago --- */
	struct smap                other_config;         /*   656    32 */
	char * *                   key_statistics;       /*   688     8 */
	int64_t *                  value_statistics;     /*   696     8 */
	/* --- cacheline 11 boundary (704 bytes) --- */
	size_t                     n_statistics;         /*   704     8 */
	struct smap                status;               /*   712    32 */
	char *                     type;                 /*   744     8 */

	/* size: 752, cachelines: 12, members: 50 */
	/* last cacheline: 48 bytes */
};
struct ovsrec_manager {
	struct ovsdb_idl_row       header_;              /*     0   192 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	char *                     connection_mode;      /*   192     8 */
	struct smap                external_ids;         /*   200    32 */
	int64_t *                  inactivity_probe;     /*   232     8 */
	size_t                     n_inactivity_probe;   /*   240     8 */
	_Bool                      is_connected;         /*   248     1 */

	/* XXX 7 bytes hole, try to pack */

	/* --- cacheline 4 boundary (256 bytes) --- */
	int64_t *                  max_backoff;          /*   256     8 */
	size_t                     n_max_backoff;        /*   264     8 */
	struct smap                other_config;         /*   272    32 */
	struct smap                status;               /*   304    32 */
	/* --- cacheline 5 boundary (320 bytes) was 16 bytes ago --- */
	char *                     target;               /*   336     8 */

	/* size: 344, cachelines: 6, members: 11 */
	/* sum members: 337, holes: 1, sum holes: 7 */
	/* last cacheline: 24 bytes */
};
struct ovsrec_open_vswitch {
	struct ovsdb_idl_row       header_;              /*     0   192 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	struct ovsrec_bridge * *   bridges;              /*   192     8 */
	size_t                     n_bridges;            /*   200     8 */
	int64_t                    cur_cfg;              /*   208     8 */
	char * *                   datapath_types;       /*   216     8 */
	size_t                     n_datapath_types;     /*   224     8 */
	char *                     db_version;           /*   232     8 */
	struct smap                external_ids;         /*   240    32 */
	/* --- cacheline 4 boundary (256 bytes) was 16 bytes ago --- */
	char * *                   iface_types;          /*   272     8 */
	size_t                     n_iface_types;        /*   280     8 */
	struct ovsrec_manager * *  manager_options;      /*   288     8 */
	size_t                     n_manager_options;    /*   296     8 */
	int64_t                    next_cfg;             /*   304     8 */
	struct smap                other_config;         /*   312    32 */
	/* --- cacheline 5 boundary (320 bytes) was 24 bytes ago --- */
	char *                     ovs_version;          /*   344     8 */
	struct ovsrec_ssl *        ssl;                  /*   352     8 */
	struct smap                statistics;           /*   360    32 */
	/* --- cacheline 6 boundary (384 bytes) was 8 bytes ago --- */
	char *                     system_type;          /*   392     8 */
	char *                     system_version;       /*   400     8 */

	/* size: 408, cachelines: 7, members: 19 */
	/* last cacheline: 24 bytes */
};
struct ovsrec_ssl {
	struct ovsdb_idl_row       header_;              /*     0   192 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	_Bool                      bootstrap_ca_cert;    /*   192     1 */

	/* XXX 7 bytes hole, try to pack */

	char *                     ca_cert;              /*   200     8 */
	char *                     certificate;          /*   208     8 */
	struct smap                external_ids;         /*   216    32 */
	char *                     private_key;          /*   248     8 */
	/* --- cacheline 4 boundary (256 bytes) --- */

	/* size: 256, cachelines: 4, members: 6 */
	/* sum members: 249, holes: 1, sum holes: 7 */
};
struct ovsrec_qos {
	struct ovsdb_idl_row       header_;              /*     0   192 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	struct smap                external_ids;         /*   192    32 */
	struct smap                other_config;         /*   224    32 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	int64_t *                  key_queues;           /*   256     8 */
	struct ovsrec_queue * *    value_queues;         /*   264     8 */
	size_t                     n_queues;             /*   272     8 */
	char *                     type;                 /*   280     8 */

	/* size: 288, cachelines: 5, members: 7 */
	/* last cacheline: 32 bytes */
};
struct ovsrec_queue {
	struct ovsdb_idl_row       header_;              /*     0   192 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	int64_t *                  dscp;                 /*   192     8 */
	size_t                     n_dscp;               /*   200     8 */
	struct smap                external_ids;         /*   208    32 */
	struct smap                other_config;         /*   240    32 */
	/* --- cacheline 4 boundary (256 bytes) was 16 bytes ago --- */

	/* size: 272, cachelines: 5, members: 5 */
	/* last cacheline: 16 bytes */
};
struct port {
	struct hmap_node           hmap_node;            /*     0    16 */
	struct bridge *            bridge;               /*    16     8 */
	char *                     name;                 /*    24     8 */
	const struct ovsrec_port  * cfg;                 /*    32     8 */
	struct ovs_list            ifaces;               /*    40    16 */

	/* size: 56, cachelines: 1, members: 5 */
	/* last cacheline: 56 bytes */
};
struct mirror {
	struct uuid                uuid;                 /*     0    16 */
	struct hmap_node           hmap_node;            /*    16    16 */
	struct bridge *            bridge;               /*    32     8 */
	char *                     name;                 /*    40     8 */
	const struct ovsrec_mirror  * cfg;               /*    48     8 */

	/* size: 56, cachelines: 1, members: 5 */
	/* last cacheline: 56 bytes */
};
struct bridge {
	struct hmap_node           node;                 /*     0    16 */
	char *                     name;                 /*    16     8 */
	char *                     type;                 /*    24     8 */
	struct eth_addr            ea;                   /*    32     6 */
	struct eth_addr            default_ea;           /*    38     6 */

	/* XXX 4 bytes hole, try to pack */

	const struct ovsrec_bridge  * cfg;               /*    48     8 */
	struct ofproto *           ofproto;              /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	struct hmap                ports;                /*    64    32 */
	struct hmap                ifaces;               /*    96    32 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	struct hmap                iface_by_name;        /*   128    32 */
	struct hmap                mirrors;              /*   160    32 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	struct hmap                mappings;             /*   192    32 */
	struct shash               wanted_ports;         /*   224    32 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	struct ovsrec_port         synth_local_port;     /*   256   528 */
	/* --- cacheline 12 boundary (768 bytes) was 16 bytes ago --- */
	struct ovsrec_interface    synth_local_iface;    /*   784   752 */
	/* --- cacheline 24 boundary (1536 bytes) --- */
	struct ovsrec_interface *  synth_local_ifacep;   /*  1536     8 */

	/* size: 1544, cachelines: 25, members: 16 */
	/* sum members: 1540, holes: 1, sum holes: 4 */
	/* last cacheline: 8 bytes */
};
struct aa_mapping {
	struct hmap_node           hmap_node;            /*     0    16 */
	struct bridge *            bridge;               /*    16     8 */
	uint32_t                   isid;                 /*    24     4 */
	uint16_t                   vlan;                 /*    28     2 */

	/* XXX 2 bytes hole, try to pack */

	char *                     br_name;              /*    32     8 */

	/* size: 40, cachelines: 1, members: 5 */
	/* sum members: 38, holes: 1, sum holes: 2 */
	/* last cacheline: 40 bytes */
};
struct __pthread_internal_list {
	struct __pthread_internal_list * __prev;         /*     0     8 */
	struct __pthread_internal_list * __next;         /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct __pthread_mutex_s {
	int                        __lock;               /*     0     4 */
	unsigned int               __count;              /*     4     4 */
	int                        __owner;              /*     8     4 */
	unsigned int               __nusers;             /*    12     4 */
	int                        __kind;               /*    16     4 */
	short int                  __spins;              /*    20     2 */
	short int                  __elision;            /*    22     2 */
	__pthread_list_t           __list;               /*    24    16 */

	/* size: 40, cachelines: 1, members: 8 */
	/* last cacheline: 40 bytes */
};
struct in6_addr {
	union {
		uint8_t            __u6_addr8[16];       /*          16 */
		uint16_t           __u6_addr16[8];       /*          16 */
		uint32_t           __u6_addr32[4];       /*          16 */
	} __in6_u;                                       /*     0    16 */

	/* size: 16, cachelines: 1, members: 1 */
	/* last cacheline: 16 bytes */
};
struct _IO_FILE {
	int                        _flags;               /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	char *                     _IO_read_ptr;         /*     8     8 */
	char *                     _IO_read_end;         /*    16     8 */
	char *                     _IO_read_base;        /*    24     8 */
	char *                     _IO_write_base;       /*    32     8 */
	char *                     _IO_write_ptr;        /*    40     8 */
	char *                     _IO_write_end;        /*    48     8 */
	char *                     _IO_buf_base;         /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	char *                     _IO_buf_end;          /*    64     8 */
	char *                     _IO_save_base;        /*    72     8 */
	char *                     _IO_backup_base;      /*    80     8 */
	char *                     _IO_save_end;         /*    88     8 */
	struct _IO_marker *        _markers;             /*    96     8 */
	struct _IO_FILE *          _chain;               /*   104     8 */
	int                        _fileno;              /*   112     4 */
	int                        _flags2;              /*   116     4 */
	__off_t                    _old_offset;          /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	short unsigned int         _cur_column;          /*   128     2 */
	signed char                _vtable_offset;       /*   130     1 */
	char                       _shortbuf[1];         /*   131     1 */

	/* XXX 4 bytes hole, try to pack */

	_IO_lock_t *               _lock;                /*   136     8 */
	__off64_t                  _offset;              /*   144     8 */
	void *                     __pad1;               /*   152     8 */
	void *                     __pad2;               /*   160     8 */
	void *                     __pad3;               /*   168     8 */
	void *                     __pad4;               /*   176     8 */
	size_t                     __pad5;               /*   184     8 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	int                        _mode;                /*   192     4 */
	char                       _unused2[20];         /*   196    20 */

	/* size: 216, cachelines: 4, members: 29 */
	/* sum members: 208, holes: 2, sum holes: 8 */
	/* last cacheline: 24 bytes */
};
struct _IO_marker {
	struct _IO_marker *        _next;                /*     0     8 */
	struct _IO_FILE *          _sbuf;                /*     8     8 */
	int                        _pos;                 /*    16     4 */

	/* size: 24, cachelines: 1, members: 3 */
	/* padding: 4 */
	/* last cacheline: 24 bytes */
};
struct eth_addr {
	union {
		uint8_t            ea[6];                /*           6 */
		ovs_be16           be16[3];              /*           6 */
	};                                               /*     0     6 */

	/* size: 6, cachelines: 1, members: 1 */
	/* last cacheline: 6 bytes */
};
struct eth_addr64 {
	union {
		uint8_t            ea64[8];              /*           8 */
		ovs_be16           be16[4];              /*           8 */
	};                                               /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct ovs_refcount {
	unsigned int               count;                /*     0     4 */

	/* size: 4, cachelines: 1, members: 1 */
	/* last cacheline: 4 bytes */
};
struct cmap_node {
	struct {
		struct cmap_node * p;                    /*     0     8 */
	} next;                                          /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct cmap {
	struct {
		struct cmap_impl * p;                    /*     0     8 */
	} impl;                                          /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct ofp_header {
	uint8_t                    version;              /*     0     1 */
	uint8_t                    type;                 /*     1     1 */
	ovs_be16                   length;               /*     2     2 */
	ovs_be32                   xid;                  /*     4     4 */

	/* size: 8, cachelines: 1, members: 4 */
	/* last cacheline: 8 bytes */
};
struct geneve_opt {
	ovs_be16                   opt_class;            /*     0     2 */
	uint8_t                    type;                 /*     2     1 */
	uint8_t                    length:5;             /*     3: 3  1 */
	uint8_t                    r3:1;                 /*     3: 2  1 */
	uint8_t                    r2:1;                 /*     3: 1  1 */
	uint8_t                    r1:1;                 /*     3: 0  1 */

	/* size: 4, cachelines: 1, members: 6 */
	/* last cacheline: 4 bytes */
};
struct tun_metadata {
	union {
		uint64_t           map;                  /*           8 */
		uint8_t            len;                  /*           1 */
	} present;                                       /*     0     8 */
	const struct tun_table  *  tab;                  /*     8     8 */
	union {
		uint8_t            u8[256];              /*         256 */
		struct geneve_opt  gnv[63];              /*         252 */
	} opts;                                          /*    16   256 */
	/* --- cacheline 4 boundary (256 bytes) was 16 bytes ago --- */

	/* size: 272, cachelines: 5, members: 3 */
	/* last cacheline: 16 bytes */
};
struct tun_metadata_loc_chain {
	struct tun_metadata_loc_chain * next;            /*     0     8 */
	int                        offset;               /*     8     4 */
	int                        len;                  /*    12     4 */

	/* size: 16, cachelines: 1, members: 3 */
	/* last cacheline: 16 bytes */
};
struct tun_metadata_loc {
	int                        len;                  /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	struct tun_metadata_loc_chain c;                 /*     8    16 */

	/* size: 24, cachelines: 1, members: 2 */
	/* sum members: 20, holes: 1, sum holes: 4 */
	/* last cacheline: 24 bytes */
};
struct tun_metadata_match_entry {
	struct tun_metadata_loc    loc;                  /*     0    24 */
	_Bool                      masked;               /*    24     1 */

	/* size: 32, cachelines: 1, members: 2 */
	/* padding: 7 */
	/* last cacheline: 32 bytes */
};
struct tun_metadata_allocation {
	struct tun_metadata_match_entry entry[64];       /*     0  2048 */
	/* --- cacheline 32 boundary (2048 bytes) --- */
	int                        alloc_offset;         /*  2048     4 */
	_Bool                      valid;                /*  2052     1 */

	/* size: 2056, cachelines: 33, members: 3 */
	/* padding: 3 */
	/* last cacheline: 8 bytes */
};
struct flow_tnl {
	ovs_be32                   ip_dst;               /*     0     4 */
	struct in6_addr            ipv6_dst;             /*     4    16 */
	ovs_be32                   ip_src;               /*    20     4 */
	struct in6_addr            ipv6_src;             /*    24    16 */
	ovs_be64                   tun_id;               /*    40     8 */
	uint16_t                   flags;                /*    48     2 */
	uint8_t                    ip_tos;               /*    50     1 */
	uint8_t                    ip_ttl;               /*    51     1 */
	ovs_be16                   tp_src;               /*    52     2 */
	ovs_be16                   tp_dst;               /*    54     2 */
	ovs_be16                   gbp_id;               /*    56     2 */
	uint8_t                    gbp_flags;            /*    58     1 */

	/* XXX 1 byte hole, try to pack */

	ovs_be32                   erspan_idx;           /*    60     4 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	uint8_t                    erspan_ver:2;         /*    64: 6  1 */
	uint8_t                    erspan_dir:1;         /*    64: 5  1 */
	uint8_t                    erspan_hwid:5;        /*    64: 0  1 */

	/* XXX 7 bytes hole, try to pack */

	struct tun_metadata        metadata;             /*    72   272 */
	/* --- cacheline 5 boundary (320 bytes) was 24 bytes ago --- */

	/* size: 344, cachelines: 6, members: 17 */
	/* sum members: 336, holes: 2, sum holes: 8 */
	/* last cacheline: 24 bytes */
};
struct flow_nsh {
	uint8_t                    flags;                /*     0     1 */
	uint8_t                    mdtype;               /*     1     1 */
	uint8_t                    np;                   /*     2     1 */
	uint8_t                    si;                   /*     3     1 */
	ovs_be32                   spi;                  /*     4     4 */
	ovs_be32                   c[4];                 /*     8    16 */

	/* size: 24, cachelines: 1, members: 6 */
	/* last cacheline: 24 bytes */
};
struct flow {
	struct flow_tnl            tunnel;               /*     0   344 */
	/* --- cacheline 5 boundary (320 bytes) was 24 bytes ago --- */
	ovs_be64                   metadata;             /*   344     8 */
	uint32_t                   regs[16];             /*   352    64 */
	/* --- cacheline 6 boundary (384 bytes) was 32 bytes ago --- */
	uint32_t                   skb_priority;         /*   416     4 */
	uint32_t                   pkt_mark;             /*   420     4 */
	uint32_t                   dp_hash;              /*   424     4 */
	union flow_in_port         in_port;              /*   428     4 */
	uint32_t                   recirc_id;            /*   432     4 */
	uint8_t                    ct_state;             /*   436     1 */
	uint8_t                    ct_nw_proto;          /*   437     1 */
	uint16_t                   ct_zone;              /*   438     2 */
	uint32_t                   ct_mark;              /*   440     4 */
	ovs_be32                   packet_type;          /*   444     4 */
	/* --- cacheline 7 boundary (448 bytes) --- */
	ovs_u128                   ct_label;             /*   448    16 */
	uint32_t                   conj_id;              /*   464     4 */
	ofp_port_t                 actset_output;        /*   468     4 */
	struct eth_addr            dl_dst;               /*   472     6 */
	struct eth_addr            dl_src;               /*   478     6 */
	ovs_be16                   dl_type;              /*   484     2 */
	uint8_t                    pad1[2];              /*   486     2 */
	union flow_vlan_hdr        vlans[2];             /*   488     8 */
	ovs_be32                   mpls_lse[4];          /*   496    16 */
	/* --- cacheline 8 boundary (512 bytes) --- */
	ovs_be32                   nw_src;               /*   512     4 */
	ovs_be32                   nw_dst;               /*   516     4 */
	ovs_be32                   ct_nw_src;            /*   520     4 */
	ovs_be32                   ct_nw_dst;            /*   524     4 */
	struct in6_addr            ipv6_src;             /*   528    16 */
	struct in6_addr            ipv6_dst;             /*   544    16 */
	struct in6_addr            ct_ipv6_src;          /*   560    16 */
	/* --- cacheline 9 boundary (576 bytes) --- */
	struct in6_addr            ct_ipv6_dst;          /*   576    16 */
	ovs_be32                   ipv6_label;           /*   592     4 */
	uint8_t                    nw_frag;              /*   596     1 */
	uint8_t                    nw_tos;               /*   597     1 */
	uint8_t                    nw_ttl;               /*   598     1 */
	uint8_t                    nw_proto;             /*   599     1 */
	struct in6_addr            nd_target;            /*   600    16 */
	struct eth_addr            arp_sha;              /*   616     6 */
	struct eth_addr            arp_tha;              /*   622     6 */
	ovs_be16                   tcp_flags;            /*   628     2 */
	ovs_be16                   pad2;                 /*   630     2 */
	struct flow_nsh            nsh;                  /*   632    24 */
	/* --- cacheline 10 boundary (640 bytes) was 16 bytes ago --- */
	ovs_be16                   tp_src;               /*   656     2 */
	ovs_be16                   tp_dst;               /*   658     2 */
	ovs_be16                   ct_tp_src;            /*   660     2 */
	ovs_be16                   ct_tp_dst;            /*   662     2 */
	ovs_be32                   igmp_group_ip4;       /*   664     4 */
	ovs_be32                   pad3;                 /*   668     4 */

	/* size: 672, cachelines: 11, members: 47 */
	/* last cacheline: 32 bytes */
};
struct flow_wildcards {
	struct flow                masks;                /*     0   672 */
	/* --- cacheline 10 boundary (640 bytes) was 32 bytes ago --- */

	/* size: 672, cachelines: 11, members: 1 */
	/* last cacheline: 32 bytes */
};
struct match {
	struct flow                flow;                 /*     0   672 */
	/* --- cacheline 10 boundary (640 bytes) was 32 bytes ago --- */
	struct flow_wildcards      wc;                   /*   672   672 */
	/* --- cacheline 21 boundary (1344 bytes) --- */
	struct tun_metadata_allocation tun_md;           /*  1344  2056 */

	/* XXX last struct has 3 bytes of padding */

	/* --- cacheline 53 boundary (3392 bytes) was 8 bytes ago --- */

	/* size: 3400, cachelines: 54, members: 3 */
	/* paddings: 1, sum paddings: 3 */
	/* last cacheline: 8 bytes */
};
struct miniflow {
	struct flowmap             map;                  /*     0    16 */

	/* size: 16, cachelines: 1, members: 1 */
	/* last cacheline: 16 bytes */
};
struct minimask {
	struct miniflow            masks;                /*     0    16 */

	/* size: 16, cachelines: 1, members: 1 */
	/* last cacheline: 16 bytes */
};
struct minimatch {
	union {
		struct {
			struct miniflow * flow;          /*     0     8 */
			struct minimask * mask;          /*     8     8 */
		};                                       /*          16 */
		struct miniflow *  flows[2];             /*          16 */
	};                                               /*     0    16 */

	/* size: 16, cachelines: 1, members: 1 */
	/* last cacheline: 16 bytes */
};
struct mf_bitmap {
	long unsigned int          bm[3];                /*     0    24 */

	/* size: 24, cachelines: 1, members: 1 */
	/* last cacheline: 24 bytes */
};
struct mf_field {
	enum mf_field_id           id;                   /*     0     1 */

	/* XXX 7 bytes hole, try to pack */

	const char  *              name;                 /*     8     8 */
	const char  *              extra_name;           /*    16     8 */
	unsigned int               n_bytes;              /*    24     4 */
	unsigned int               n_bits;               /*    28     4 */
	_Bool                      variable_len;         /*    32     1 */
	enum mf_maskable           maskable;             /*    33     1 */
	enum mf_string             string;               /*    34     1 */
	enum mf_prereqs            prereqs;              /*    35     1 */
	_Bool                      writable;             /*    36     1 */
	_Bool                      mapped;               /*    37     1 */

	/* XXX 2 bytes hole, try to pack */

	uint32_t                   usable_protocols_exact; /*    40     4 */
	uint32_t                   usable_protocols_cidr; /*    44     4 */
	uint32_t                   usable_protocols_bitwise; /*    48     4 */
	int                        flow_be32ofs;         /*    52     4 */

	/* size: 56, cachelines: 1, members: 15 */
	/* sum members: 47, holes: 2, sum holes: 9 */
	/* last cacheline: 56 bytes */
};
struct mf_subfield {
	const struct mf_field  *   field;                /*     0     8 */
	unsigned int               ofs;                  /*     8     4 */
	unsigned int               n_bits;               /*    12     4 */

	/* size: 16, cachelines: 1, members: 3 */
	/* last cacheline: 16 bytes */
};
struct field_array {
	struct mf_bitmap           used;                 /*     0    24 */
	size_t                     values_size;          /*    24     8 */
	uint8_t *                  values;               /*    32     8 */

	/* size: 40, cachelines: 1, members: 3 */
	/* last cacheline: 40 bytes */
};
struct pvector_entry {
	int                        priority;             /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	void *                     ptr;                  /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* sum members: 12, holes: 1, sum holes: 4 */
	/* last cacheline: 16 bytes */
};
struct pvector_impl {
	size_t                     size;                 /*     0     8 */
	size_t                     allocated;            /*     8     8 */
	struct pvector_entry       vector[0];            /*    16     0 */

	/* size: 16, cachelines: 1, members: 3 */
	/* last cacheline: 16 bytes */
};
struct pvector {
	struct {
		struct pvector_impl * p;                 /*     0     8 */
	} impl;                                          /*     0     8 */
	struct pvector_impl *      temp;                 /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct rculist {
	struct rculist *           prev;                 /*     0     8 */
	struct {
		struct rculist *   p;                    /*     8     8 */
	} next;                                          /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct versions {
	ovs_version_t              add_version;          /*     0     8 */
	ovs_version_t              remove_version;       /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct cls_trie {
	const struct mf_field  *   field;                /*     0     8 */
	rcu_trie_ptr               root;                 /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct classifier {
	int                        n_rules;              /*     0     4 */
	uint8_t                    n_flow_segments;      /*     4     1 */
	uint8_t                    flow_segments[3];     /*     5     3 */
	struct cmap                subtables_map;        /*     8     8 */
	struct pvector             subtables;            /*    16    16 */
	struct cmap                partitions;           /*    32     8 */
	struct cls_trie            tries[3];             /*    40    48 */
	/* --- cacheline 1 boundary (64 bytes) was 24 bytes ago --- */
	unsigned int               n_tries;              /*    88     4 */
	_Bool                      publish;              /*    92     1 */

	/* size: 96, cachelines: 2, members: 9 */
	/* padding: 3 */
	/* last cacheline: 32 bytes */
};
struct cls_conjunction {
	uint32_t                   id;                   /*     0     4 */
	uint8_t                    clause;               /*     4     1 */
	uint8_t                    n_clauses;            /*     5     1 */

	/* size: 8, cachelines: 1, members: 3 */
	/* padding: 2 */
	/* last cacheline: 8 bytes */
};
struct cls_rule {
	struct rculist             node;                 /*     0    16 */
	intconst                   priority;             /*    16     4 */

	/* XXX 4 bytes hole, try to pack */

	struct {
		struct cls_match * p;                    /*    24     8 */
	} cls_match;                                     /*    24     8 */
	struct minimatchconst      match;                /*    32    16 */

	/* size: 48, cachelines: 1, members: 4 */
	/* sum members: 44, holes: 1, sum holes: 4 */
	/* last cacheline: 48 bytes */
};
struct hmap_node {
	size_t                     hash;                 /*     0     8 */
	struct hmap_node *         next;                 /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct hmap {
	struct hmap_node * *       buckets;              /*     0     8 */
	struct hmap_node *         one;                  /*     8     8 */
	size_t                     mask;                 /*    16     8 */
	size_t                     n;                    /*    24     8 */

	/* size: 32, cachelines: 1, members: 4 */
	/* last cacheline: 32 bytes */
};
struct ovs_list {
	struct ovs_list *          prev;                 /*     0     8 */
	struct ovs_list *          next;                 /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct netdev_stats {
	uint64_t                   rx_packets;           /*     0     8 */
	uint64_t                   tx_packets;           /*     8     8 */
	uint64_t                   rx_bytes;             /*    16     8 */
	uint64_t                   tx_bytes;             /*    24     8 */
	uint64_t                   rx_errors;            /*    32     8 */
	uint64_t                   tx_errors;            /*    40     8 */
	uint64_t                   rx_dropped;           /*    48     8 */
	uint64_t                   tx_dropped;           /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	uint64_t                   multicast;            /*    64     8 */
	uint64_t                   collisions;           /*    72     8 */
	uint64_t                   rx_length_errors;     /*    80     8 */
	uint64_t                   rx_over_errors;       /*    88     8 */
	uint64_t                   rx_crc_errors;        /*    96     8 */
	uint64_t                   rx_frame_errors;      /*   104     8 */
	uint64_t                   rx_fifo_errors;       /*   112     8 */
	uint64_t                   rx_missed_errors;     /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	uint64_t                   tx_aborted_errors;    /*   128     8 */
	uint64_t                   tx_carrier_errors;    /*   136     8 */
	uint64_t                   tx_fifo_errors;       /*   144     8 */
	uint64_t                   tx_heartbeat_errors;  /*   152     8 */
	uint64_t                   tx_window_errors;     /*   160     8 */
	uint64_t                   rx_1_to_64_packets;   /*   168     8 */
	uint64_t                   rx_65_to_127_packets; /*   176     8 */
	uint64_t                   rx_128_to_255_packets; /*   184     8 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	uint64_t                   rx_256_to_511_packets; /*   192     8 */
	uint64_t                   rx_512_to_1023_packets; /*   200     8 */
	uint64_t                   rx_1024_to_1522_packets; /*   208     8 */
	uint64_t                   rx_1523_to_max_packets; /*   216     8 */
	uint64_t                   tx_1_to_64_packets;   /*   224     8 */
	uint64_t                   tx_65_to_127_packets; /*   232     8 */
	uint64_t                   tx_128_to_255_packets; /*   240     8 */
	uint64_t                   tx_256_to_511_packets; /*   248     8 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	uint64_t                   tx_512_to_1023_packets; /*   256     8 */
	uint64_t                   tx_1024_to_1522_packets; /*   264     8 */
	uint64_t                   tx_1523_to_max_packets; /*   272     8 */
	uint64_t                   tx_multicast_packets; /*   280     8 */
	uint64_t                   rx_broadcast_packets; /*   288     8 */
	uint64_t                   tx_broadcast_packets; /*   296     8 */
	uint64_t                   rx_undersized_errors; /*   304     8 */
	uint64_t                   rx_oversize_errors;   /*   312     8 */
	/* --- cacheline 5 boundary (320 bytes) --- */
	uint64_t                   rx_fragmented_errors; /*   320     8 */
	uint64_t                   rx_jabber_errors;     /*   328     8 */

	/* size: 336, cachelines: 6, members: 42 */
	/* last cacheline: 16 bytes */
};
struct uuid {
	uint32_t                   parts[4];             /*     0    16 */

	/* size: 16, cachelines: 1, members: 1 */
	/* last cacheline: 16 bytes */
};
struct ofpact {
	enum ofpact_type           type;                 /*     0     1 */
	uint8_t                    raw;                  /*     1     1 */
	uint16_t                   len;                  /*     2     2 */

	/* size: 4, cachelines: 1, members: 3 */
	/* last cacheline: 4 bytes */
};
struct ofputil_packet_in {
	void *                     packet;               /*     0     8 */
	size_t                     packet_len;           /*     8     8 */
	struct match               flow_metadata;        /*    16  3400 */
	/* --- cacheline 53 boundary (3392 bytes) was 24 bytes ago --- */
	enum ofp_packet_in_reason  reason;               /*  3416     4 */
	uint8_t                    table_id;             /*  3420     1 */

	/* XXX 3 bytes hole, try to pack */

	ovs_be64                   cookie;               /*  3424     8 */
	uint8_t *                  userdata;             /*  3432     8 */
	size_t                     userdata_len;         /*  3440     8 */

	/* size: 3448, cachelines: 54, members: 8 */
	/* sum members: 3445, holes: 1, sum holes: 3 */
	/* last cacheline: 56 bytes */
};
struct ofputil_packet_in_private {
	struct ofputil_packet_in   base;                 /*     0  3448 */
	/* --- cacheline 53 boundary (3392 bytes) was 56 bytes ago --- */
	struct uuid                bridge;               /*  3448    16 */
	/* --- cacheline 54 boundary (3456 bytes) was 8 bytes ago --- */
	uint8_t *                  stack;                /*  3464     8 */
	size_t                     stack_size;           /*  3472     8 */
	uint32_t                   mirrors;              /*  3480     4 */
	_Bool                      conntracked;          /*  3484     1 */

	/* XXX 3 bytes hole, try to pack */

	struct ofpact *            actions;              /*  3488     8 */
	size_t                     actions_len;          /*  3496     8 */
	struct ofpact *            action_set;           /*  3504     8 */
	size_t                     action_set_len;       /*  3512     8 */
	/* --- cacheline 55 boundary (3520 bytes) --- */

	/* size: 3520, cachelines: 55, members: 10 */
	/* sum members: 3517, holes: 1, sum holes: 3 */
};
struct ofputil_phy_port {
	ofp_port_t                 port_no;              /*     0     4 */
	struct eth_addr            hw_addr;              /*     4     6 */
	struct eth_addr64          hw_addr64;            /*    10     8 */
	char                       name[64];             /*    18    64 */

	/* XXX 2 bytes hole, try to pack */

	/* --- cacheline 1 boundary (64 bytes) was 20 bytes ago --- */
	enum ofputil_port_config   config;               /*    84     4 */
	enum ofputil_port_state    state;                /*    88     4 */
	enum netdev_features       curr;                 /*    92     4 */
	enum netdev_features       advertised;           /*    96     4 */
	enum netdev_features       supported;            /*   100     4 */
	enum netdev_features       peer;                 /*   104     4 */
	uint32_t                   curr_speed;           /*   108     4 */
	uint32_t                   max_speed;            /*   112     4 */

	/* size: 116, cachelines: 2, members: 12 */
	/* sum members: 114, holes: 1, sum holes: 2 */
	/* last cacheline: 52 bytes */
};
struct ofputil_port_mod {
	ofp_port_t                 port_no;              /*     0     4 */
	struct eth_addr            hw_addr;              /*     4     6 */
	struct eth_addr64          hw_addr64;            /*    10     8 */

	/* XXX 2 bytes hole, try to pack */

	enum ofputil_port_config   config;               /*    20     4 */
	enum ofputil_port_config   mask;                 /*    24     4 */
	enum netdev_features       advertise;            /*    28     4 */

	/* size: 32, cachelines: 1, members: 6 */
	/* sum members: 30, holes: 1, sum holes: 2 */
	/* last cacheline: 32 bytes */
};
struct ofputil_table_action_features {
	uint64_t                   ofpacts;              /*     0     8 */
	struct mf_bitmap           set_fields;           /*     8    24 */

	/* size: 32, cachelines: 1, members: 2 */
	/* last cacheline: 32 bytes */
};
struct ofputil_table_instruction_features {
	long unsigned int          next[4];              /*     0    32 */
	uint32_t                   instructions;         /*    32     4 */

	/* XXX 4 bytes hole, try to pack */

	struct ofputil_table_action_features write;      /*    40    32 */
	/* --- cacheline 1 boundary (64 bytes) was 8 bytes ago --- */
	struct ofputil_table_action_features apply;      /*    72    32 */

	/* size: 104, cachelines: 2, members: 4 */
	/* sum members: 100, holes: 1, sum holes: 4 */
	/* last cacheline: 40 bytes */
};
struct ofputil_table_features {
	uint8_t                    table_id;             /*     0     1 */
	char                       name[32];             /*     1    32 */

	/* XXX 7 bytes hole, try to pack */

	ovs_be64                   metadata_match;       /*    40     8 */
	ovs_be64                   metadata_write;       /*    48     8 */
	uint32_t                   max_entries;          /*    56     4 */
	enum ofputil_table_miss    miss_config;          /*    60     4 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	int                        supports_eviction;    /*    64     4 */
	int                        supports_vacancy_events; /*    68     4 */
	struct ofputil_table_instruction_features nonmiss; /*    72   104 */
	/* --- cacheline 2 boundary (128 bytes) was 48 bytes ago --- */
	struct ofputil_table_instruction_features miss;  /*   176   104 */
	/* --- cacheline 4 boundary (256 bytes) was 24 bytes ago --- */
	struct mf_bitmap           match;                /*   280    24 */
	struct mf_bitmap           mask;                 /*   304    24 */
	/* --- cacheline 5 boundary (320 bytes) was 8 bytes ago --- */
	struct mf_bitmap           wildcard;             /*   328    24 */

	/* size: 352, cachelines: 6, members: 13 */
	/* sum members: 345, holes: 1, sum holes: 7 */
	/* last cacheline: 32 bytes */
};
struct ofputil_meter_band {
	uint16_t                   type;                 /*     0     2 */
	uint8_t                    prec_level;           /*     2     1 */

	/* XXX 1 byte hole, try to pack */

	uint32_t                   rate;                 /*     4     4 */
	uint32_t                   burst_size;           /*     8     4 */

	/* size: 12, cachelines: 1, members: 4 */
	/* sum members: 11, holes: 1, sum holes: 1 */
	/* last cacheline: 12 bytes */
};
struct ofputil_meter_band_stats {
	uint64_t                   packet_count;         /*     0     8 */
	uint64_t                   byte_count;           /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct ofputil_meter_config {
	uint32_t                   meter_id;             /*     0     4 */
	uint16_t                   flags;                /*     4     2 */
	uint16_t                   n_bands;              /*     6     2 */
	struct ofputil_meter_band * bands;               /*     8     8 */

	/* size: 16, cachelines: 1, members: 4 */
	/* last cacheline: 16 bytes */
};
struct ofputil_meter_stats {
	uint32_t                   meter_id;             /*     0     4 */
	uint32_t                   flow_count;           /*     4     4 */
	uint64_t                   packet_in_count;      /*     8     8 */
	uint64_t                   byte_in_count;        /*    16     8 */
	uint32_t                   duration_sec;         /*    24     4 */
	uint32_t                   duration_nsec;        /*    28     4 */
	uint16_t                   n_bands;              /*    32     2 */

	/* XXX 6 bytes hole, try to pack */

	struct ofputil_meter_band_stats * bands;         /*    40     8 */

	/* size: 48, cachelines: 1, members: 8 */
	/* sum members: 42, holes: 1, sum holes: 6 */
	/* last cacheline: 48 bytes */
};
struct ofputil_meter_features {
	uint32_t                   max_meters;           /*     0     4 */
	uint32_t                   band_types;           /*     4     4 */
	uint32_t                   capabilities;         /*     8     4 */
	uint8_t                    max_bands;            /*    12     1 */
	uint8_t                    max_color;            /*    13     1 */

	/* size: 16, cachelines: 1, members: 5 */
	/* padding: 2 */
	/* last cacheline: 16 bytes */
};
struct ofputil_table_stats {
	uint8_t                    table_id;             /*     0     1 */

	/* XXX 3 bytes hole, try to pack */

	uint32_t                   active_count;         /*     4     4 */
	uint64_t                   lookup_count;         /*     8     8 */
	uint64_t                   matched_count;        /*    16     8 */

	/* size: 24, cachelines: 1, members: 4 */
	/* sum members: 21, holes: 1, sum holes: 3 */
	/* last cacheline: 24 bytes */
};
struct bucket_counter {
	uint64_t                   packet_count;         /*     0     8 */
	uint64_t                   byte_count;           /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct ofputil_group_props {
	char                       selection_method[16]; /*     0    16 */
	uint64_t                   selection_method_param; /*    16     8 */
	struct field_array         fields;               /*    24    40 */
	/* --- cacheline 1 boundary (64 bytes) --- */

	/* size: 64, cachelines: 1, members: 3 */
};
struct ofputil_group_mod {
	uint16_t                   command;              /*     0     2 */
	uint8_t                    type;                 /*     2     1 */

	/* XXX 1 byte hole, try to pack */

	uint32_t                   group_id;             /*     4     4 */
	uint32_t                   command_bucket_id;    /*     8     4 */

	/* XXX 4 bytes hole, try to pack */

	struct ovs_list            buckets;              /*    16    16 */
	struct ofputil_group_props props;                /*    32    64 */
	/* --- cacheline 1 boundary (64 bytes) was 32 bytes ago --- */

	/* size: 96, cachelines: 2, members: 6 */
	/* sum members: 91, holes: 2, sum holes: 5 */
	/* last cacheline: 32 bytes */
};
struct ofputil_group_stats {
	uint32_t                   group_id;             /*     0     4 */
	uint32_t                   ref_count;            /*     4     4 */
	uint64_t                   packet_count;         /*     8     8 */
	uint64_t                   byte_count;           /*    16     8 */
	uint32_t                   duration_sec;         /*    24     4 */
	uint32_t                   duration_nsec;        /*    28     4 */
	uint32_t                   n_buckets;            /*    32     4 */

	/* XXX 4 bytes hole, try to pack */

	struct bucket_counter *    bucket_stats;         /*    40     8 */

	/* size: 48, cachelines: 1, members: 8 */
	/* sum members: 44, holes: 1, sum holes: 4 */
	/* last cacheline: 48 bytes */
};
struct ofputil_group_features {
	uint32_t                   types;                /*     0     4 */
	uint32_t                   capabilities;         /*     4     4 */
	uint32_t                   max_groups[4];        /*     8    16 */
	uint64_t                   ofpacts[4];           /*    24    32 */

	/* size: 56, cachelines: 1, members: 4 */
	/* last cacheline: 56 bytes */
};
struct cfm_settings {
	uint64_t                   mpid;                 /*     0     8 */
	int                        interval;             /*     8     4 */
	_Bool                      extended;             /*    12     1 */
	_Bool                      demand;               /*    13     1 */
	_Bool                      opup;                 /*    14     1 */

	/* XXX 1 byte hole, try to pack */

	uint16_t                   ccm_vlan;             /*    16     2 */
	uint8_t                    ccm_pcp;              /*    18     1 */
	_Bool                      check_tnl_key;        /*    19     1 */

	/* size: 24, cachelines: 1, members: 8 */
	/* sum members: 19, holes: 1, sum holes: 1 */
	/* padding: 4 */
	/* last cacheline: 24 bytes */
};
struct cfm_status {
	enum cfm_fault_reason      faults;               /*     0     4 */
	int                        remote_opstate;       /*     4     4 */
	uint64_t                   flap_count;           /*     8     8 */
	int                        health;               /*    16     4 */

	/* XXX 4 bytes hole, try to pack */

	uint64_t *                 rmps;                 /*    24     8 */
	size_t                     n_rmps;               /*    32     8 */

	/* size: 40, cachelines: 1, members: 6 */
	/* sum members: 36, holes: 1, sum holes: 4 */
	/* last cacheline: 40 bytes */
};
struct flowmap {
	map_t                      bits[2];              /*     0    16 */

	/* size: 16, cachelines: 1, members: 1 */
	/* last cacheline: 16 bytes */
};
struct sset {
	struct hmap                map;                  /*     0    32 */

	/* size: 32, cachelines: 1, members: 1 */
	/* last cacheline: 32 bytes */
};
struct netflow_options {
	struct sset                collectors;           /*     0    32 */
	uint8_t                    engine_type;          /*    32     1 */
	uint8_t                    engine_id;            /*    33     1 */

	/* XXX 2 bytes hole, try to pack */

	int                        active_timeout;       /*    36     4 */
	_Bool                      add_id_to_iface;      /*    40     1 */

	/* size: 48, cachelines: 1, members: 5 */
	/* sum members: 39, holes: 1, sum holes: 2 */
	/* padding: 7 */
	/* last cacheline: 48 bytes */
};
struct smap {
	struct hmap                map;                  /*     0    32 */

	/* size: 32, cachelines: 1, members: 1 */
	/* last cacheline: 32 bytes */
};
struct lacp_settings {
	char *                     name;                 /*     0     8 */
	struct eth_addr            id;                   /*     8     6 */
	uint16_t                   priority;             /*    14     2 */
	_Bool                      active;               /*    16     1 */
	_Bool                      fast;                 /*    17     1 */
	_Bool                      fallback_ab_cfg;      /*    18     1 */

	/* size: 24, cachelines: 1, members: 6 */
	/* padding: 5 */
	/* last cacheline: 24 bytes */
};
struct lacp_slave_settings {
	char *                     name;                 /*     0     8 */
	uint16_t                   id;                   /*     8     2 */
	uint16_t                   priority;             /*    10     2 */
	uint16_t                   key;                  /*    12     2 */

	/* size: 16, cachelines: 1, members: 4 */
	/* padding: 2 */
	/* last cacheline: 16 bytes */
};
struct lacp_slave_stats {
	struct eth_addr            dot3adAggPortActorSystemID; /*     0     6 */
	struct eth_addr            dot3adAggPortPartnerOperSystemID; /*     6     6 */
	uint32_t                   dot3adAggPortAttachedAggID; /*    12     4 */
	uint8_t                    dot3adAggPortActorAdminState; /*    16     1 */
	uint8_t                    dot3adAggPortActorOperState; /*    17     1 */
	uint8_t                    dot3adAggPortPartnerAdminState; /*    18     1 */
	uint8_t                    dot3adAggPortPartnerOperState; /*    19     1 */
	uint32_t                   dot3adAggPortStatsLACPDUsRx; /*    20     4 */
	uint32_t                   dot3adAggPortStatsIllegalRx; /*    24     4 */
	uint32_t                   dot3adAggPortStatsLACPDUsTx; /*    28     4 */

	/* size: 32, cachelines: 1, members: 10 */
	/* last cacheline: 32 bytes */
};
struct ofproto_sflow_options {
	struct sset                targets;              /*     0    32 */
	uint32_t                   sampling_rate;        /*    32     4 */
	uint32_t                   polling_interval;     /*    36     4 */
	uint32_t                   header_len;           /*    40     4 */
	uint32_t                   sub_id;               /*    44     4 */
	char *                     agent_device;         /*    48     8 */
	char *                     control_ip;           /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */

	/* size: 64, cachelines: 1, members: 7 */
};
struct ofproto_ipfix_bridge_exporter_options {
	struct sset                targets;              /*     0    32 */
	uint32_t                   sampling_rate;        /*    32     4 */
	uint32_t                   obs_domain_id;        /*    36     4 */
	uint32_t                   obs_point_id;         /*    40     4 */
	uint32_t                   cache_active_timeout; /*    44     4 */
	uint32_t                   cache_max_flows;      /*    48     4 */
	_Bool                      enable_tunnel_sampling; /*    52     1 */
	_Bool                      enable_input_sampling; /*    53     1 */
	_Bool                      enable_output_sampling; /*    54     1 */

	/* XXX 1 byte hole, try to pack */

	char *                     virtual_obs_id;       /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */

	/* size: 64, cachelines: 1, members: 10 */
	/* sum members: 63, holes: 1, sum holes: 1 */
};
struct ofproto_ipfix_flow_exporter_options {
	uint32_t                   collector_set_id;     /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	struct sset                targets;              /*     8    32 */
	uint32_t                   cache_active_timeout; /*    40     4 */
	uint32_t                   cache_max_flows;      /*    44     4 */
	_Bool                      enable_tunnel_sampling; /*    48     1 */

	/* XXX 7 bytes hole, try to pack */

	char *                     virtual_obs_id;       /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */

	/* size: 64, cachelines: 1, members: 6 */
	/* sum members: 53, holes: 2, sum holes: 11 */
};
struct ofproto_rstp_status {
	_Bool                      enabled;              /*     0     1 */

	/* XXX 7 bytes hole, try to pack */

	rstp_identifier            root_id;              /*     8     8 */
	rstp_identifier            bridge_id;            /*    16     8 */
	rstp_identifier            designated_id;        /*    24     8 */
	uint32_t                   root_path_cost;       /*    32     4 */
	uint16_t                   designated_port_id;   /*    36     2 */
	uint16_t                   bridge_port_id;       /*    38     2 */

	/* size: 40, cachelines: 1, members: 7 */
	/* sum members: 33, holes: 1, sum holes: 7 */
	/* last cacheline: 40 bytes */
};
struct ofproto_rstp_settings {
	rstp_identifier            address;              /*     0     8 */
	uint16_t                   priority;             /*     8     2 */

	/* XXX 2 bytes hole, try to pack */

	uint32_t                   ageing_time;          /*    12     4 */
	enum rstp_force_protocol_version force_protocol_version; /*    16     4 */
	uint16_t                   bridge_forward_delay; /*    20     2 */
	uint16_t                   bridge_max_age;       /*    22     2 */
	uint16_t                   transmit_hold_count;  /*    24     2 */

	/* size: 32, cachelines: 1, members: 7 */
	/* sum members: 24, holes: 1, sum holes: 2 */
	/* padding: 6 */
	/* last cacheline: 32 bytes */
};
struct ofproto_port_rstp_status {
	_Bool                      enabled;              /*     0     1 */

	/* XXX 1 byte hole, try to pack */

	uint16_t                   port_id;              /*     2     2 */
	enum rstp_port_role        role;                 /*     4     4 */
	enum rstp_state            state;                /*     8     4 */

	/* XXX 4 bytes hole, try to pack */

	rstp_identifier            designated_bridge_id; /*    16     8 */
	uint16_t                   designated_port_id;   /*    24     2 */

	/* XXX 2 bytes hole, try to pack */

	uint32_t                   designated_path_cost; /*    28     4 */
	int                        tx_count;             /*    32     4 */
	int                        rx_count;             /*    36     4 */
	int                        error_count;          /*    40     4 */
	int                        uptime;               /*    44     4 */

	/* size: 48, cachelines: 1, members: 11 */
	/* sum members: 41, holes: 3, sum holes: 7 */
	/* last cacheline: 48 bytes */
};
struct ofproto_port_rstp_settings {
	_Bool                      enable;               /*     0     1 */

	/* XXX 1 byte hole, try to pack */

	uint16_t                   port_num;             /*     2     2 */
	uint8_t                    priority;             /*     4     1 */

	/* XXX 3 bytes hole, try to pack */

	uint32_t                   path_cost;            /*     8     4 */
	_Bool                      admin_edge_port;      /*    12     1 */
	_Bool                      auto_edge;            /*    13     1 */
	_Bool                      mcheck;               /*    14     1 */
	uint8_t                    admin_p2p_mac_state;  /*    15     1 */
	_Bool                      admin_port_state;     /*    16     1 */

	/* size: 20, cachelines: 1, members: 9 */
	/* sum members: 13, holes: 2, sum holes: 4 */
	/* padding: 3 */
	/* last cacheline: 20 bytes */
};
struct ofproto_stp_settings {
	stp_identifier             system_id;            /*     0     8 */
	uint16_t                   priority;             /*     8     2 */
	uint16_t                   hello_time;           /*    10     2 */
	uint16_t                   max_age;              /*    12     2 */
	uint16_t                   fwd_delay;            /*    14     2 */

	/* size: 16, cachelines: 1, members: 5 */
	/* last cacheline: 16 bytes */
};
struct ofproto_stp_status {
	_Bool                      enabled;              /*     0     1 */

	/* XXX 7 bytes hole, try to pack */

	stp_identifier             bridge_id;            /*     8     8 */
	stp_identifier             designated_root;      /*    16     8 */
	int                        root_path_cost;       /*    24     4 */

	/* size: 32, cachelines: 1, members: 4 */
	/* sum members: 21, holes: 1, sum holes: 7 */
	/* padding: 4 */
	/* last cacheline: 32 bytes */
};
struct ofproto_port_stp_settings {
	_Bool                      enable;               /*     0     1 */
	uint8_t                    port_num;             /*     1     1 */
	uint8_t                    priority;             /*     2     1 */

	/* XXX 1 byte hole, try to pack */

	uint16_t                   path_cost;            /*     4     2 */

	/* size: 6, cachelines: 1, members: 4 */
	/* sum members: 5, holes: 1, sum holes: 1 */
	/* last cacheline: 6 bytes */
};
struct ofproto_port_stp_status {
	_Bool                      enabled;              /*     0     1 */

	/* XXX 3 bytes hole, try to pack */

	int                        port_id;              /*     4     4 */
	enum stp_state             state;                /*     8     4 */
	unsigned int               sec_in_state;         /*    12     4 */
	enum stp_role              role;                 /*    16     4 */

	/* size: 20, cachelines: 1, members: 5 */
	/* sum members: 17, holes: 1, sum holes: 3 */
	/* last cacheline: 20 bytes */
};
struct ofproto_port_stp_stats {
	_Bool                      enabled;              /*     0     1 */

	/* XXX 3 bytes hole, try to pack */

	int                        tx_count;             /*     4     4 */
	int                        rx_count;             /*     8     4 */
	int                        error_count;          /*    12     4 */

	/* size: 16, cachelines: 1, members: 4 */
	/* sum members: 13, holes: 1, sum holes: 3 */
	/* last cacheline: 16 bytes */
};
struct ofproto_port_queue {
	uint32_t                   queue;                /*     0     4 */
	uint8_t                    dscp;                 /*     4     1 */

	/* size: 8, cachelines: 1, members: 2 */
	/* padding: 3 */
	/* last cacheline: 8 bytes */
};
struct ofproto_mcast_snooping_settings {
	_Bool                      flood_unreg;          /*     0     1 */

	/* XXX 3 bytes hole, try to pack */

	unsigned int               idle_time;            /*     4     4 */
	unsigned int               max_entries;          /*     8     4 */

	/* size: 12, cachelines: 1, members: 3 */
	/* sum members: 9, holes: 1, sum holes: 3 */
	/* last cacheline: 12 bytes */
};
struct ofproto_mcast_snooping_port_settings {
	_Bool                      flood;                /*     0     1 */
	_Bool                      flood_reports;        /*     1     1 */

	/* size: 2, cachelines: 1, members: 2 */
	/* last cacheline: 2 bytes */
};
struct ofproto_port {
	char *                     name;                 /*     0     8 */
	char *                     type;                 /*     8     8 */
	ofp_port_t                 ofp_port;             /*    16     4 */

	/* size: 24, cachelines: 1, members: 3 */
	/* padding: 4 */
	/* last cacheline: 24 bytes */
};
struct ofproto {
	struct hmap_node           hmap_node;            /*     0    16 */
	const struct ofproto_class  * ofproto_class;     /*    16     8 */
	char *                     type;                 /*    24     8 */
	char *                     name;                 /*    32     8 */
	uint64_t                   fallback_dpid;        /*    40     8 */
	uint64_t                   datapath_id;          /*    48     8 */
	_Bool                      forward_bpdu;         /*    56     1 */

	/* XXX 7 bytes hole, try to pack */

	/* --- cacheline 1 boundary (64 bytes) --- */
	char *                     mfr_desc;             /*    64     8 */
	char *                     hw_desc;              /*    72     8 */
	char *                     sw_desc;              /*    80     8 */
	char *                     serial_desc;          /*    88     8 */
	char *                     dp_desc;              /*    96     8 */
	enum ofputil_frag_handling frag_handling;        /*   104     4 */

	/* XXX 4 bytes hole, try to pack */

	struct hmap                ports;                /*   112    32 */
	/* --- cacheline 2 boundary (128 bytes) was 16 bytes ago --- */
	struct shash               port_by_name;         /*   144    32 */
	struct simap               ofp_requests;         /*   176    32 */
	/* --- cacheline 3 boundary (192 bytes) was 16 bytes ago --- */
	uint16_t                   alloc_port_no;        /*   208     2 */
	uint16_t                   max_ports;            /*   210     2 */

	/* XXX 4 bytes hole, try to pack */

	struct hmap                ofport_usage;         /*   216    32 */
	uint64_t                   change_seq;           /*   248     8 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	long long int              eviction_group_timer; /*   256     8 */
	struct oftable *           tables;               /*   264     8 */
	int                        n_tables;             /*   272     4 */

	/* XXX 4 bytes hole, try to pack */

	ovs_version_t              tables_version;       /*   280     8 */
	struct hindex              cookies;              /*   288    32 */
	/* --- cacheline 5 boundary (320 bytes) --- */
	struct hmap                learned_cookies;      /*   320    32 */
	struct ovs_list            expirable;            /*   352    16 */
	struct ofputil_meter_features meter_features;    /*   368    16 */

	/* XXX last struct has 2 bytes of padding */

	/* --- cacheline 6 boundary (384 bytes) --- */
	struct hmap                meters;               /*   384    32 */
	uint32_t                   slowpath_meter_id;    /*   416     4 */
	uint32_t                   controller_meter_id;  /*   420     4 */
	struct connmgr *           connmgr;              /*   424     8 */
	int                        min_mtu;              /*   432     4 */

	/* XXX 4 bytes hole, try to pack */

	struct cmap                groups;               /*   440     8 */
	/* --- cacheline 7 boundary (448 bytes) --- */
	uint32_t                   n_groups[4];          /*   448    16 */
	struct ofputil_group_features ogf;               /*   464    56 */
	/* --- cacheline 8 boundary (512 bytes) was 8 bytes ago --- */
	struct {
		struct tun_table * p;                    /*   520     8 */
	} metadata_tab;                                  /*   520     8 */
	struct vl_mff_map          vl_mff_map;           /*   528    56 */
	/* --- cacheline 9 boundary (576 bytes) was 8 bytes ago --- */

	/* size: 584, cachelines: 10, members: 38 */
	/* sum members: 561, holes: 5, sum holes: 23 */
	/* paddings: 1, sum paddings: 2 */
	/* last cacheline: 8 bytes */
};
struct ofproto_bundle_settings {
	char *                     name;                 /*     0     8 */
	ofp_port_t *               slaves;               /*     8     8 */
	size_t                     n_slaves;             /*    16     8 */
	enum port_vlan_mode        vlan_mode;            /*    24     4 */
	uint16_t                   qinq_ethtype;         /*    28     2 */

	/* XXX 2 bytes hole, try to pack */

	int                        vlan;                 /*    32     4 */

	/* XXX 4 bytes hole, try to pack */

	long unsigned int *        trunks;               /*    40     8 */
	long unsigned int *        cvlans;               /*    48     8 */
	_Bool                      use_priority_tags;    /*    56     1 */

	/* XXX 7 bytes hole, try to pack */

	/* --- cacheline 1 boundary (64 bytes) --- */
	struct bond_settings *     bond;                 /*    64     8 */
	struct lacp_settings *     lacp;                 /*    72     8 */
	struct lacp_slave_settings * lacp_slaves;        /*    80     8 */
	_Bool                      protected;            /*    88     1 */

	/* size: 96, cachelines: 2, members: 13 */
	/* sum members: 76, holes: 3, sum holes: 13 */
	/* padding: 7 */
	/* last cacheline: 32 bytes */
};
struct ofproto_mirror_settings {
	char *                     name;                 /*     0     8 */
	void * *                   srcs;                 /*     8     8 */
	size_t                     n_srcs;               /*    16     8 */
	void * *                   dsts;                 /*    24     8 */
	size_t                     n_dsts;               /*    32     8 */
	long unsigned int *        src_vlans;            /*    40     8 */
	void *                     out_bundle;           /*    48     8 */
	uint16_t                   out_vlan;             /*    56     2 */
	uint16_t                   snaplen;              /*    58     2 */

	/* size: 64, cachelines: 1, members: 9 */
	/* padding: 4 */
};
struct ovs_mutex {
	pthread_mutex_t            lock;                 /*     0    40 */
	const char  *              where;                /*    40     8 */

	/* size: 48, cachelines: 1, members: 2 */
	/* last cacheline: 48 bytes */
};
struct heap_node {
	size_t                     idx;                  /*     0     8 */
	uint64_t                   priority;             /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct heap {
	struct heap_node * *       array;                /*     0     8 */
	size_t                     n;                    /*     8     8 */
	size_t                     allocated;            /*    16     8 */

	/* size: 24, cachelines: 1, members: 3 */
	/* last cacheline: 24 bytes */
};
struct hindex_node {
	size_t                     hash;                 /*     0     8 */
	struct hindex_node *       d;                    /*     8     8 */
	struct hindex_node *       s;                    /*    16     8 */

	/* size: 24, cachelines: 1, members: 3 */
	/* last cacheline: 24 bytes */
};
struct hindex {
	struct hindex_node * *     buckets;              /*     0     8 */
	struct hindex_node *       one;                  /*     8     8 */
	size_t                     mask;                 /*    16     8 */
	size_t                     n_unique;             /*    24     8 */

	/* size: 32, cachelines: 1, members: 4 */
	/* last cacheline: 32 bytes */
};
struct object_collection {
	void * *                   objs;                 /*     0     8 */
	size_t                     n;                    /*     8     8 */
	size_t                     capacity;             /*    16     8 */
	void *                     stub[5];              /*    24    40 */
	/* --- cacheline 1 boundary (64 bytes) --- */

	/* size: 64, cachelines: 1, members: 4 */
};
struct shash {
	struct hmap                map;                  /*     0    32 */

	/* size: 32, cachelines: 1, members: 1 */
	/* last cacheline: 32 bytes */
};
struct simap {
	struct hmap                map;                  /*     0    32 */

	/* size: 32, cachelines: 1, members: 1 */
	/* last cacheline: 32 bytes */
};
struct vl_mff_map {
	struct cmap                cmap;                 /*     0     8 */
	struct ovs_mutex           mutex;                /*     8    48 */

	/* size: 56, cachelines: 1, members: 2 */
	/* last cacheline: 56 bytes */
};
struct ofproto_class {
	void                       (*init)(const struct shash  *); /*     0     8 */
	void                       (*enumerate_types)(struct sset *); /*     8     8 */
	int                        (*enumerate_names)(const char  *, struct sset *); /*    16     8 */
	int                        (*del)(const char  *, const char  *); /*    24     8 */
	const char  *              (*port_open_type)(const char  *, const char  *); /*    32     8 */
	int                        (*type_run)(const char  *); /*    40     8 */
	void                       (*type_wait)(const char  *); /*    48     8 */
	struct ofproto *           (*alloc)(void);       /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	int                        (*construct)(struct ofproto *); /*    64     8 */
	void                       (*destruct)(struct ofproto *, _Bool); /*    72     8 */
	void                       (*dealloc)(struct ofproto *); /*    80     8 */
	int                        (*run)(struct ofproto *); /*    88     8 */
	void                       (*wait)(struct ofproto *); /*    96     8 */
	void                       (*get_memory_usage)(const struct ofproto  *, struct simap *); /*   104     8 */
	void                       (*type_get_memory_usage)(const char  *, struct simap *); /*   112     8 */
	void                       (*flush)(struct ofproto *); /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	void                       (*query_tables)(struct ofproto *, struct ofputil_table_features *, struct ofputil_table_stats *); /*   128     8 */
	void                       (*set_tables_version)(struct ofproto *, ovs_version_t); /*   136     8 */
	struct ofport *            (*port_alloc)(void);  /*   144     8 */
	int                        (*port_construct)(struct ofport *); /*   152     8 */
	void                       (*port_destruct)(struct ofport *, _Bool); /*   160     8 */
	void                       (*port_dealloc)(struct ofport *); /*   168     8 */
	void                       (*port_modified)(struct ofport *); /*   176     8 */
	void                       (*port_reconfigured)(struct ofport *, enum ofputil_port_config); /*   184     8 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	int                        (*port_query_by_name)(const struct ofproto  *, const char  *, struct ofproto_port *); /*   192     8 */
	int                        (*port_add)(struct ofproto *, struct netdev *); /*   200     8 */
	int                        (*port_del)(struct ofproto *, ofp_port_t); /*   208     8 */
	int                        (*port_set_config)(const struct ofport  *, const struct smap  *); /*   216     8 */
	int                        (*port_get_stats)(const struct ofport  *, struct netdev_stats *); /*   224     8 */
	int                        (*port_dump_start)(const struct ofproto  *, void * *); /*   232     8 */
	int                        (*port_dump_next)(const struct ofproto  *, void *, struct ofproto_port *); /*   240     8 */
	int                        (*port_dump_done)(const struct ofproto  *, void *); /*   248     8 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	int                        (*port_poll)(const struct ofproto  *, char * *); /*   256     8 */
	void                       (*port_poll_wait)(const struct ofproto  *); /*   264     8 */
	int                        (*port_is_lacp_current)(const struct ofport  *); /*   272     8 */
	int                        (*port_get_lacp_stats)(const struct ofport  *, struct lacp_slave_stats *); /*   280     8 */
	enum ofperr                (*rule_choose_table)(const struct ofproto  *, const struct match  *, uint8_t *); /*   288     8 */
	struct rule *              (*rule_alloc)(void);  /*   296     8 */
	enum ofperr                (*rule_construct)(struct rule *); /*   304     8 */
	void                       (*rule_insert)(struct rule *, struct rule *, _Bool); /*   312     8 */
	/* --- cacheline 5 boundary (320 bytes) --- */
	void                       (*rule_delete)(struct rule *); /*   320     8 */
	void                       (*rule_destruct)(struct rule *); /*   328     8 */
	void                       (*rule_dealloc)(struct rule *); /*   336     8 */
	void                       (*rule_get_stats)(struct rule *, uint64_t *, uint64_t *, long long int *); /*   344     8 */
	enum ofperr                (*packet_xlate)(struct ofproto *, struct ofproto_packet_out *); /*   352     8 */
	void                       (*packet_xlate_revert)(struct ofproto *, struct ofproto_packet_out *); /*   360     8 */
	void                       (*packet_execute)(struct ofproto *, struct ofproto_packet_out *); /*   368     8 */
	_Bool                      (*set_frag_handling)(struct ofproto *, enum ofputil_frag_handling); /*   376     8 */
	/* --- cacheline 6 boundary (384 bytes) --- */
	enum ofperr                (*nxt_resume)(struct ofproto *, const struct ofputil_packet_in_private  *); /*   384     8 */
	int                        (*set_netflow)(struct ofproto *, const struct netflow_options  *); /*   392     8 */
	void                       (*get_netflow_ids)(const struct ofproto  *, uint8_t *, uint8_t *); /*   400     8 */
	int                        (*set_sflow)(struct ofproto *, const struct ofproto_sflow_options  *); /*   408     8 */
	int                        (*set_ipfix)(struct ofproto *, const struct ofproto_ipfix_bridge_exporter_options  *, const struct ofproto_ipfix_flow_exporter_options  *, size_t); /*   416     8 */
	int                        (*get_ipfix_stats)(const struct ofproto  *, _Bool, struct ovs_list *); /*   424     8 */
	int                        (*set_cfm)(struct ofport *, const struct cfm_settings  *); /*   432     8 */
	_Bool                      (*cfm_status_changed)(struct ofport *); /*   440     8 */
	/* --- cacheline 7 boundary (448 bytes) --- */
	int                        (*get_cfm_status)(const struct ofport  *, struct cfm_status *); /*   448     8 */
	int                        (*set_lldp)(struct ofport *, const struct smap  *); /*   456     8 */
	_Bool                      (*get_lldp_status)(const struct ofport  *, struct lldp_status *); /*   464     8 */
	int                        (*set_aa)(struct ofproto *, const struct aa_settings  *); /*   472     8 */
	int                        (*aa_mapping_set)(struct ofproto *, void *, const struct aa_mapping_settings  *); /*   480     8 */
	int                        (*aa_mapping_unset)(struct ofproto *, void *); /*   488     8 */
	int                        (*aa_vlan_get_queued)(struct ofproto *, struct ovs_list *); /*   496     8 */
	unsigned int               (*aa_vlan_get_queue_size)(struct ofproto *); /*   504     8 */
	/* --- cacheline 8 boundary (512 bytes) --- */
	int                        (*set_bfd)(struct ofport *, const struct smap  *); /*   512     8 */
	_Bool                      (*bfd_status_changed)(struct ofport *); /*   520     8 */
	int                        (*get_bfd_status)(struct ofport *, struct smap *); /*   528     8 */
	int                        (*set_stp)(struct ofproto *, const struct ofproto_stp_settings  *); /*   536     8 */
	int                        (*get_stp_status)(struct ofproto *, struct ofproto_stp_status *); /*   544     8 */
	int                        (*set_stp_port)(struct ofport *, const struct ofproto_port_stp_settings  *); /*   552     8 */
	int                        (*get_stp_port_status)(struct ofport *, struct ofproto_port_stp_status *); /*   560     8 */
	int                        (*get_stp_port_stats)(struct ofport *, struct ofproto_port_stp_stats *); /*   568     8 */
	/* --- cacheline 9 boundary (576 bytes) --- */
	void                       (*set_rstp)(struct ofproto *, const struct ofproto_rstp_settings  *); /*   576     8 */
	void                       (*get_rstp_status)(struct ofproto *, struct ofproto_rstp_status *); /*   584     8 */
	void                       (*set_rstp_port)(struct ofport *, const struct ofproto_port_rstp_settings  *); /*   592     8 */
	void                       (*get_rstp_port_status)(struct ofport *, struct ofproto_port_rstp_status *); /*   600     8 */
	int                        (*set_queues)(struct ofport *, const struct ofproto_port_queue  *, size_t); /*   608     8 */
	int                        (*bundle_set)(struct ofproto *, void *, const struct ofproto_bundle_settings  *); /*   616     8 */
	void                       (*bundle_remove)(struct ofport *); /*   624     8 */
	int                        (*mirror_set)(struct ofproto *, void *, const struct ofproto_mirror_settings  *); /*   632     8 */
	/* --- cacheline 10 boundary (640 bytes) --- */
	int                        (*mirror_get_stats)(struct ofproto *, void *, uint64_t *, uint64_t *); /*   640     8 */
	int                        (*set_flood_vlans)(struct ofproto *, long unsigned int *); /*   648     8 */
	_Bool                      (*is_mirror_output_bundle)(const struct ofproto  *, void *); /*   656     8 */
	void                       (*forward_bpdu_changed)(struct ofproto *); /*   664     8 */
	void                       (*set_mac_table_config)(struct ofproto *, unsigned int, size_t); /*   672     8 */
	int                        (*set_mcast_snooping)(struct ofproto *, const struct ofproto_mcast_snooping_settings  *); /*   680     8 */
	int                        (*set_mcast_snooping_port)(struct ofproto *, void *, const struct ofproto_mcast_snooping_port_settings  *); /*   688     8 */
	void                       (*meter_get_features)(const struct ofproto  *, struct ofputil_meter_features *); /*   696     8 */
	/* --- cacheline 11 boundary (704 bytes) --- */
	enum ofperr                (*meter_set)(struct ofproto *, ofproto_meter_id *, struct ofputil_meter_config *); /*   704     8 */
	enum ofperr                (*meter_get)(const struct ofproto  *, ofproto_meter_id, struct ofputil_meter_stats *, uint16_t); /*   712     8 */
	void                       (*meter_del)(struct ofproto *, ofproto_meter_id); /*   720     8 */
	struct ofgroup *           (*group_alloc)(void); /*   728     8 */
	enum ofperr                (*group_construct)(struct ofgroup *); /*   736     8 */
	void                       (*group_destruct)(struct ofgroup *); /*   744     8 */
	void                       (*group_dealloc)(struct ofgroup *); /*   752     8 */
	void                       (*group_modify)(struct ofgroup *); /*   760     8 */
	/* --- cacheline 12 boundary (768 bytes) --- */
	enum ofperr                (*group_get_stats)(const struct ofgroup  *, struct ofputil_group_stats *); /*   768     8 */
	const char  *              (*get_datapath_version)(const struct ofproto  *); /*   776     8 */
	void                       (*type_set_config)(const char  *, const struct smap  *); /*   784     8 */
	void                       (*ct_flush)(const struct ofproto  *, const uint16_t  *); /*   792     8 */

	/* size: 800, cachelines: 13, members: 100 */
	/* last cacheline: 32 bytes */
};
struct oftable {
	enum oftable_flags         flags;                /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	struct classifier          cls;                  /*     8    96 */

	/* XXX last struct has 3 bytes of padding */

	/* --- cacheline 1 boundary (64 bytes) was 40 bytes ago --- */
	char *                     name;                 /*   104     8 */
	unsigned int               max_flows;            /*   112     4 */
	unsigned int               n_flows;              /*   116     4 */
	struct mf_subfield *       eviction_fields;      /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	size_t                     n_eviction_fields;    /*   128     8 */
	uint32_t                   eviction_group_id_basis; /*   136     4 */

	/* XXX 4 bytes hole, try to pack */

	struct hmap                eviction_groups_by_id; /*   144    32 */
	struct heap                eviction_groups_by_size; /*   176    24 */
	/* --- cacheline 3 boundary (192 bytes) was 8 bytes ago --- */
	enum ofputil_table_miss    miss_config;          /*   200     4 */
	unsigned int               eviction;             /*   204     4 */
	enum ofp14_table_reason    vacancy_event;        /*   208     4 */
	uint8_t                    vacancy_down;         /*   212     1 */
	uint8_t                    vacancy_up;           /*   213     1 */

	/* XXX 2 bytes hole, try to pack */

	atomic_ulong               n_matched;            /*   216     8 */
	atomic_ulong               n_missed;             /*   224     8 */

	/* size: 232, cachelines: 4, members: 17 */
	/* sum members: 222, holes: 3, sum holes: 10 */
	/* paddings: 1, sum paddings: 3 */
	/* last cacheline: 40 bytes */
};
struct ofport {
	struct hmap_node           hmap_node;            /*     0    16 */
	struct ofproto *           ofproto;              /*    16     8 */
	struct netdev *            netdev;               /*    24     8 */
	struct ofputil_phy_port    pp;                   /*    32   116 */
	/* --- cacheline 2 boundary (128 bytes) was 20 bytes ago --- */
	ofp_port_t                 ofp_port;             /*   148     4 */
	uint64_t                   change_seq;           /*   152     8 */
	long long int              created;              /*   160     8 */
	int                        mtu;                  /*   168     4 */

	/* size: 176, cachelines: 3, members: 8 */
	/* padding: 4 */
	/* last cacheline: 48 bytes */
};
struct rule {
	struct ofproto *const      ofproto;              /*     0     8 */
	struct cls_ruleconst       cr;                   /*     8    48 */
	uint8_tconst               table_id;             /*    56     1 */
	enum rule_state            state;                /*    57     1 */

	/* XXX 6 bytes hole, try to pack */

	/* --- cacheline 1 boundary (64 bytes) --- */
	struct ovs_mutex           mutex;                /*    64    48 */
	struct ovs_refcount        ref_count;            /*   112     4 */

	/* XXX 4 bytes hole, try to pack */

	ovs_be64const              flow_cookie;          /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	struct hindex_node         cookie_node;          /*   128    24 */
	enum ofputil_flow_mod_flags flags;               /*   152     4 */
	uint16_t                   hard_timeout;         /*   156     2 */
	uint16_t                   idle_timeout;         /*   158     2 */
	uint16_tconst              importance;           /*   160     2 */
	uint8_t                    removed_reason;       /*   162     1 */

	/* XXX 5 bytes hole, try to pack */

	struct eviction_group *    eviction_group;       /*   168     8 */
	struct heap_node           evg_node;             /*   176    16 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	const struct rule_actions  *const actions;       /*   192     8 */
	struct ovs_list            meter_list_node;      /*   200    16 */
	enum nx_flow_monitor_flags monitor_flags;        /*   216     4 */

	/* XXX 4 bytes hole, try to pack */

	uint64_t                   add_seqno;            /*   224     8 */
	uint64_t                   modify_seqno;         /*   232     8 */
	struct ovs_list            expirable;            /*   240    16 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	long long int              created;              /*   256     8 */
	long long int              modified;             /*   264     8 */
	uint64_t                   match_tlv_bitmap;     /*   272     8 */
	uint64_t                   ofpacts_tlv_bitmap;   /*   280     8 */

	/* size: 288, cachelines: 5, members: 25 */
	/* sum members: 269, holes: 4, sum holes: 19 */
	/* last cacheline: 32 bytes */
};
struct rule_actions {
	_Bool                      has_meter;            /*     0     1 */
	_Bool                      has_learn_with_delete; /*     1     1 */
	_Bool                      has_groups;           /*     2     1 */

	/* XXX 1 byte hole, try to pack */

	uint32_t                   ofpacts_len;          /*     4     4 */
	struct ofpact              ofpacts[0];           /*     8     0 */

	/* size: 8, cachelines: 1, members: 5 */
	/* sum members: 7, holes: 1, sum holes: 1 */
	/* last cacheline: 8 bytes */
};
struct rule_collection {
	struct object_collection   collection;           /*     0    64 */
	/* --- cacheline 1 boundary (64 bytes) --- */

	/* size: 64, cachelines: 1, members: 1 */
};
struct ofgroup {
	struct cmap_node           cmap_node;            /*     0     8 */
	struct versions            versions;             /*     8    16 */
	struct ovs_refcount        ref_count;            /*    24     4 */

	/* XXX 4 bytes hole, try to pack */

	struct ofproto *const      ofproto;              /*    32     8 */
	uint32_tconst              group_id;             /*    40     4 */
	enum ofp11_group_typeconst type;                 /*    44     4 */
	_Bool                      being_deleted;        /*    48     1 */

	/* XXX 7 bytes hole, try to pack */

	long long intconst         created;              /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	long long intconst         modified;             /*    64     8 */
	struct ovs_listconst       buckets;              /*    72    16 */
	uint32_tconst              n_buckets;            /*    88     4 */

	/* XXX 4 bytes hole, try to pack */

	struct ofputil_group_propsconst props;           /*    96    64 */
	/* --- cacheline 2 boundary (128 bytes) was 32 bytes ago --- */
	struct rule_collection     rules;                /*   160    64 */
	/* --- cacheline 3 boundary (192 bytes) was 32 bytes ago --- */

	/* size: 224, cachelines: 4, members: 13 */
	/* sum members: 209, holes: 3, sum holes: 15 */
	/* last cacheline: 32 bytes */
};
struct group_collection {
	struct object_collection   collection;           /*     0    64 */
	/* --- cacheline 1 boundary (64 bytes) --- */

	/* size: 64, cachelines: 1, members: 1 */
};
struct ofproto_packet_out {
	ovs_version_t              version;              /*     0     8 */
	struct dp_packet *         packet;               /*     8     8 */
	struct flow *              flow;                 /*    16     8 */
	struct ofpact *            ofpacts;              /*    24     8 */
	size_t                     ofpacts_len;          /*    32     8 */
	void *                     aux;                  /*    40     8 */

	/* size: 48, cachelines: 1, members: 6 */
	/* last cacheline: 48 bytes */
};
struct rule_criteria {
	uint8_t                    table_id;             /*     0     1 */

	/* XXX 7 bytes hole, try to pack */

	struct cls_rule            cr;                   /*     8    48 */
	ovs_version_t              version;              /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	ovs_be64                   cookie;               /*    64     8 */
	ovs_be64                   cookie_mask;          /*    72     8 */
	ofp_port_t                 out_port;             /*    80     4 */
	uint32_t                   out_group;            /*    84     4 */
	_Bool                      include_hidden;       /*    88     1 */
	_Bool                      include_readonly;     /*    89     1 */

	/* size: 96, cachelines: 2, members: 9 */
	/* sum members: 83, holes: 1, sum holes: 7 */
	/* padding: 6 */
	/* last cacheline: 32 bytes */
};
struct ofproto_flow_mod {
	struct rule *              temp_rule;            /*     0     8 */
	struct rule_criteria       criteria;             /*     8    96 */

	/* XXX last struct has 6 bytes of padding */

	/* --- cacheline 1 boundary (64 bytes) was 40 bytes ago --- */
	struct cls_conjunction *   conjs;                /*   104     8 */
	size_t                     n_conjs;              /*   112     8 */
	uint16_t                   command;              /*   120     2 */
	_Bool                      modify_cookie;        /*   122     1 */
	_Bool                      modify_may_add_flow;  /*   123     1 */
	_Bool                      modify_keep_counts;   /*   124     1 */

	/* XXX 3 bytes hole, try to pack */

	/* --- cacheline 2 boundary (128 bytes) --- */
	enum nx_flow_update_event  event;                /*   128     4 */

	/* XXX 4 bytes hole, try to pack */

	ovs_version_t              version;              /*   136     8 */
	_Bool                      learn_adds_rule;      /*   144     1 */

	/* XXX 7 bytes hole, try to pack */

	struct rule_collection     old_rules;            /*   152    64 */
	/* --- cacheline 3 boundary (192 bytes) was 24 bytes ago --- */
	struct rule_collection     new_rules;            /*   216    64 */
	/* --- cacheline 4 boundary (256 bytes) was 24 bytes ago --- */

	/* size: 280, cachelines: 5, members: 13 */
	/* sum members: 266, holes: 3, sum holes: 14 */
	/* paddings: 1, sum paddings: 6 */
	/* last cacheline: 24 bytes */
};
struct ofproto_port_mod {
	struct ofputil_port_mod    pm;                   /*     0    32 */
	struct ofport *            port;                 /*    32     8 */

	/* size: 40, cachelines: 1, members: 2 */
	/* last cacheline: 40 bytes */
};
struct ofproto_group_mod {
	struct ofputil_group_mod   gm;                   /*     0    96 */
	/* --- cacheline 1 boundary (64 bytes) was 32 bytes ago --- */
	ovs_version_t              version;              /*    96     8 */
	struct ofgroup *           new_group;            /*   104     8 */
	struct group_collection    old_groups;           /*   112    64 */
	/* --- cacheline 2 boundary (128 bytes) was 48 bytes ago --- */

	/* size: 176, cachelines: 3, members: 4 */
	/* last cacheline: 48 bytes */
};
struct ofp_bundle_entry {
	struct ovs_list            node;                 /*     0    16 */
	enum ofptype               type;                 /*    16     4 */

	/* XXX 4 bytes hole, try to pack */

	union {
		struct ofproto_flow_mod ofm;             /*         280 */
		struct ofproto_port_mod opm;             /*          40 */
		struct ofproto_group_mod ogm;            /*         176 */
		struct ofproto_packet_out opo;           /*          48 */
	};                                               /*    24   280 */
	/* --- cacheline 4 boundary (256 bytes) was 48 bytes ago --- */
	union {
		struct ofp_header  ofp_msg;              /*           8 */
		uint8_t            ofp_msg_data[64];     /*          64 */
	};                                               /*   304    64 */
	/* --- cacheline 5 boundary (320 bytes) was 48 bytes ago --- */

	/* size: 368, cachelines: 6, members: 4 */
	/* sum members: 364, holes: 1, sum holes: 4 */
	/* last cacheline: 48 bytes */
};
struct ofp_bundle {
	struct hmap_node           node;                 /*     0    16 */
	long long int              used;                 /*    16     8 */
	uint32_t                   id;                   /*    24     4 */
	uint16_t                   flags;                /*    28     2 */

	/* XXX 2 bytes hole, try to pack */

	enum bundle_state          state;                /*    32     4 */

	/* XXX 4 bytes hole, try to pack */

	struct ovs_list            msg_list;             /*    40    16 */
	union {
		struct ofp_header  ofp_msg;              /*           8 */
		uint8_t            ofp_msg_data[64];     /*          64 */
	};                                               /*    56    64 */
	/* --- cacheline 1 boundary (64 bytes) was 56 bytes ago --- */

	/* size: 120, cachelines: 2, members: 7 */
	/* sum members: 114, holes: 2, sum holes: 6 */
	/* last cacheline: 56 bytes */
};
struct vlog_module {
	struct ovs_list            list;                 /*     0    16 */
	const char  *              name;                 /*    16     8 */
	int                        levels[3];            /*    24    12 */
	int                        min_level;            /*    36     4 */
	_Bool                      honor_rate_limits;    /*    40     1 */

	/* size: 48, cachelines: 1, members: 5 */
	/* padding: 7 */
	/* last cacheline: 48 bytes */
};
struct ovs_key_ct_tuple_ipv4 {
	ovs_be32                   ipv4_src;             /*     0     4 */
	ovs_be32                   ipv4_dst;             /*     4     4 */
	ovs_be16                   src_port;             /*     8     2 */
	ovs_be16                   dst_port;             /*    10     2 */
	uint8_t                    ipv4_proto;           /*    12     1 */

	/* size: 16, cachelines: 1, members: 5 */
	/* padding: 3 */
	/* last cacheline: 16 bytes */
};
struct ovs_key_ct_tuple_ipv6 {
	struct in6_addr            ipv6_src;             /*     0    16 */
	struct in6_addr            ipv6_dst;             /*    16    16 */
	ovs_be16                   src_port;             /*    32     2 */
	ovs_be16                   dst_port;             /*    34     2 */
	uint8_t                    ipv6_proto;           /*    36     1 */

	/* size: 40, cachelines: 1, members: 5 */
	/* padding: 3 */
	/* last cacheline: 40 bytes */
};
struct pkt_metadata {
	union {
		OVS_CACHE_LINE_MARKER cacheline0;        /*           1 */
		struct {
			uint32_t   recirc_id;            /*     0     4 */
			uint32_t   dp_hash;              /*     4     4 */
			uint32_t   skb_priority;         /*     8     4 */
			uint32_t   pkt_mark;             /*    12     4 */
			uint8_t    ct_state;             /*    16     1 */
			_Bool      ct_orig_tuple_ipv6;   /*    17     1 */
			uint16_t   ct_zone;              /*    18     2 */
			uint32_t   ct_mark;              /*    20     4 */
			ovs_u128   ct_label;             /*    24    16 */
			union flow_in_port in_port;      /*    40     4 */
		};                                       /*          48 */
		uint8_t            pad0[64];             /*          64 */
	};                                               /*     0    64 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	union {
		OVS_CACHE_LINE_MARKER cacheline1;        /*           1 */
		struct {
			union {
				struct ovs_key_ct_tuple_ipv4 ipv4; /*          16 */
				struct ovs_key_ct_tuple_ipv6 ipv6; /*          40 */
			} ct_orig_tuple;                 /*    64    40 */
		};                                       /*          40 */
		uint8_t            pad1[64];             /*          64 */
	};                                               /*    64    64 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	union {
		OVS_CACHE_LINE_MARKER cacheline2;        /*           1 */
		struct {
			struct flow_tnl tunnel;          /*   128   344 */
			/* --- cacheline 5 boundary (320 bytes) was 24 bytes ago --- */
		};                                       /*         344 */
		uint8_t            pad2[384];            /*         384 */
	};                                               /*   128   384 */
	/* --- cacheline 8 boundary (512 bytes) --- */

	/* size: 512, cachelines: 8, members: 3 */
};
struct dp_packet {
	void *                     base_;                /*     0     8 */
	uint16_t                   allocated_;           /*     8     2 */
	uint16_t                   data_ofs;             /*    10     2 */
	uint32_t                   size_;                /*    12     4 */
	uint32_t                   rss_hash;             /*    16     4 */
	_Bool                      rss_hash_valid;       /*    20     1 */
	enum dp_packet_source      source;               /*    21     1 */
	uint8_t                    l2_pad_size;          /*    22     1 */

	/* XXX 1 byte hole, try to pack */

	uint16_t                   l2_5_ofs;             /*    24     2 */
	uint16_t                   l3_ofs;               /*    26     2 */
	uint16_t                   l4_ofs;               /*    28     2 */

	/* XXX 2 bytes hole, try to pack */

	uint32_t                   cutlen;               /*    32     4 */
	ovs_be32                   packet_type;          /*    36     4 */
	union {
		struct pkt_metadata md;                  /*         512 */
		uint64_t           data[8];              /*          64 */
	};                                               /*    40   512 */
	/* --- cacheline 8 boundary (512 bytes) was 40 bytes ago --- */

	/* size: 552, cachelines: 9, members: 14 */
	/* sum members: 549, holes: 2, sum holes: 3 */
	/* last cacheline: 40 bytes */
};
struct guarded_list {
	struct ovs_mutex           mutex;                /*     0    48 */
	struct ovs_list            list;                 /*    48    16 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	size_t                     n;                    /*    64     8 */

	/* size: 72, cachelines: 2, members: 3 */
	/* last cacheline: 8 bytes */
};
struct latch {
	int                        fds[2];               /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct lldp_aa_element_system_id {
	struct eth_addr            system_mac;           /*     0     6 */
	uint16_t                   conn_type;            /*     6     2 */
	uint16_t                   rsvd;                 /*     8     2 */
	uint8_t                    rsvd2[2];             /*    10     2 */

	/* size: 12, cachelines: 1, members: 4 */
	/* last cacheline: 12 bytes */
};
struct lldpd_aa_element_tlv {
	uint16_t                   type;                 /*     0     2 */
	uint16_t                   vlan_tagging;         /*     2     2 */
	uint16_t                   auto_prov_mode;       /*     4     2 */
	uint16_t                   mgmt_vlan;            /*     6     2 */
	struct lldp_aa_element_system_id system_id;      /*     8    12 */

	/* size: 20, cachelines: 1, members: 5 */
	/* last cacheline: 20 bytes */
};
struct lldpd_chassis {
	struct ovs_list            list;                 /*     0    16 */
	u_int16_t                  c_refcount;           /*    16     2 */
	u_int16_t                  c_index;              /*    18     2 */
	u_int8_t                   c_protocol;           /*    20     1 */
	u_int8_t                   c_id_subtype;         /*    21     1 */

	/* XXX 2 bytes hole, try to pack */

	uint8_t *                  c_id;                 /*    24     8 */
	int                        c_id_len;             /*    32     4 */

	/* XXX 4 bytes hole, try to pack */

	char *                     c_name;               /*    40     8 */
	char *                     c_descr;              /*    48     8 */
	u_int16_t                  c_cap_available;      /*    56     2 */
	u_int16_t                  c_cap_enabled;        /*    58     2 */
	u_int16_t                  c_ttl;                /*    60     2 */

	/* XXX 2 bytes hole, try to pack */

	/* --- cacheline 1 boundary (64 bytes) --- */
	struct ovs_list            c_mgmt;               /*    64    16 */

	/* size: 80, cachelines: 2, members: 13 */
	/* sum members: 72, holes: 3, sum holes: 8 */
	/* last cacheline: 16 bytes */
};
struct lldpd_port {
	struct ovs_list            p_entries;            /*     0    16 */
	struct lldpd_chassis *     p_chassis;            /*    16     8 */
	time_t                     p_lastchange;         /*    24     8 */
	time_t                     p_lastupdate;         /*    32     8 */
	struct lldpd_frame *       p_lastframe;          /*    40     8 */
	u_int8_t                   p_protocol;           /*    48     1 */
	u_int8_t                   p_hidden_in:1;        /*    49: 7  1 */
	u_int8_t                   p_hidden_out:1;       /*    49: 6  1 */

	/* XXX 6 bits hole, try to pack */

	u_int8_t                   p_id_subtype;         /*    50     1 */

	/* XXX 5 bytes hole, try to pack */

	char *                     p_id;                 /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	int                        p_id_len;             /*    64     4 */

	/* XXX 4 bytes hole, try to pack */

	char *                     p_descr;              /*    72     8 */
	u_int16_t                  p_mfs;                /*    80     2 */
	struct lldpd_aa_element_tlv p_element;           /*    82    20 */

	/* XXX 2 bytes hole, try to pack */

	struct ovs_list            p_isid_vlan_maps;     /*   104    16 */

	/* size: 120, cachelines: 2, members: 15 */
	/* sum members: 109, holes: 3, sum holes: 11 */
	/* bit holes: 1, sum bit holes: 6 bits */
	/* last cacheline: 56 bytes */
};
struct lldpd_frame {
	int                        size;                 /*     0     4 */
	unsigned char              frame[0];             /*     4     0 */

	/* size: 4, cachelines: 1, members: 2 */
	/* last cacheline: 4 bytes */
};
struct lldpd_config {
	int                        c_paused;             /*     0     4 */
	int                        c_tx_interval;        /*     4     4 */
	int                        c_smart;              /*     8     4 */
	int                        c_receiveonly;        /*    12     4 */
	int                        c_max_neighbors;      /*    16     4 */

	/* XXX 4 bytes hole, try to pack */

	char *                     c_mgmt_pattern;       /*    24     8 */
	char *                     c_cid_pattern;        /*    32     8 */
	char *                     c_iface_pattern;      /*    40     8 */
	char *                     c_platform;           /*    48     8 */
	char *                     c_description;        /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	char *                     c_hostname;           /*    64     8 */
	int                        c_advertise_version;  /*    72     4 */
	int                        c_set_ifdescr;        /*    76     4 */
	int                        c_promisc;            /*    80     4 */
	int                        c_tx_hold;            /*    84     4 */
	int                        c_bond_slave_src_mac_type; /*    88     4 */
	int                        c_lldp_portid_type;   /*    92     4 */

	/* size: 96, cachelines: 2, members: 17 */
	/* sum members: 92, holes: 1, sum holes: 4 */
	/* last cacheline: 32 bytes */
};
struct lldpd_ops {
	int                        (*send)(struct lldpd *, struct lldpd_hardware *, char *, size_t); /*     0     8 */
	int                        (*recv)(struct lldpd *, struct lldpd_hardware *, int, char *, size_t); /*     8     8 */
	int                        (*cleanup)(struct lldpd *, struct lldpd_hardware *); /*    16     8 */

	/* size: 24, cachelines: 1, members: 3 */
	/* last cacheline: 24 bytes */
};
struct lldpd {
	struct lldpd_config        g_config;             /*     0    96 */
	/* --- cacheline 1 boundary (64 bytes) was 32 bytes ago --- */
	struct protocol *          g_protocols;          /*    96     8 */
	int                        g_lastrid;            /*   104     4 */

	/* XXX 4 bytes hole, try to pack */

	struct ovs_list            g_chassis;            /*   112    16 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	struct ovs_list            g_hardware;           /*   128    16 */

	/* size: 144, cachelines: 3, members: 5 */
	/* sum members: 140, holes: 1, sum holes: 4 */
	/* last cacheline: 16 bytes */
};
struct lldpd_hardware {
	struct ovs_list            h_entries;            /*     0    16 */
	struct lldpd *             h_cfg;                /*    16     8 */
	void *                     h_recv;               /*    24     8 */
	int                        h_sendfd;             /*    32     4 */
	int                        h_mangle;             /*    36     4 */
	struct lldpd_ops *         h_ops;                /*    40     8 */
	void *                     h_data;               /*    48     8 */
	void *                     h_timer;              /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	int                        h_mtu;                /*    64     4 */
	int                        h_flags;              /*    68     4 */
	int                        h_ifindex;            /*    72     4 */
	char                       h_ifname[16];         /*    76    16 */
	struct eth_addr            h_lladdr;             /*    92     6 */

	/* XXX 6 bytes hole, try to pack */

	u_int64_t                  h_tx_cnt;             /*   104     8 */
	u_int64_t                  h_rx_cnt;             /*   112     8 */
	u_int64_t                  h_rx_discarded_cnt;   /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	u_int64_t                  h_rx_unrecognized_cnt; /*   128     8 */
	u_int64_t                  h_ageout_cnt;         /*   136     8 */
	u_int64_t                  h_insert_cnt;         /*   144     8 */
	u_int64_t                  h_delete_cnt;         /*   152     8 */
	u_int64_t                  h_drop_cnt;           /*   160     8 */
	u_int16_t                  h_lport_cksum;        /*   168     2 */

	/* XXX 6 bytes hole, try to pack */

	struct lldpd_port          h_lport;              /*   176   120 */
	/* --- cacheline 4 boundary (256 bytes) was 40 bytes ago --- */
	struct ovs_list            h_rports;             /*   296    16 */

	/* size: 312, cachelines: 5, members: 24 */
	/* sum members: 300, holes: 2, sum holes: 12 */
	/* last cacheline: 56 bytes */
};
struct protocol {
	int                        mode;                 /*     0     4 */
	int                        enabled;              /*     4     4 */
	char *                     name;                 /*     8     8 */
	char                       arg;                  /*    16     1 */

	/* XXX 7 bytes hole, try to pack */

	int                        (*send)(struct lldpd *, struct lldpd_hardware *, struct dp_packet *); /*    24     8 */
	int                        (*decode)(struct lldpd *, char *, int, struct lldpd_hardware *, struct lldpd_chassis * *, struct lldpd_port * *); /*    32     8 */
	int                        (*guess)(char *, int); /*    40     8 */
	struct eth_addr            mac;                  /*    48     6 */

	/* size: 56, cachelines: 1, members: 8 */
	/* sum members: 47, holes: 1, sum holes: 7 */
	/* padding: 2 */
	/* last cacheline: 56 bytes */
};
struct timer {
	long long int              t;                    /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct lldp {
	struct hmap_node           hmap_node;            /*     0    16 */
	struct lldpd *             lldpd;                /*    16     8 */
	char *                     name;                 /*    24     8 */
	struct timer               tx_timer;             /*    32     8 */
	struct hmap                mappings_by_isid;     /*    40    32 */
	/* --- cacheline 1 boundary (64 bytes) was 8 bytes ago --- */
	struct hmap                mappings_by_aux;      /*    72    32 */
	struct ovs_list            active_mapping_queue; /*   104    16 */
	struct ovs_refcount        ref_cnt;              /*   120     4 */
	_Bool                      enabled;              /*   124     1 */

	/* size: 128, cachelines: 2, members: 9 */
	/* padding: 3 */
};
struct mport {
	struct hmap_node           hmap_node;            /*     0    16 */
	struct heap_node           heap_node;            /*    16    16 */
	const struct ofport_dpif  * ofport;              /*    32     8 */
	struct cfm *               cfm;                  /*    40     8 */
	struct bfd *               bfd;                  /*    48     8 */
	struct lldp *              lldp;                 /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	struct eth_addr            hw_addr;              /*    64     6 */

	/* size: 72, cachelines: 2, members: 7 */
	/* padding: 2 */
	/* last cacheline: 8 bytes */
};
struct send_soon_entry {
	struct ovs_list            list_node;            /*     0    16 */
	const struct ofport_dpif  * ofport;              /*    16     8 */

	/* size: 24, cachelines: 1, members: 2 */
	/* last cacheline: 24 bytes */
};
struct ovs_action_push_tnl {
	odp_port_t                 tnl_port;             /*     0     4 */
	odp_port_t                 out_port;             /*     4     4 */
	uint32_t                   header_len;           /*     8     4 */
	uint32_t                   tnl_type;             /*    12     4 */
	uint32_t                   header[128];          /*    16   512 */
	/* --- cacheline 8 boundary (512 bytes) was 16 bytes ago --- */

	/* size: 528, cachelines: 9, members: 5 */
	/* last cacheline: 16 bytes */
};
struct ds {
	char *                     string;               /*     0     8 */
	size_t                     length;               /*     8     8 */
	size_t                     allocated;            /*    16     8 */

	/* size: 24, cachelines: 1, members: 3 */
	/* last cacheline: 24 bytes */
};
struct netdev_tunnel_config {
	ovs_be64                   in_key;               /*     0     8 */
	_Bool                      in_key_present;       /*     8     1 */
	_Bool                      in_key_flow;          /*     9     1 */
	_Bool                      out_key_present;      /*    10     1 */
	_Bool                      out_key_flow;         /*    11     1 */

	/* XXX 4 bytes hole, try to pack */

	ovs_be64                   out_key;              /*    16     8 */
	ovs_be16                   dst_port;             /*    24     2 */
	_Bool                      ip_src_flow;          /*    26     1 */
	_Bool                      ip_dst_flow;          /*    27     1 */
	struct in6_addr            ipv6_src;             /*    28    16 */
	struct in6_addr            ipv6_dst;             /*    44    16 */
	uint32_t                   exts;                 /*    60     4 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	uint32_t                   egress_pkt_mark;      /*    64     4 */
	_Bool                      set_egress_pkt_mark;  /*    68     1 */
	uint8_t                    ttl;                  /*    69     1 */
	_Bool                      ttl_inherit;          /*    70     1 */
	uint8_t                    tos;                  /*    71     1 */
	_Bool                      tos_inherit;          /*    72     1 */
	_Bool                      csum;                 /*    73     1 */
	_Bool                      dont_fragment;        /*    74     1 */

	/* XXX 1 byte hole, try to pack */

	enum netdev_pt_mode        pt_mode;              /*    76     4 */
	ovs_be32                   erspan_idx;           /*    80     4 */
	uint8_t                    erspan_ver;           /*    84     1 */
	uint8_t                    erspan_dir;           /*    85     1 */
	uint8_t                    erspan_hwid;          /*    86     1 */

	/* size: 88, cachelines: 2, members: 25 */
	/* sum members: 82, holes: 2, sum holes: 5 */
	/* padding: 1 */
	/* last cacheline: 24 bytes */
};
struct netdev_tnl_build_header_params {
	const struct flow  *       flow;                 /*     0     8 */
	const struct in6_addr  *   s_ip;                 /*     8     8 */
	struct eth_addr            dmac;                 /*    16     6 */
	struct eth_addr            smac;                 /*    22     6 */
	_Bool                      is_ipv6;              /*    28     1 */

	/* size: 32, cachelines: 1, members: 5 */
	/* padding: 3 */
	/* last cacheline: 32 bytes */
};
struct ovsthread_once {
	_Bool                      done;                 /*     0     1 */

	/* XXX 7 bytes hole, try to pack */

	struct ovs_mutex           mutex;                /*     8    48 */

	/* size: 56, cachelines: 1, members: 2 */
	/* sum members: 49, holes: 1, sum holes: 7 */
	/* last cacheline: 56 bytes */
};
struct fat_rwlock {
	ovsthread_key_t            key;                  /*     0     8 */
	struct ovs_list            threads;              /*     8    16 */
	struct ovs_mutex           mutex;                /*    24    48 */
	/* --- cacheline 1 boundary (64 bytes) was 8 bytes ago --- */

	/* size: 72, cachelines: 2, members: 3 */
	/* last cacheline: 8 bytes */
};
struct token_bucket {
	unsigned int               rate;                 /*     0     4 */
	unsigned int               burst;                /*     4     4 */
	unsigned int               tokens;               /*     8     4 */

	/* XXX 4 bytes hole, try to pack */

	long long int              last_fill;            /*    16     8 */

	/* size: 24, cachelines: 1, members: 4 */
	/* sum members: 20, holes: 1, sum holes: 4 */
	/* last cacheline: 24 bytes */
};
struct vlog_rate_limit {
	struct token_bucket        token_bucket;         /*     0    24 */
	time_t                     first_dropped;        /*    24     8 */
	time_t                     last_dropped;         /*    32     8 */
	unsigned int               n_dropped;            /*    40     4 */

	/* XXX 4 bytes hole, try to pack */

	struct ovs_mutex           mutex;                /*    48    48 */
	/* --- cacheline 1 boundary (64 bytes) was 32 bytes ago --- */

	/* size: 96, cachelines: 2, members: 5 */
	/* sum members: 92, holes: 1, sum holes: 4 */
	/* last cacheline: 32 bytes */
};
struct tnl_match {
	ovs_be64                   in_key;               /*     0     8 */
	struct in6_addr            ipv6_src;             /*     8    16 */
	struct in6_addr            ipv6_dst;             /*    24    16 */
	odp_port_t                 odp_port;             /*    40     4 */
	_Bool                      in_key_flow;          /*    44     1 */
	_Bool                      ip_src_flow;          /*    45     1 */
	_Bool                      ip_dst_flow;          /*    46     1 */

	/* XXX 1 byte hole, try to pack */

	enum netdev_pt_mode        pt_mode;              /*    48     4 */

	/* size: 56, cachelines: 1, members: 8 */
	/* sum members: 51, holes: 1, sum holes: 1 */
	/* padding: 4 */
	/* last cacheline: 56 bytes */
};
struct tnl_port {
	struct hmap_node           ofport_node;          /*     0    16 */
	struct hmap_node           match_node;           /*    16    16 */
	const struct ofport_dpif  * ofport;              /*    32     8 */
	uint64_t                   change_seq;           /*    40     8 */
	struct netdev *            netdev;               /*    48     8 */
	struct tnl_match           match;                /*    56    56 */

	/* XXX last struct has 4 bytes of padding */

	/* --- cacheline 1 boundary (64 bytes) was 48 bytes ago --- */

	/* size: 112, cachelines: 2, members: 6 */
	/* paddings: 1, sum paddings: 4 */
	/* last cacheline: 48 bytes */
};
struct sset_node {
	struct hmap_node           hmap_node;            /*     0    16 */
	char                       name[1];              /*    16     1 */

	/* size: 24, cachelines: 1, members: 2 */
	/* padding: 7 */
	/* last cacheline: 24 bytes */
};
struct collectors {
	int *                      fds;                  /*     0     8 */
	size_t                     n_fds;                /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct sockaddr_storage {
	sa_family_t                ss_family;            /*     0     2 */
	char                       __ss_padding[118];    /*     2   118 */
	/* --- cacheline 1 boundary (64 bytes) was 56 bytes ago --- */
	long unsigned int          __ss_align;           /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */

	/* size: 128, cachelines: 2, members: 3 */
};
struct sockaddr_in {
	sa_family_t                sin_family;           /*     0     2 */
	in_port_t                  sin_port;             /*     2     2 */
	struct in_addr             sin_addr;             /*     4     4 */
	unsigned char              sin_zero[8];          /*     8     8 */

	/* size: 16, cachelines: 1, members: 4 */
	/* last cacheline: 16 bytes */
};
struct in_addr {
	in_addr_t                  s_addr;               /*     0     4 */

	/* size: 4, cachelines: 1, members: 1 */
	/* last cacheline: 4 bytes */
};
struct ofpbuf {
	void *                     base;                 /*     0     8 */
	void *                     data;                 /*     8     8 */
	uint32_t                   size;                 /*    16     4 */
	uint32_t                   allocated;            /*    20     4 */
	void *                     header;               /*    24     8 */
	void *                     msg;                  /*    32     8 */
	struct ovs_list            list_node;            /*    40    16 */
	enum ofpbuf_source         source;               /*    56     1 */

	/* size: 64, cachelines: 1, members: 8 */
	/* padding: 7 */
};
struct ofputil_flow_removed {
	struct match               match;                /*     0  3400 */
	/* --- cacheline 53 boundary (3392 bytes) was 8 bytes ago --- */
	ovs_be64                   cookie;               /*  3400     8 */
	uint16_t                   priority;             /*  3408     2 */
	uint8_t                    reason;               /*  3410     1 */
	uint8_t                    table_id;             /*  3411     1 */
	uint32_t                   duration_sec;         /*  3412     4 */
	uint32_t                   duration_nsec;        /*  3416     4 */
	uint16_t                   idle_timeout;         /*  3420     2 */
	uint16_t                   hard_timeout;         /*  3422     2 */
	uint64_t                   packet_count;         /*  3424     8 */
	uint64_t                   byte_count;           /*  3432     8 */

	/* size: 3440, cachelines: 54, members: 11 */
	/* last cacheline: 48 bytes */
};
struct ofputil_port_status {
	enum ofp_port_reason       reason;               /*     0     4 */
	struct ofputil_phy_port    desc;                 /*     4   116 */
	/* --- cacheline 1 boundary (64 bytes) was 56 bytes ago --- */

	/* size: 120, cachelines: 2, members: 2 */
	/* last cacheline: 56 bytes */
};
struct ofputil_table_mod_prop_vacancy {
	uint8_t                    vacancy_down;         /*     0     1 */
	uint8_t                    vacancy_up;           /*     1     1 */
	uint8_t                    vacancy;              /*     2     1 */

	/* size: 3, cachelines: 1, members: 3 */
	/* last cacheline: 3 bytes */
};
struct ofputil_table_desc {
	uint8_t                    table_id;             /*     0     1 */

	/* XXX 3 bytes hole, try to pack */

	enum ofputil_table_eviction eviction;            /*     4     4 */
	uint32_t                   eviction_flags;       /*     8     4 */
	enum ofputil_table_vacancy vacancy;              /*    12     4 */
	struct ofputil_table_mod_prop_vacancy table_vacancy; /*    16     3 */

	/* size: 20, cachelines: 1, members: 5 */
	/* sum members: 16, holes: 1, sum holes: 3 */
	/* padding: 1 */
	/* last cacheline: 20 bytes */
};
struct ofputil_meter_mod {
	uint16_t                   command;              /*     0     2 */

	/* XXX 6 bytes hole, try to pack */

	struct ofputil_meter_config meter;               /*     8    16 */

	/* size: 24, cachelines: 1, members: 2 */
	/* sum members: 18, holes: 1, sum holes: 6 */
	/* last cacheline: 24 bytes */
};
struct ofputil_role_status {
	enum ofp12_controller_role role;                 /*     0     4 */
	enum ofp14_controller_role_reason reason;        /*     4     4 */
	uint64_t                   generation_id;        /*     8     8 */

	/* size: 16, cachelines: 1, members: 3 */
	/* last cacheline: 16 bytes */
};
struct ofputil_flow_monitor_request {
	uint32_t                   id;                   /*     0     4 */
	enum nx_flow_monitor_flags flags;                /*     4     4 */
	ofp_port_t                 out_port;             /*     8     4 */
	uint8_t                    table_id;             /*    12     1 */

	/* XXX 3 bytes hole, try to pack */

	struct match               match;                /*    16  3400 */
	/* --- cacheline 53 boundary (3392 bytes) was 24 bytes ago --- */

	/* size: 3416, cachelines: 54, members: 5 */
	/* sum members: 3413, holes: 1, sum holes: 3 */
	/* last cacheline: 24 bytes */
};
struct ofputil_flow_update {
	enum nx_flow_update_event  event;                /*     0     4 */
	enum ofp_flow_removed_reason reason;             /*     4     4 */
	uint16_t                   idle_timeout;         /*     8     2 */
	uint16_t                   hard_timeout;         /*    10     2 */
	uint8_t                    table_id;             /*    12     1 */

	/* XXX 1 byte hole, try to pack */

	uint16_t                   priority;             /*    14     2 */
	ovs_be64                   cookie;               /*    16     8 */
	struct match               match;                /*    24  3400 */
	/* --- cacheline 53 boundary (3392 bytes) was 32 bytes ago --- */
	const struct ofpact  *     ofpacts;              /*  3424     8 */
	size_t                     ofpacts_len;          /*  3432     8 */
	ovs_be32                   xid;                  /*  3440     4 */

	/* size: 3448, cachelines: 54, members: 11 */
	/* sum members: 3443, holes: 1, sum holes: 1 */
	/* padding: 4 */
	/* last cacheline: 56 bytes */
};
struct ofputil_async_cfg {
	uint32_t                   master[6];            /*     0    24 */
	uint32_t                   slave[6];             /*    24    24 */

	/* size: 48, cachelines: 1, members: 2 */
	/* last cacheline: 48 bytes */
};
struct ofputil_requestforward {
	ovs_be32                   xid;                  /*     0     4 */
	enum ofp14_requestforward_reason reason;         /*     4     4 */
	union {
		struct {
			struct ofputil_meter_mod * meter_mod; /*     8     8 */
			struct ofpbuf bands;             /*    16    64 */

			/* XXX last struct has 7 bytes of padding */

			/* --- cacheline 1 boundary (64 bytes) was 8 bytes ago --- */
		};                                       /*          72 */
		struct ofputil_group_mod * group_mod;    /*           8 */
	};                                               /*     8    72 */
	/* --- cacheline 1 boundary (64 bytes) was 16 bytes ago --- */

	/* size: 80, cachelines: 2, members: 3 */
	/* last cacheline: 16 bytes */
};
struct ofputil_table_status {
	enum ofp14_table_reason    reason;               /*     0     4 */
	struct ofputil_table_desc  desc;                 /*     4    20 */

	/* XXX last struct has 1 byte of padding */

	/* size: 24, cachelines: 1, members: 2 */
	/* paddings: 1, sum paddings: 1 */
	/* last cacheline: 24 bytes */
};
struct ofproto_controller_info {
	_Bool                      is_connected;         /*     0     1 */

	/* XXX 3 bytes hole, try to pack */

	enum ofp12_controller_role role;                 /*     4     4 */
	struct smap                pairs;                /*     8    32 */

	/* size: 40, cachelines: 1, members: 3 */
	/* sum members: 37, holes: 1, sum holes: 3 */
	/* last cacheline: 40 bytes */
};
struct ofproto_controller {
	char *                     target;               /*     0     8 */
	int                        max_backoff;          /*     8     4 */
	int                        probe_interval;       /*    12     4 */
	enum ofproto_band          band;                 /*    16     4 */
	_Bool                      enable_async_msgs;    /*    20     1 */

	/* XXX 3 bytes hole, try to pack */

	int                        rate_limit;           /*    24     4 */
	int                        burst_limit;          /*    28     4 */
	uint8_t                    dscp;                 /*    32     1 */

	/* size: 40, cachelines: 1, members: 8 */
	/* sum members: 30, holes: 1, sum holes: 3 */
	/* padding: 7 */
	/* last cacheline: 40 bytes */
};
struct ofpact_output {
	struct ofpact              ofpact;               /*     0     4 */
	ofp_port_t                 port;                 /*     4     4 */
	uint16_t                   max_len;              /*     8     2 */

	/* size: 12, cachelines: 1, members: 3 */
	/* padding: 2 */
	/* last cacheline: 12 bytes */
};
struct shash_node {
	struct hmap_node           node;                 /*     0    16 */
	char *                     name;                 /*    16     8 */
	void *                     data;                 /*    24     8 */

	/* size: 32, cachelines: 1, members: 3 */
	/* last cacheline: 32 bytes */
};
struct connmgr {
	struct ofproto *           ofproto;              /*     0     8 */
	char *                     name;                 /*     8     8 */
	char *                     local_port_name;      /*    16     8 */
	struct hmap                controllers;          /*    24    32 */
	struct ovs_list            all_conns;            /*    56    16 */
	/* --- cacheline 1 boundary (64 bytes) was 8 bytes ago --- */
	uint64_t                   master_election_id;   /*    72     8 */
	_Bool                      master_election_id_defined; /*    80     1 */

	/* XXX 7 bytes hole, try to pack */

	struct hmap                services;             /*    88    32 */
	struct pvconn * *          snoops;               /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	size_t                     n_snoops;             /*   128     8 */
	struct fail_open *         fail_open;            /*   136     8 */
	enum ofproto_fail_mode     fail_mode;            /*   144     4 */

	/* XXX 4 bytes hole, try to pack */

	struct in_band *           in_band;              /*   152     8 */
	struct sockaddr_in *       extra_in_band_remotes; /*   160     8 */
	size_t                     n_extra_remotes;      /*   168     8 */
	int                        in_band_queue;        /*   176     4 */
	int                        want_packet_in_on_miss; /*   180     4 */

	/* size: 184, cachelines: 3, members: 17 */
	/* sum members: 173, holes: 2, sum holes: 11 */
	/* last cacheline: 56 bytes */
};
struct ofproto_async_msg {
	struct ovs_list            list_node;            /*     0    16 */
	uint16_t                   controller_id;        /*    16     2 */

	/* XXX 2 bytes hole, try to pack */

	enum ofputil_async_msg_type oam;                 /*    20     4 */
	struct {
		struct ofputil_packet_in_private up;     /*    24  3520 */
		/* --- cacheline 55 boundary (3520 bytes) --- */
		int                max_len;              /*  3544     4 */
	} pin;                                           /*    24  3528 */
	/* --- cacheline 55 boundary (3520 bytes) was 32 bytes ago --- */

	/* size: 3552, cachelines: 56, members: 4 */
	/* sum members: 3550, holes: 1, sum holes: 2 */
	/* last cacheline: 32 bytes */
};
struct ofmonitor {
	struct ofconn *            ofconn;               /*     0     8 */
	struct hmap_node           ofconn_node;          /*     8    16 */
	uint32_t                   id;                   /*    24     4 */
	enum nx_flow_monitor_flags flags;                /*    28     4 */
	ofp_port_t                 out_port;             /*    32     4 */
	uint8_t                    table_id;             /*    36     1 */

	/* XXX 3 bytes hole, try to pack */

	struct minimatch           match;                /*    40    16 */

	/* size: 56, cachelines: 1, members: 7 */
	/* sum members: 53, holes: 1, sum holes: 3 */
	/* last cacheline: 56 bytes */
};
struct ofconn {
	struct ovs_list            node;                 /*     0    16 */
	struct hmap_node           hmap_node;            /*    16    16 */
	struct connmgr *           connmgr;              /*    32     8 */
	struct rconn *             rconn;                /*    40     8 */
	enum ofconn_type           type;                 /*    48     4 */
	enum ofproto_band          band;                 /*    52     4 */
	_Bool                      enable_async_msgs;    /*    56     1 */
	_Bool                      want_packet_in_on_miss; /*    57     1 */

	/* XXX 2 bytes hole, try to pack */

	enum ofp12_controller_role role;                 /*    60     4 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	enum ofputil_protocol      protocol;             /*    64     4 */
	enum nx_packet_in_format   packet_in_format;     /*    68     4 */
	struct rconn_packet_counter * packet_in_counter; /*    72     8 */
	struct pinsched *          schedulers[2];        /*    80    16 */
	int                        miss_send_len;        /*    96     4 */
	uint16_t                   controller_id;        /*   100     2 */

	/* XXX 2 bytes hole, try to pack */

	struct rconn_packet_counter * reply_counter;     /*   104     8 */
	struct ofputil_async_cfg * async_cfg;            /*   112     8 */
	int                        n_add;                /*   120     4 */
	int                        n_delete;             /*   124     4 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	int                        n_modify;             /*   128     4 */

	/* XXX 4 bytes hole, try to pack */

	long long int              first_op;             /*   136     8 */
	long long int              last_op;              /*   144     8 */
	long long int              next_op_report;       /*   152     8 */
	long long int              op_backoff;           /*   160     8 */
	struct hmap                monitors;             /*   168    32 */
	/* --- cacheline 3 boundary (192 bytes) was 8 bytes ago --- */
	uint64_t                   monitor_paused;       /*   200     8 */
	struct rconn_packet_counter * monitor_counter;   /*   208     8 */
	struct ovs_list            updates;              /*   216    16 */
	_Bool                      sent_abbrev_update;   /*   232     1 */

	/* XXX 7 bytes hole, try to pack */

	struct hmap                bundles;              /*   240    32 */
	/* --- cacheline 4 boundary (256 bytes) was 16 bytes ago --- */
	long long int              next_bundle_expiry_check; /*   272     8 */

	/* size: 280, cachelines: 5, members: 31 */
	/* sum members: 265, holes: 4, sum holes: 15 */
	/* last cacheline: 24 bytes */
};
struct coverage_counter {
	const char  *const         name;                 /*     0     8 */
	unsigned int ()(void) *const count;              /*     8     8 */
	long long unsigned int     total;                /*    16     8 */
	long long unsigned int     last_total;           /*    24     8 */
	unsigned int               min[12];              /*    32    48 */
	/* --- cacheline 1 boundary (64 bytes) was 16 bytes ago --- */
	unsigned int               hr[60];               /*    80   240 */
	/* --- cacheline 5 boundary (320 bytes) --- */

	/* size: 320, cachelines: 5, members: 6 */
};
struct pinsched_stats {
	unsigned int               n_queued;             /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	long long unsigned int     n_normal;             /*     8     8 */
	long long unsigned int     n_limited;            /*    16     8 */
	long long unsigned int     n_queue_dropped;      /*    24     8 */

	/* size: 32, cachelines: 1, members: 4 */
	/* sum members: 28, holes: 1, sum holes: 4 */
	/* last cacheline: 32 bytes */
};
struct ofservice {
	struct hmap_node           node;                 /*     0    16 */
	struct pvconn *            pvconn;               /*    16     8 */
	int                        probe_interval;       /*    24     4 */
	int                        rate_limit;           /*    28     4 */
	int                        burst_limit;          /*    32     4 */
	_Bool                      enable_async_msgs;    /*    36     1 */
	uint8_t                    dscp;                 /*    37     1 */

	/* XXX 2 bytes hole, try to pack */

	uint32_t                   allowed_versions;     /*    40     4 */

	/* size: 48, cachelines: 1, members: 8 */
	/* sum members: 42, holes: 1, sum holes: 2 */
	/* padding: 4 */
	/* last cacheline: 48 bytes */
};
struct atomic_count {
	atomic_uint                count;                /*     0     4 */

	/* size: 4, cachelines: 1, members: 1 */
	/* last cacheline: 4 bytes */
};
struct ovs_rwlock {
	pthread_rwlock_t           lock;                 /*     0    56 */
	const char  *              where;                /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */

	/* size: 64, cachelines: 1, members: 2 */
};
struct bond_settings {
	char *                     name;                 /*     0     8 */
	uint32_t                   basis;                /*     8     4 */
	enum bond_mode             balance;              /*    12     4 */
	int                        rebalance_interval;   /*    16     4 */
	int                        up_delay;             /*    20     4 */
	int                        down_delay;           /*    24     4 */
	_Bool                      lacp_fallback_ab_cfg; /*    28     1 */

	/* XXX 1 byte hole, try to pack */

	struct eth_addr            active_slave_mac;     /*    30     6 */

	/* size: 40, cachelines: 1, members: 8 */
	/* sum members: 35, holes: 1, sum holes: 1 */
	/* padding: 4 */
	/* last cacheline: 40 bytes */
};
struct odp_support {
	size_t                     max_vlan_headers;     /*     0     8 */
	size_t                     max_mpls_depth;       /*     8     8 */
	_Bool                      recirc;               /*    16     1 */
	_Bool                      ct_state;             /*    17     1 */
	_Bool                      ct_zone;              /*    18     1 */
	_Bool                      ct_mark;              /*    19     1 */
	_Bool                      ct_label;             /*    20     1 */
	_Bool                      ct_state_nat;         /*    21     1 */
	_Bool                      ct_orig_tuple;        /*    22     1 */
	_Bool                      ct_orig_tuple6;       /*    23     1 */

	/* size: 24, cachelines: 1, members: 10 */
	/* last cacheline: 24 bytes */
};
struct dpif_flow_stats {
	uint64_t                   n_packets;            /*     0     8 */
	uint64_t                   n_bytes;              /*     8     8 */
	long long int              used;                 /*    16     8 */
	uint16_t                   tcp_flags;            /*    24     2 */

	/* size: 32, cachelines: 1, members: 4 */
	/* padding: 6 */
	/* last cacheline: 32 bytes */
};
struct rule_dpif {
	struct rule                up;                   /*     0   288 */
	/* --- cacheline 4 boundary (256 bytes) was 32 bytes ago --- */
	struct ovs_mutex           stats_mutex;          /*   288    48 */
	/* --- cacheline 5 boundary (320 bytes) was 16 bytes ago --- */
	struct dpif_flow_stats     stats;                /*   336    32 */

	/* XXX last struct has 6 bytes of padding */

	struct rule_dpif *         new_rule;             /*   368     8 */
	_Bool                      forward_counts;       /*   376     1 */

	/* XXX 3 bytes hole, try to pack */

	uint32_t                   recirc_id;            /*   380     4 */
	/* --- cacheline 6 boundary (384 bytes) --- */

	/* size: 384, cachelines: 6, members: 6 */
	/* sum members: 381, holes: 1, sum holes: 3 */
	/* paddings: 1, sum paddings: 6 */
};
struct dpif_backer_support {
	_Bool                      variable_length_userdata; /*     0     1 */
	_Bool                      masked_set_action;    /*     1     1 */
	_Bool                      tnl_push_pop;         /*     2     1 */
	_Bool                      ufid;                 /*     3     1 */
	_Bool                      trunc;                /*     4     1 */
	_Bool                      clone;                /*     5     1 */

	/* XXX 2 bytes hole, try to pack */

	size_t                     sample_nesting;       /*     8     8 */
	_Bool                      ct_eventmask;         /*    16     1 */

	/* XXX 7 bytes hole, try to pack */

	struct odp_support         odp;                  /*    24    24 */

	/* size: 48, cachelines: 1, members: 9 */
	/* sum members: 39, holes: 2, sum holes: 9 */
	/* last cacheline: 48 bytes */
};
struct dpif_backer {
	char *                     type;                 /*     0     8 */
	int                        refcount;             /*     8     4 */

	/* XXX 4 bytes hole, try to pack */

	struct dpif *              dpif;                 /*    16     8 */
	struct udpif *             udpif;                /*    24     8 */
	struct ovs_rwlock          odp_to_ofport_lock;   /*    32    64 */
	/* --- cacheline 1 boundary (64 bytes) was 32 bytes ago --- */
	struct hmap                odp_to_ofport_map;    /*    96    32 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	struct simap               tnl_backers;          /*   128    32 */
	enum revalidate_reason     need_revalidate;      /*   160     4 */
	_Bool                      recv_set_enable;      /*   164     1 */

	/* XXX 3 bytes hole, try to pack */

	struct id_pool *           meter_ids;            /*   168     8 */
	char *                     dp_version_string;    /*   176     8 */
	struct dpif_backer_support bt_support;           /*   184    48 */
	/* --- cacheline 3 boundary (192 bytes) was 40 bytes ago --- */
	struct dpif_backer_support rt_support;           /*   232    48 */
	/* --- cacheline 4 boundary (256 bytes) was 24 bytes ago --- */
	struct atomic_count        tnl_count;            /*   280     4 */

	/* size: 288, cachelines: 5, members: 14 */
	/* sum members: 277, holes: 2, sum holes: 7 */
	/* padding: 4 */
	/* last cacheline: 32 bytes */
};
struct ofproto_dpif {
	struct hmap_node           all_ofproto_dpifs_node; /*     0    16 */
	struct ofproto             up;                   /*    16   584 */
	/* --- cacheline 9 boundary (576 bytes) was 24 bytes ago --- */
	struct dpif_backer *       backer;               /*   600     8 */
	struct uuid                uuid;                 /*   608    16 */
	ovs_version_t              tables_version;       /*   624     8 */
	uint64_t                   dump_seq;             /*   632     8 */
	/* --- cacheline 10 boundary (640 bytes) --- */
	struct rule_dpif *         miss_rule;            /*   640     8 */
	struct rule_dpif *         no_packet_in_rule;    /*   648     8 */
	struct rule_dpif *         drop_frags_rule;      /*   656     8 */
	struct netflow *           netflow;              /*   664     8 */
	struct dpif_sflow *        sflow;                /*   672     8 */
	struct dpif_ipfix *        ipfix;                /*   680     8 */
	struct hmap                bundles;              /*   688    32 */
	/* --- cacheline 11 boundary (704 bytes) was 16 bytes ago --- */
	struct mac_learning *      ml;                   /*   720     8 */
	struct mcast_snooping *    ms;                   /*   728     8 */
	_Bool                      has_bonded_bundles;   /*   736     1 */
	_Bool                      lacp_enabled;         /*   737     1 */

	/* XXX 6 bytes hole, try to pack */

	struct mbridge *           mbridge;              /*   744     8 */
	struct ovs_mutex           stats_mutex;          /*   752    48 */
	/* --- cacheline 12 boundary (768 bytes) was 32 bytes ago --- */
	struct netdev_stats        stats;                /*   800   336 */
	/* --- cacheline 17 boundary (1088 bytes) was 48 bytes ago --- */
	struct stp *               stp;                  /*  1136     8 */
	long long int              stp_last_tick;        /*  1144     8 */
	/* --- cacheline 18 boundary (1152 bytes) --- */
	struct rstp *              rstp;                 /*  1152     8 */
	long long int              rstp_last_tick;       /*  1160     8 */
	struct sset                ports;                /*  1168    32 */
	struct sset                ghost_ports;          /*  1200    32 */
	/* --- cacheline 19 boundary (1216 bytes) was 16 bytes ago --- */
	struct sset                port_poll_set;        /*  1232    32 */
	int                        port_poll_errno;      /*  1264     4 */

	/* XXX 4 bytes hole, try to pack */

	uint64_t                   change_seq;           /*  1272     8 */
	/* --- cacheline 20 boundary (1280 bytes) --- */
	struct guarded_list        ams;                  /*  1280    72 */
	/* --- cacheline 21 boundary (1344 bytes) was 8 bytes ago --- */
	struct seq *               ams_seq;              /*  1352     8 */
	uint64_t                   ams_seqno;            /*  1360     8 */

	/* size: 1368, cachelines: 22, members: 32 */
	/* sum members: 1358, holes: 2, sum holes: 10 */
	/* last cacheline: 24 bytes */
};
struct bond_entry {
	struct bond_slave *        slave;                /*     0     8 */
	uint64_t                   tx_bytes;             /*     8     8 */
	struct ovs_list            list_node;            /*    16    16 */
	struct rule *              pr_rule;              /*    32     8 */
	uint64_t                   pr_tx_bytes;          /*    40     8 */

	/* size: 48, cachelines: 1, members: 5 */
	/* last cacheline: 48 bytes */
};
struct bond_slave {
	struct hmap_node           hmap_node;            /*     0    16 */
	struct ovs_list            list_node;            /*    16    16 */
	struct bond *              bond;                 /*    32     8 */
	void *                     aux;                  /*    40     8 */
	struct netdev *            netdev;               /*    48     8 */
	uint64_t                   change_seq;           /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	char *                     name;                 /*    64     8 */
	ofp_port_t                 ofp_port;             /*    72     4 */
	_Bool                      enabled;              /*    76     1 */
	_Bool                      may_enable;           /*    77     1 */

	/* XXX 2 bytes hole, try to pack */

	long long int              delay_expires;        /*    80     8 */
	struct ovs_list            bal_node;             /*    88    16 */
	struct ovs_list            entries;              /*   104    16 */
	uint64_t                   tx_bytes;             /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */

	/* size: 128, cachelines: 2, members: 14 */
	/* sum members: 126, holes: 1, sum holes: 2 */
};
struct bond {
	struct hmap_node           hmap_node;            /*     0    16 */
	char *                     name;                 /*    16     8 */
	struct ofproto_dpif *      ofproto;              /*    24     8 */
	struct hmap                slaves;               /*    32    32 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	struct ovs_mutex           mutex;                /*    64    48 */
	struct ovs_list            enabled_slaves;       /*   112    16 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	enum bond_mode             balance;              /*   128     4 */

	/* XXX 4 bytes hole, try to pack */

	struct bond_slave *        active_slave;         /*   136     8 */
	int                        updelay;              /*   144     4 */
	int                        downdelay;            /*   148     4 */
	enum lacp_status           lacp_status;          /*   152     4 */
	_Bool                      bond_revalidate;      /*   156     1 */

	/* XXX 3 bytes hole, try to pack */

	uint32_t                   basis;                /*   160     4 */

	/* XXX 4 bytes hole, try to pack */

	struct bond_entry *        hash;                 /*   168     8 */
	int                        rebalance_interval;   /*   176     4 */

	/* XXX 4 bytes hole, try to pack */

	long long int              next_rebalance;       /*   184     8 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	_Bool                      send_learning_packets; /*   192     1 */

	/* XXX 3 bytes hole, try to pack */

	uint32_t                   recirc_id;            /*   196     4 */
	struct hmap                pr_rule_ops;          /*   200    32 */
	_Bool                      active_slave_changed; /*   232     1 */

	/* XXX 1 byte hole, try to pack */

	struct eth_addr            active_slave_mac;     /*   234     6 */
	_Bool                      lacp_fallback_ab;     /*   240     1 */

	/* XXX 3 bytes hole, try to pack */

	struct ovs_refcount        ref_cnt;              /*   244     4 */

	/* size: 248, cachelines: 4, members: 23 */
	/* sum members: 226, holes: 7, sum holes: 22 */
	/* last cacheline: 56 bytes */
};
struct bond_pr_rule_op {
	struct hmap_node           hmap_node;            /*     0    16 */
	struct match               match;                /*    16  3400 */
	/* --- cacheline 53 boundary (3392 bytes) was 24 bytes ago --- */
	ofp_port_t                 out_ofport;           /*  3416     4 */
	enum bond_op               op;                   /*  3420     4 */
	struct rule * *            pr_rule;              /*  3424     8 */

	/* size: 3432, cachelines: 54, members: 5 */
	/* last cacheline: 40 bytes */
};
struct ofpact_queue {
	struct ofpact              ofpact;               /*     0     4 */
	uint32_t                   queue_id;             /*     4     4 */

	/* size: 8, cachelines: 1, members: 2 */
	/* last cacheline: 8 bytes */
};
struct in_band_remote {
	struct sockaddr_in         remote_addr;          /*     0    16 */
	struct eth_addr            remote_mac;           /*    16     6 */
	struct eth_addr            last_remote_mac;      /*    22     6 */

	/* XXX 4 bytes hole, try to pack */

	struct netdev *            remote_netdev;        /*    32     8 */

	/* size: 40, cachelines: 1, members: 4 */
	/* sum members: 36, holes: 1, sum holes: 4 */
	/* last cacheline: 40 bytes */
};
struct in_band_rule {
	struct hmap_node           hmap_node;            /*     0    16 */
	struct match               match;                /*    16  3400 */
	/* --- cacheline 53 boundary (3392 bytes) was 24 bytes ago --- */
	int                        priority;             /*  3416     4 */
	enum in_band_op            op;                   /*  3420     4 */

	/* size: 3424, cachelines: 54, members: 4 */
	/* last cacheline: 32 bytes */
};
struct in_band {
	struct ofproto *           ofproto;              /*     0     8 */
	int                        queue_id;             /*     8     4 */

	/* XXX 4 bytes hole, try to pack */

	time_t                     next_remote_refresh;  /*    16     8 */
	struct in_band_remote *    remotes;              /*    24     8 */
	size_t                     n_remotes;            /*    32     8 */
	time_t                     next_local_refresh;   /*    40     8 */
	struct eth_addr            local_mac;            /*    48     6 */

	/* XXX 2 bytes hole, try to pack */

	struct netdev *            local_netdev;         /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	struct hmap                rules;                /*    64    32 */

	/* size: 96, cachelines: 2, members: 9 */
	/* sum members: 90, holes: 2, sum holes: 6 */
	/* last cacheline: 32 bytes */
};
struct cmap_cursor {
	const struct cmap_impl  *  impl;                 /*     0     8 */
	uint32_t                   bucket_idx;           /*     8     4 */
	int                        entry_idx;            /*    12     4 */
	struct cmap_node *         node;                 /*    16     8 */

	/* size: 24, cachelines: 1, members: 4 */
	/* last cacheline: 24 bytes */
};
struct ofp_desc_stats {
	char                       mfr_desc[256];        /*     0   256 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	char                       hw_desc[256];         /*   256   256 */
	/* --- cacheline 8 boundary (512 bytes) --- */
	char                       sw_desc[256];         /*   512   256 */
	/* --- cacheline 12 boundary (768 bytes) --- */
	char                       serial_num[32];       /*   768    32 */
	char                       dp_desc[256];         /*   800   256 */
	/* --- cacheline 16 boundary (1024 bytes) was 32 bytes ago --- */

	/* size: 1056, cachelines: 17, members: 5 */
	/* last cacheline: 32 bytes */
};
struct nx_flow_mod_table_id {
	uint8_t                    set;                  /*     0     1 */
	uint8_t                    pad[7];               /*     1     7 */

	/* size: 8, cachelines: 1, members: 2 */
	/* last cacheline: 8 bytes */
};
struct nx_set_packet_in_format {
	ovs_be32                   format;               /*     0     4 */

	/* size: 4, cachelines: 1, members: 1 */
	/* last cacheline: 4 bytes */
};
struct nx_set_flow_format {
	ovs_be32                   format;               /*     0     4 */

	/* size: 4, cachelines: 1, members: 1 */
	/* last cacheline: 4 bytes */
};
struct nx_controller_id {
	uint8_t                    zero[6];              /*     0     6 */
	ovs_be16                   controller_id;        /*     6     2 */

	/* size: 8, cachelines: 1, members: 2 */
	/* last cacheline: 8 bytes */
};
struct nx_zone_id {
	uint8_t                    zero[6];              /*     0     6 */
	ovs_be16                   zone_id;              /*     6     2 */

	/* size: 8, cachelines: 1, members: 2 */
	/* last cacheline: 8 bytes */
};
struct pvector_cursor {
	size_t                     size;                 /*     0     8 */
	size_t                     entry_idx;            /*     8     8 */
	const struct pvector_entry  * vector;            /*    16     8 */

	/* size: 24, cachelines: 1, members: 3 */
	/* last cacheline: 24 bytes */
};
struct cls_cursor {
	const struct classifier  * cls;                  /*     0     8 */
	const struct cls_subtable  * subtable;           /*     8     8 */
	const struct cls_rule  *   target;               /*    16     8 */
	ovs_version_t              version;              /*    24     8 */
	struct pvector_cursor      subtables;            /*    32    24 */
	const struct cls_rule  *   rule;                 /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */

	/* size: 64, cachelines: 1, members: 6 */
};
struct ofputil_flow_mod {
	struct ovs_list            list_node;            /*     0    16 */
	struct match               match;                /*    16  3400 */
	/* --- cacheline 53 boundary (3392 bytes) was 24 bytes ago --- */
	int                        priority;             /*  3416     4 */

	/* XXX 4 bytes hole, try to pack */

	ovs_be64                   cookie;               /*  3424     8 */
	ovs_be64                   cookie_mask;          /*  3432     8 */
	ovs_be64                   new_cookie;           /*  3440     8 */
	_Bool                      modify_cookie;        /*  3448     1 */
	uint8_t                    table_id;             /*  3449     1 */
	uint16_t                   command;              /*  3450     2 */
	uint16_t                   idle_timeout;         /*  3452     2 */
	uint16_t                   hard_timeout;         /*  3454     2 */
	/* --- cacheline 54 boundary (3456 bytes) --- */
	uint32_t                   buffer_id;            /*  3456     4 */
	ofp_port_t                 out_port;             /*  3460     4 */
	uint32_t                   out_group;            /*  3464     4 */
	enum ofputil_flow_mod_flags flags;               /*  3468     4 */
	uint16_t                   importance;           /*  3472     2 */

	/* XXX 6 bytes hole, try to pack */

	struct ofpact *            ofpacts;              /*  3480     8 */
	size_t                     ofpacts_len;          /*  3488     8 */
	uint64_t                   ofpacts_tlv_bitmap;   /*  3496     8 */

	/* size: 3504, cachelines: 55, members: 19 */
	/* sum members: 3494, holes: 2, sum holes: 10 */
	/* last cacheline: 48 bytes */
};
struct ofputil_flow_stats_request {
	_Bool                      aggregate;            /*     0     1 */

	/* XXX 7 bytes hole, try to pack */

	struct match               match;                /*     8  3400 */
	/* --- cacheline 53 boundary (3392 bytes) was 16 bytes ago --- */
	ovs_be64                   cookie;               /*  3408     8 */
	ovs_be64                   cookie_mask;          /*  3416     8 */
	ofp_port_t                 out_port;             /*  3424     4 */
	uint32_t                   out_group;            /*  3428     4 */
	uint8_t                    table_id;             /*  3432     1 */

	/* size: 3440, cachelines: 54, members: 7 */
	/* sum members: 3426, holes: 1, sum holes: 7 */
	/* padding: 7 */
	/* last cacheline: 48 bytes */
};
struct ofputil_flow_stats {
	struct match               match;                /*     0  3400 */
	/* --- cacheline 53 boundary (3392 bytes) was 8 bytes ago --- */
	ovs_be64                   cookie;               /*  3400     8 */
	uint8_t                    table_id;             /*  3408     1 */

	/* XXX 1 byte hole, try to pack */

	uint16_t                   priority;             /*  3410     2 */
	uint16_t                   idle_timeout;         /*  3412     2 */
	uint16_t                   hard_timeout;         /*  3414     2 */
	uint32_t                   duration_sec;         /*  3416     4 */
	uint32_t                   duration_nsec;        /*  3420     4 */
	int                        idle_age;             /*  3424     4 */
	int                        hard_age;             /*  3428     4 */
	uint64_t                   packet_count;         /*  3432     8 */
	uint64_t                   byte_count;           /*  3440     8 */
	const struct ofpact  *     ofpacts;              /*  3448     8 */
	/* --- cacheline 54 boundary (3456 bytes) --- */
	size_t                     ofpacts_len;          /*  3456     8 */
	enum ofputil_flow_mod_flags flags;               /*  3464     4 */
	uint16_t                   importance;           /*  3468     2 */

	/* size: 3472, cachelines: 55, members: 16 */
	/* sum members: 3469, holes: 1, sum holes: 1 */
	/* padding: 2 */
	/* last cacheline: 16 bytes */
};
struct ofputil_aggregate_stats {
	uint64_t                   packet_count;         /*     0     8 */
	uint64_t                   byte_count;           /*     8     8 */
	uint32_t                   flow_count;           /*    16     4 */

	/* size: 24, cachelines: 1, members: 3 */
	/* padding: 4 */
	/* last cacheline: 24 bytes */
};
struct ofputil_packet_out {
	const void  *              packet;               /*     0     8 */
	size_t                     packet_len;           /*     8     8 */
	uint32_t                   buffer_id;            /*    16     4 */

	/* XXX 4 bytes hole, try to pack */

	struct match               flow_metadata;        /*    24  3400 */
	/* --- cacheline 53 boundary (3392 bytes) was 32 bytes ago --- */
	struct ofpact *            ofpacts;              /*  3424     8 */
	size_t                     ofpacts_len;          /*  3432     8 */

	/* size: 3440, cachelines: 54, members: 6 */
	/* sum members: 3436, holes: 1, sum holes: 4 */
	/* last cacheline: 48 bytes */
};
struct ofputil_switch_config {
	enum ofputil_frag_handling frag;                 /*     0     4 */
	int                        invalid_ttl_to_controller; /*     4     4 */
	uint16_t                   miss_send_len;        /*     8     2 */

	/* size: 12, cachelines: 1, members: 3 */
	/* padding: 2 */
	/* last cacheline: 12 bytes */
};
struct ofputil_switch_features {
	uint64_t                   datapath_id;          /*     0     8 */
	uint32_t                   n_buffers;            /*     8     4 */
	uint8_t                    n_tables;             /*    12     1 */
	uint8_t                    auxiliary_id;         /*    13     1 */

	/* XXX 2 bytes hole, try to pack */

	enum ofputil_capabilities  capabilities;         /*    16     4 */

	/* XXX 4 bytes hole, try to pack */

	uint64_t                   ofpacts;              /*    24     8 */

	/* size: 32, cachelines: 1, members: 6 */
	/* sum members: 26, holes: 2, sum holes: 6 */
	/* last cacheline: 32 bytes */
};
struct ofputil_table_mod {
	uint8_t                    table_id;             /*     0     1 */

	/* XXX 3 bytes hole, try to pack */

	enum ofputil_table_miss    miss;                 /*     4     4 */
	enum ofputil_table_eviction eviction;            /*     8     4 */
	uint32_t                   eviction_flags;       /*    12     4 */
	enum ofputil_table_vacancy vacancy;              /*    16     4 */
	struct ofputil_table_mod_prop_vacancy table_vacancy; /*    20     3 */

	/* size: 24, cachelines: 1, members: 6 */
	/* sum members: 20, holes: 1, sum holes: 3 */
	/* padding: 1 */
	/* last cacheline: 24 bytes */
};
struct ofputil_role_request {
	enum ofp12_controller_role role;                 /*     0     4 */
	_Bool                      have_generation_id;   /*     4     1 */

	/* XXX 3 bytes hole, try to pack */

	uint64_t                   generation_id;        /*     8     8 */

	/* size: 16, cachelines: 1, members: 3 */
	/* sum members: 13, holes: 1, sum holes: 3 */
	/* last cacheline: 16 bytes */
};
struct ofputil_queue_config {
	ofp_port_t                 port;                 /*     0     4 */
	uint32_t                   queue;                /*     4     4 */
	uint16_t                   min_rate;             /*     8     2 */
	uint16_t                   max_rate;             /*    10     2 */

	/* size: 12, cachelines: 1, members: 4 */
	/* last cacheline: 12 bytes */
};
struct ofputil_port_stats {
	ofp_port_t                 port_no;              /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	struct netdev_stats        stats;                /*     8   336 */
	/* --- cacheline 5 boundary (320 bytes) was 24 bytes ago --- */
	uint32_t                   duration_sec;         /*   344     4 */
	uint32_t                   duration_nsec;        /*   348     4 */

	/* size: 352, cachelines: 6, members: 4 */
	/* sum members: 348, holes: 1, sum holes: 4 */
	/* last cacheline: 32 bytes */
};
struct ofputil_queue_stats_request {
	ofp_port_t                 port_no;              /*     0     4 */
	uint32_t                   queue_id;             /*     4     4 */

	/* size: 8, cachelines: 1, members: 2 */
	/* last cacheline: 8 bytes */
};
struct ofputil_queue_stats {
	ofp_port_t                 port_no;              /*     0     4 */
	uint32_t                   queue_id;             /*     4     4 */
	uint64_t                   tx_bytes;             /*     8     8 */
	uint64_t                   tx_packets;           /*    16     8 */
	uint64_t                   tx_errors;            /*    24     8 */
	uint32_t                   duration_sec;         /*    32     4 */
	uint32_t                   duration_nsec;        /*    36     4 */

	/* size: 40, cachelines: 1, members: 7 */
	/* last cacheline: 40 bytes */
};
struct ofputil_bucket {
	struct ovs_list            list_node;            /*     0    16 */
	uint16_t                   weight;               /*    16     2 */

	/* XXX 2 bytes hole, try to pack */

	ofp_port_t                 watch_port;           /*    20     4 */
	uint32_t                   watch_group;          /*    24     4 */
	uint32_t                   bucket_id;            /*    28     4 */
	struct ofpact *            ofpacts;              /*    32     8 */
	size_t                     ofpacts_len;          /*    40     8 */
	struct bucket_counter      stats;                /*    48    16 */
	/* --- cacheline 1 boundary (64 bytes) --- */

	/* size: 64, cachelines: 1, members: 8 */
	/* sum members: 62, holes: 1, sum holes: 2 */
};
struct ofputil_group_desc {
	uint8_t                    type;                 /*     0     1 */

	/* XXX 3 bytes hole, try to pack */

	uint32_t                   group_id;             /*     4     4 */
	struct ovs_list            buckets;              /*     8    16 */
	struct ofputil_group_props props;                /*    24    64 */
	/* --- cacheline 1 boundary (64 bytes) was 24 bytes ago --- */

	/* size: 88, cachelines: 2, members: 4 */
	/* sum members: 85, holes: 1, sum holes: 3 */
	/* last cacheline: 24 bytes */
};
struct ofputil_bundle_ctrl_msg {
	uint32_t                   bundle_id;            /*     0     4 */
	uint16_t                   type;                 /*     4     2 */
	uint16_t                   flags;                /*     6     2 */

	/* size: 8, cachelines: 1, members: 3 */
	/* last cacheline: 8 bytes */
};
struct ofputil_bundle_add_msg {
	uint32_t                   bundle_id;            /*     0     4 */
	uint16_t                   flags;                /*     4     2 */

	/* XXX 2 bytes hole, try to pack */

	const struct ofp_header  * msg;                  /*     8     8 */

	/* size: 16, cachelines: 1, members: 3 */
	/* sum members: 14, holes: 1, sum holes: 2 */
	/* last cacheline: 16 bytes */
};
struct ofputil_tlv_table_mod {
	uint16_t                   command;              /*     0     2 */

	/* XXX 6 bytes hole, try to pack */

	struct ovs_list            mappings;             /*     8    16 */

	/* size: 24, cachelines: 1, members: 2 */
	/* sum members: 18, holes: 1, sum holes: 6 */
	/* last cacheline: 24 bytes */
};
struct ofputil_tlv_table_reply {
	uint32_t                   max_option_space;     /*     0     4 */
	uint16_t                   max_fields;           /*     4     2 */

	/* XXX 2 bytes hole, try to pack */

	struct ovs_list            mappings;             /*     8    16 */

	/* size: 24, cachelines: 1, members: 3 */
	/* sum members: 22, holes: 1, sum holes: 2 */
	/* last cacheline: 24 bytes */
};
struct iface_hint {
	char *                     br_name;              /*     0     8 */
	char *                     br_type;              /*     8     8 */
	ofp_port_t                 ofp_port;             /*    16     4 */

	/* size: 24, cachelines: 1, members: 3 */
	/* padding: 4 */
	/* last cacheline: 24 bytes */
};
struct ofproto_port_dump {
	const struct ofproto  *    ofproto;              /*     0     8 */
	int                        error;                /*     8     4 */

	/* XXX 4 bytes hole, try to pack */

	void *                     state;                /*    16     8 */

	/* size: 24, cachelines: 1, members: 3 */
	/* sum members: 20, holes: 1, sum holes: 4 */
	/* last cacheline: 24 bytes */
};
struct ofproto_table_settings {
	char *                     name;                 /*     0     8 */
	unsigned int               max_flows;            /*     8     4 */
	_Bool                      enable_eviction;      /*    12     1 */

	/* XXX 3 bytes hole, try to pack */

	struct mf_subfield *       groups;               /*    16     8 */
	size_t                     n_groups;             /*    24     8 */
	unsigned int               n_prefix_fields;      /*    32     4 */
	enum mf_field_id           prefix_fields[3];     /*    36     3 */

	/* size: 40, cachelines: 1, members: 7 */
	/* sum members: 36, holes: 1, sum holes: 3 */
	/* padding: 1 */
	/* last cacheline: 40 bytes */
};
struct ofpact_meter {
	struct ofpact              ofpact;               /*     0     4 */
	uint32_t                   meter_id;             /*     4     4 */
	uint32_t                   provider_meter_id;    /*     8     4 */

	/* size: 12, cachelines: 1, members: 3 */
	/* last cacheline: 12 bytes */
};
struct ofpact_learn_spec {
	union {
		struct {
			struct mf_subfield src;          /*     0    16 */
			struct mf_subfield dst;          /*    16    16 */
			uint16_t   src_type;             /*    32     2 */
			uint16_t   dst_type;             /*    34     2 */
			uint8_t    n_bits;               /*    36     1 */
		};                                       /*          40 */
		uint8_t            pad7[40];             /*          40 */
	};                                               /*     0    40 */

	/* size: 40, cachelines: 1, members: 1 */
	/* last cacheline: 40 bytes */
};
struct ofpact_learn {
	union {
		struct {
			struct ofpact ofpact;            /*     0     4 */
			uint16_t   idle_timeout;         /*     4     2 */
			uint16_t   hard_timeout;         /*     6     2 */
			uint16_t   priority;             /*     8     2 */
			uint8_t    table_id;             /*    10     1 */
			enum nx_learn_flags flags;       /*    12     4 */
			ovs_be64   cookie;               /*    16     8 */
			uint16_t   fin_idle_timeout;     /*    24     2 */
			uint16_t   fin_hard_timeout;     /*    26     2 */
			uint32_t   limit;                /*    28     4 */
			struct mf_subfield result_dst;   /*    32    16 */
		};                                       /*          48 */
		uint8_t            pad8[48];             /*          48 */
	};                                               /*     0    48 */
	struct ofpact_learn_spec   specs[0];             /*    48     0 */

	/* size: 48, cachelines: 1, members: 2 */
	/* last cacheline: 48 bytes */
};
struct ofpact_conjunction {
	struct ofpact              ofpact;               /*     0     4 */
	uint8_t                    clause;               /*     4     1 */
	uint8_t                    n_clauses;            /*     5     1 */

	/* XXX 2 bytes hole, try to pack */

	uint32_t                   id;                   /*     8     4 */

	/* size: 12, cachelines: 1, members: 4 */
	/* sum members: 10, holes: 1, sum holes: 2 */
	/* last cacheline: 12 bytes */
};
struct ofpact_group {
	struct ofpact              ofpact;               /*     0     4 */
	uint32_t                   group_id;             /*     4     4 */

	/* size: 8, cachelines: 1, members: 2 */
	/* last cacheline: 8 bytes */
};
struct simap_node {
	struct hmap_node           node;                 /*     0    16 */
	char *                     name;                 /*    16     8 */
	unsigned int               data;                 /*    24     4 */

	/* size: 32, cachelines: 1, members: 3 */
	/* padding: 4 */
	/* last cacheline: 32 bytes */
};
struct eviction_group {
	struct hmap_node           id_node;              /*     0    16 */
	struct heap_node           size_node;            /*    16    16 */
	struct heap                rules;                /*    32    24 */

	/* size: 56, cachelines: 1, members: 3 */
	/* last cacheline: 56 bytes */
};
struct netdev_queue_stats {
	uint64_t                   tx_bytes;             /*     0     8 */
	uint64_t                   tx_packets;           /*     8     8 */
	uint64_t                   tx_errors;            /*    16     8 */
	long long int              created;              /*    24     8 */

	/* size: 32, cachelines: 1, members: 4 */
	/* last cacheline: 32 bytes */
};
struct netdev_queue_dump {
	struct netdev *            netdev;               /*     0     8 */
	int                        error;                /*     8     4 */

	/* XXX 4 bytes hole, try to pack */

	void *                     state;                /*    16     8 */

	/* size: 24, cachelines: 1, members: 3 */
	/* sum members: 20, holes: 1, sum holes: 4 */
	/* last cacheline: 24 bytes */
};
struct learned_cookie {
	union {
		struct hmap_node   hmap_node;            /*          16 */
		struct ovs_list    list_node;            /*          16 */
	} u;                                             /*     0    16 */
	ovs_be64                   cookie;               /*    16     8 */
	uint8_t                    table_id;             /*    24     1 */

	/* XXX 3 bytes hole, try to pack */

	int                        n;                    /*    28     4 */

	/* size: 32, cachelines: 1, members: 4 */
	/* sum members: 29, holes: 1, sum holes: 3 */
	/* last cacheline: 32 bytes */
};
struct ofport_usage {
	struct hmap_node           hmap_node;            /*     0    16 */
	ofp_port_t                 ofp_port;             /*    16     4 */

	/* XXX 4 bytes hole, try to pack */

	long long int              last_used;            /*    24     8 */

	/* size: 32, cachelines: 1, members: 3 */
	/* sum members: 28, holes: 1, sum holes: 4 */
	/* last cacheline: 32 bytes */
};
struct openflow_mod_requester {
	struct ofconn *            ofconn;               /*     0     8 */
	const struct ofp_header  * request;              /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct queue_stats_cbdata {
	struct ofport *            ofport;               /*     0     8 */
	struct ovs_list            replies;              /*     8    16 */
	long long int              now;                  /*    24     8 */

	/* size: 32, cachelines: 1, members: 3 */
	/* last cacheline: 32 bytes */
};
struct meter {
	struct hmap_node           node;                 /*     0    16 */
	long long int              created;              /*    16     8 */
	struct ovs_list            rules;                /*    24    16 */
	uint32_t                   id;                   /*    40     4 */
	ofproto_meter_id           provider_meter_id;    /*    44     4 */
	uint16_t                   flags;                /*    48     2 */
	uint16_t                   n_bands;              /*    50     2 */

	/* XXX 4 bytes hole, try to pack */

	struct ofputil_meter_band * bands;               /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */

	/* size: 64, cachelines: 1, members: 8 */
	/* sum members: 60, holes: 1, sum holes: 4 */
};
struct timeval {
	__time_t                   tv_sec;               /*     0     8 */
	__suseconds_t              tv_usec;              /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct genevehdr {
	uint8_t                    opt_len:6;            /*     0: 2  1 */
	uint8_t                    ver:2;                /*     0: 0  1 */
	uint8_t                    rsvd1:6;              /*     1: 2  1 */
	uint8_t                    critical:1;           /*     1: 1  1 */
	uint8_t                    oam:1;                /*     1: 0  1 */
	ovs_be16                   proto_type;           /*     2     2 */
	ovs_16aligned_be32         vni;                  /*     4     4 */
	struct geneve_opt          options[0];           /*     8     0 */

	/* size: 8, cachelines: 1, members: 8 */
	/* last cacheline: 8 bytes */
};
struct ovs_key_mpls {
	ovs_be32                   mpls_lse;             /*     0     4 */

	/* size: 4, cachelines: 1, members: 1 */
	/* last cacheline: 4 bytes */
};
struct ovs_key_ipv4 {
	ovs_be32                   ipv4_src;             /*     0     4 */
	ovs_be32                   ipv4_dst;             /*     4     4 */
	uint8_t                    ipv4_proto;           /*     8     1 */
	uint8_t                    ipv4_tos;             /*     9     1 */
	uint8_t                    ipv4_ttl;             /*    10     1 */
	uint8_t                    ipv4_frag;            /*    11     1 */

	/* size: 12, cachelines: 1, members: 6 */
	/* last cacheline: 12 bytes */
};
struct ovs_key_tcp {
	ovs_be16                   tcp_src;              /*     0     2 */
	ovs_be16                   tcp_dst;              /*     2     2 */

	/* size: 4, cachelines: 1, members: 2 */
	/* last cacheline: 4 bytes */
};
struct ovs_action_push_mpls {
	ovs_be32                   mpls_lse;             /*     0     4 */
	ovs_be16                   mpls_ethertype;       /*     4     2 */

	/* size: 8, cachelines: 1, members: 2 */
	/* padding: 2 */
	/* last cacheline: 8 bytes */
};
struct nlattr {
	__u16                      nla_len;              /*     0     2 */
	__u16                      nla_type;             /*     2     2 */

	/* size: 4, cachelines: 1, members: 2 */
	/* last cacheline: 4 bytes */
};
struct eth_header {
	struct eth_addr            eth_dst;              /*     0     6 */
	struct eth_addr            eth_src;              /*     6     6 */
	ovs_be16                   eth_type;             /*    12     2 */

	/* size: 14, cachelines: 1, members: 3 */
	/* last cacheline: 14 bytes */
};
struct ip_header {
	uint8_t                    ip_ihl_ver;           /*     0     1 */
	uint8_t                    ip_tos;               /*     1     1 */
	ovs_be16                   ip_tot_len;           /*     2     2 */
	ovs_be16                   ip_id;                /*     4     2 */
	ovs_be16                   ip_frag_off;          /*     6     2 */
	uint8_t                    ip_ttl;               /*     8     1 */
	uint8_t                    ip_proto;             /*     9     1 */
	ovs_be16                   ip_csum;              /*    10     2 */
	ovs_16aligned_be32         ip_src;               /*    12     4 */
	ovs_16aligned_be32         ip_dst;               /*    16     4 */

	/* size: 20, cachelines: 1, members: 10 */
	/* last cacheline: 20 bytes */
};
struct udp_header {
	ovs_be16                   udp_src;              /*     0     2 */
	ovs_be16                   udp_dst;              /*     2     2 */
	ovs_be16                   udp_len;              /*     4     2 */
	ovs_be16                   udp_csum;             /*     6     2 */

	/* size: 8, cachelines: 1, members: 4 */
	/* last cacheline: 8 bytes */
};
struct gre_base_hdr {
	ovs_be16                   flags;                /*     0     2 */
	ovs_be16                   protocol;             /*     2     2 */

	/* size: 4, cachelines: 1, members: 2 */
	/* last cacheline: 4 bytes */
};
struct vxlanhdr {
	union {
		ovs_16aligned_be32 vx_flags;             /*           4 */
		struct {
			uint8_t    flags;                /*     0     1 */
			uint8_t    reserved[2];          /*     1     2 */
			uint8_t    next_protocol;        /*     3     1 */
		} vx_gpe;                                /*           4 */
	};                                               /*     0     4 */
	ovs_16aligned_be32         vx_vni;               /*     4     4 */

	/* size: 8, cachelines: 1, members: 2 */
	/* last cacheline: 8 bytes */
};
struct dpif_sflow_actions {
	odp_port_t                 out_port;             /*     0     4 */
	uint32_t                   encap_depth;          /*     4     4 */
	struct flow_tnl            tunnel;               /*     8   344 */
	/* --- cacheline 5 boundary (320 bytes) was 32 bytes ago --- */
	uint8_t                    tunnel_ipproto;       /*   352     1 */
	_Bool                      tunnel_err;           /*   353     1 */

	/* XXX 2 bytes hole, try to pack */

	uint32_t                   mpls_lse[3];          /*   356    12 */
	uint32_t                   mpls_stack_depth;     /*   368     4 */
	_Bool                      mpls_err;             /*   372     1 */

	/* size: 376, cachelines: 6, members: 8 */
	/* sum members: 371, holes: 1, sum holes: 2 */
	/* padding: 3 */
	/* last cacheline: 56 bytes */
};
struct rusage {
	struct timeval             ru_utime;             /*     0    16 */
	struct timeval             ru_stime;             /*    16    16 */
	union {
		long int           ru_maxrss;            /*           8 */
		__syscall_slong_t  __ru_maxrss_word;     /*           8 */
	};                                               /*    32     8 */
	union {
		long int           ru_ixrss;             /*           8 */
		__syscall_slong_t  __ru_ixrss_word;      /*           8 */
	};                                               /*    40     8 */
	union {
		long int           ru_idrss;             /*           8 */
		__syscall_slong_t  __ru_idrss_word;      /*           8 */
	};                                               /*    48     8 */
	union {
		long int           ru_isrss;             /*           8 */
		__syscall_slong_t  __ru_isrss_word;      /*           8 */
	};                                               /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	union {
		long int           ru_minflt;            /*           8 */
		__syscall_slong_t  __ru_minflt_word;     /*           8 */
	};                                               /*    64     8 */
	union {
		long int           ru_majflt;            /*           8 */
		__syscall_slong_t  __ru_majflt_word;     /*           8 */
	};                                               /*    72     8 */
	union {
		long int           ru_nswap;             /*           8 */
		__syscall_slong_t  __ru_nswap_word;      /*           8 */
	};                                               /*    80     8 */
	union {
		long int           ru_inblock;           /*           8 */
		__syscall_slong_t  __ru_inblock_word;    /*           8 */
	};                                               /*    88     8 */
	union {
		long int           ru_oublock;           /*           8 */
		__syscall_slong_t  __ru_oublock_word;    /*           8 */
	};                                               /*    96     8 */
	union {
		long int           ru_msgsnd;            /*           8 */
		__syscall_slong_t  __ru_msgsnd_word;     /*           8 */
	};                                               /*   104     8 */
	union {
		long int           ru_msgrcv;            /*           8 */
		__syscall_slong_t  __ru_msgrcv_word;     /*           8 */
	};                                               /*   112     8 */
	union {
		long int           ru_nsignals;          /*           8 */
		__syscall_slong_t  __ru_nsignals_word;   /*           8 */
	};                                               /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	union {
		long int           ru_nvcsw;             /*           8 */
		__syscall_slong_t  __ru_nvcsw_word;      /*           8 */
	};                                               /*   128     8 */
	union {
		long int           ru_nivcsw;            /*           8 */
		__syscall_slong_t  __ru_nivcsw_word;     /*           8 */
	};                                               /*   136     8 */

	/* size: 144, cachelines: 3, members: 16 */
	/* last cacheline: 16 bytes */
};
struct dpif_dp_stats {
	uint64_t                   n_hit;                /*     0     8 */
	uint64_t                   n_missed;             /*     8     8 */
	uint64_t                   n_lost;               /*    16     8 */
	uint64_t                   n_flows;              /*    24     8 */
	uint64_t                   n_mask_hit;           /*    32     8 */
	uint32_t                   n_masks;              /*    40     4 */

	/* size: 48, cachelines: 1, members: 6 */
	/* padding: 4 */
	/* last cacheline: 48 bytes */
};
struct _SFLAddress {
	u_int32_t                  type;                 /*     0     4 */
	SFLAddress_value           address;              /*     4    16 */

	/* size: 20, cachelines: 1, members: 2 */
	/* last cacheline: 20 bytes */
};
struct _SFLSampled_header {
	u_int32_t                  header_protocol;      /*     0     4 */
	u_int32_t                  frame_length;         /*     4     4 */
	u_int32_t                  stripped;             /*     8     4 */
	u_int32_t                  header_length;        /*    12     4 */
	u_int8_t *                 header_bytes;         /*    16     8 */

	/* size: 24, cachelines: 1, members: 5 */
	/* last cacheline: 24 bytes */
};
struct _SFLSampled_ethernet {
	u_int32_t                  eth_len;              /*     0     4 */
	struct eth_addr            src_mac;              /*     4     6 */
	u_int8_t                   pad1[2];              /*    10     2 */
	struct eth_addr            dst_mac;              /*    12     6 */
	u_int8_t                   pad2[2];              /*    18     2 */
	u_int32_t                  eth_type;             /*    20     4 */

	/* size: 24, cachelines: 1, members: 6 */
	/* last cacheline: 24 bytes */
};
struct _SFLSampled_ipv4 {
	u_int32_t                  length;               /*     0     4 */
	u_int32_t                  protocol;             /*     4     4 */
	SFLIPv4                    src_ip;               /*     8     4 */
	SFLIPv4                    dst_ip;               /*    12     4 */
	u_int32_t                  src_port;             /*    16     4 */
	u_int32_t                  dst_port;             /*    20     4 */
	u_int32_t                  tcp_flags;            /*    24     4 */
	u_int32_t                  tos;                  /*    28     4 */

	/* size: 32, cachelines: 1, members: 8 */
	/* last cacheline: 32 bytes */
};
struct _SFLSampled_ipv6 {
	u_int32_t                  length;               /*     0     4 */
	u_int32_t                  protocol;             /*     4     4 */
	SFLIPv6                    src_ip;               /*     8    16 */
	SFLIPv6                    dst_ip;               /*    24    16 */
	u_int32_t                  src_port;             /*    40     4 */
	u_int32_t                  dst_port;             /*    44     4 */
	u_int32_t                  tcp_flags;            /*    48     4 */
	u_int32_t                  priority;             /*    52     4 */

	/* size: 56, cachelines: 1, members: 8 */
	/* last cacheline: 56 bytes */
};
struct _SFLExtended_switch {
	u_int32_t                  src_vlan;             /*     0     4 */
	u_int32_t                  src_priority;         /*     4     4 */
	u_int32_t                  dst_vlan;             /*     8     4 */
	u_int32_t                  dst_priority;         /*    12     4 */

	/* size: 16, cachelines: 1, members: 4 */
	/* last cacheline: 16 bytes */
};
struct _SFLExtended_router {
	SFLAddress                 nexthop;              /*     0    20 */
	u_int32_t                  src_mask;             /*    20     4 */
	u_int32_t                  dst_mask;             /*    24     4 */

	/* size: 28, cachelines: 1, members: 3 */
	/* last cacheline: 28 bytes */
};
struct _SFLExtended_as_path_segment {
	u_int32_t                  type;                 /*     0     4 */
	u_int32_t                  length;               /*     4     4 */
	union {
		u_int32_t *        set;                  /*           8 */
		u_int32_t *        seq;                  /*           8 */
	} as;                                            /*     8     8 */

	/* size: 16, cachelines: 1, members: 3 */
	/* last cacheline: 16 bytes */
};
struct _SFLExtended_gateway {
	SFLAddress                 nexthop;              /*     0    20 */
	u_int32_t                  as;                   /*    20     4 */
	u_int32_t                  src_as;               /*    24     4 */
	u_int32_t                  src_peer_as;          /*    28     4 */
	u_int32_t                  dst_as_path_segments; /*    32     4 */

	/* XXX 4 bytes hole, try to pack */

	SFLExtended_as_path_segment * dst_as_path;       /*    40     8 */
	u_int32_t                  communities_length;   /*    48     4 */

	/* XXX 4 bytes hole, try to pack */

	u_int32_t *                communities;          /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	u_int32_t                  localpref;            /*    64     4 */

	/* size: 72, cachelines: 2, members: 9 */
	/* sum members: 60, holes: 2, sum holes: 8 */
	/* padding: 4 */
	/* last cacheline: 8 bytes */
};
struct _SFLString {
	u_int32_t                  len;                  /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	char *                     str;                  /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* sum members: 12, holes: 1, sum holes: 4 */
	/* last cacheline: 16 bytes */
};
struct _SFLExtended_user {
	u_int32_t                  src_charset;          /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	SFLString                  src_user;             /*     8    16 */
	u_int32_t                  dst_charset;          /*    24     4 */

	/* XXX 4 bytes hole, try to pack */

	SFLString                  dst_user;             /*    32    16 */

	/* size: 48, cachelines: 1, members: 4 */
	/* sum members: 40, holes: 2, sum holes: 8 */
	/* last cacheline: 48 bytes */
};
struct _SFLExtended_url {
	u_int32_t                  direction;            /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	SFLString                  url;                  /*     8    16 */
	SFLString                  host;                 /*    24    16 */

	/* size: 40, cachelines: 1, members: 3 */
	/* sum members: 36, holes: 1, sum holes: 4 */
	/* last cacheline: 40 bytes */
};
struct _SFLLabelStack {
	u_int32_t                  depth;                /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	u_int32_t *                stack;                /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* sum members: 12, holes: 1, sum holes: 4 */
	/* last cacheline: 16 bytes */
};
struct _SFLExtended_mpls {
	SFLAddress                 nextHop;              /*     0    20 */

	/* XXX 4 bytes hole, try to pack */

	SFLLabelStack              in_stack;             /*    24    16 */
	SFLLabelStack              out_stack;            /*    40    16 */

	/* size: 56, cachelines: 1, members: 3 */
	/* sum members: 52, holes: 1, sum holes: 4 */
	/* last cacheline: 56 bytes */
};
struct _SFLExtended_nat {
	SFLAddress                 src;                  /*     0    20 */
	SFLAddress                 dst;                  /*    20    20 */

	/* size: 40, cachelines: 1, members: 2 */
	/* last cacheline: 40 bytes */
};
struct _SFLExtended_mpls_tunnel {
	SFLString                  tunnel_lsp_name;      /*     0    16 */
	u_int32_t                  tunnel_id;            /*    16     4 */
	u_int32_t                  tunnel_cos;           /*    20     4 */

	/* size: 24, cachelines: 1, members: 3 */
	/* last cacheline: 24 bytes */
};
struct _SFLExtended_mpls_vc {
	SFLString                  vc_instance_name;     /*     0    16 */
	u_int32_t                  vll_vc_id;            /*    16     4 */
	u_int32_t                  vc_label_cos;         /*    20     4 */

	/* size: 24, cachelines: 1, members: 3 */
	/* last cacheline: 24 bytes */
};
struct _SFLExtended_mpls_FTN {
	SFLString                  mplsFTNDescr;         /*     0    16 */
	u_int32_t                  mplsFTNMask;          /*    16     4 */

	/* size: 24, cachelines: 1, members: 2 */
	/* padding: 4 */
	/* last cacheline: 24 bytes */
};
struct _SFLExtended_mpls_LDP_FEC {
	u_int32_t                  mplsFecAddrPrefixLength; /*     0     4 */

	/* size: 4, cachelines: 1, members: 1 */
	/* last cacheline: 4 bytes */
};
struct _SFLExtended_vlan_tunnel {
	SFLVlanStack               stack;                /*     0    16 */

	/* size: 16, cachelines: 1, members: 1 */
	/* last cacheline: 16 bytes */
};
struct _SFLExtended_vni {
	uint32_t                   vni;                  /*     0     4 */

	/* size: 4, cachelines: 1, members: 1 */
	/* last cacheline: 4 bytes */
};
struct _SFLFlow_sample_element {
	struct _SFLFlow_sample_element * nxt;            /*     0     8 */
	u_int32_t                  tag;                  /*     8     4 */
	u_int32_t                  length;               /*    12     4 */
	SFLFlow_type               flowType;             /*    16    72 */
	/* --- cacheline 1 boundary (64 bytes) was 24 bytes ago --- */

	/* size: 88, cachelines: 2, members: 4 */
	/* last cacheline: 24 bytes */
};
struct _SFLFlow_sample {
	u_int32_t                  sequence_number;      /*     0     4 */
	u_int32_t                  source_id;            /*     4     4 */
	u_int32_t                  sampling_rate;        /*     8     4 */
	u_int32_t                  sample_pool;          /*    12     4 */
	u_int32_t                  drops;                /*    16     4 */
	u_int32_t                  input;                /*    20     4 */
	u_int32_t                  output;               /*    24     4 */
	u_int32_t                  num_elements;         /*    28     4 */
	SFLFlow_sample_element *   elements;             /*    32     8 */

	/* size: 40, cachelines: 1, members: 9 */
	/* last cacheline: 40 bytes */
};
struct _SFLIf_counters {
	u_int32_t                  ifIndex;              /*     0     4 */
	u_int32_t                  ifType;               /*     4     4 */
	u_int64_t                  ifSpeed;              /*     8     8 */
	u_int32_t                  ifDirection;          /*    16     4 */
	u_int32_t                  ifStatus;             /*    20     4 */
	u_int64_t                  ifInOctets;           /*    24     8 */
	u_int32_t                  ifInUcastPkts;        /*    32     4 */
	u_int32_t                  ifInMulticastPkts;    /*    36     4 */
	u_int32_t                  ifInBroadcastPkts;    /*    40     4 */
	u_int32_t                  ifInDiscards;         /*    44     4 */
	u_int32_t                  ifInErrors;           /*    48     4 */
	u_int32_t                  ifInUnknownProtos;    /*    52     4 */
	u_int64_t                  ifOutOctets;          /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	u_int32_t                  ifOutUcastPkts;       /*    64     4 */
	u_int32_t                  ifOutMulticastPkts;   /*    68     4 */
	u_int32_t                  ifOutBroadcastPkts;   /*    72     4 */
	u_int32_t                  ifOutDiscards;        /*    76     4 */
	u_int32_t                  ifOutErrors;          /*    80     4 */
	u_int32_t                  ifPromiscuousMode;    /*    84     4 */

